{"formula":"AnFeiJieGengTang","names":{"pinyin":"an fei jie geng tang","hanzi":"安肺桔梗汤","english":"platycodon root decoction for regulating the lungs","commonEnglish":"Platycodon Root Decoction for Regulating the Lungs","aka":[""]},"herbs":[{"herb":"XingRen","dosage":"9g","actions":["Stops coughing, calms wheezing, moistens the Intestines, unblocks bowels and inhibits the growth of cancer cells.","With Zi Su Zi, for coughing and wheezing with constipation."]},{"herb":"GuaLou","dosage":"9g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi, reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"ZhiKe(Qiao)","dosage":"9g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"JieGeng","dosage":"9g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm and pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, for Lung abscess with expectoration of pus and pain in the chest and flanks.","With Gan Cao and Yi Yi Ren, for Lung abscess with chest pain, fever and a cough with foul-smelling, yellow, sticky sputum."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh, stops coughing, treats dyspnea and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge."]},{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, tonifies the Lungs, aids the circulation of moisture downward from the face, promotes the discharge of pus, generates flesh, expels toxins, generates Body Fluids and inhibits the growth of cancer cells.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesia."]},{"herb":"ZhiMu","dosage":"9g","actions":["Clears Heat and drains Fire from the Lungs and Stomach, nourishes Yin, moistens Dryness, clears Deficiency Fire and quenches thirst."]},{"herb":"ChuanBeiMu","dosage":"9g","actions":["Clears Heat, transforms Phlegm, stops coughing, nourishes and moistens the Lungs, dissipates nodules and inhibits the growth of cancer cells.","With Xing Ren, Zi Su Zi and Jie Geng, for a Wind-Cold cough.","With Zhi Mu, clears Qi and nourishes Yin, for coughing with scanty, difficult to expectorate sputum due to Yin Deficiency Fire burning the Lungs.","With Xing Ren, for a non-productive cough from Lung Deficiency disorders."]},{"herb":"SangBaiPi","dosage":"9g","actions":["Drains Heat from the Lungs, stops coughing and calms wheezing.","With Ting Li Zi, for wheezing from water and thin mucus retained in the Lungs."]},{"herb":"HanFangJi","dosage":"6g","actions":["Expels Wind-Dampness and alleviates pain.","With Huang Qi, for Wind-Dampness with Exterior Deficiency."]},{"herb":"BaiHe","dosage":"9g","actions":["Nourishes Yin, moistens the Lungs, clears Heat and stops coughing.","With Zhi Mu, for a dry cough, vexation and agitation after a warm disease."]},{"herb":"YiYiRen","dosage":"15g","actions":["Strengthens the Spleen, resolves Dampness, Expels Wind-Dampness, relieves pain, clears Heat, expels pus and inhibits the growth of cancer cells."]},{"herb":"TingLiZi","dosage":"15g","actions":["Drains the Lungs, reduces Phlegm and calms wheezing.","With Zi Su Zi, for the accumulation of Phlegm and thin mucus leading to Lung Qi constraint and blockage with coughing and wheezing which is worse when lying down, edema of the tissues of the face and head, stifling fullness and discomfort in the chest, and a reduction in the flow of urine."]},{"herb":"WuWeiZi","dosage":"3g","actions":["Tonifies Qi, astringes the leakage of Lung Qi, stops coughing, astringes sweat and generates fluids"]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, stops coughing, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jie Geng, for pain and swelling of the throat.","With Xing Ren and Chuan Bei Mu, for Heat induced dry cough."]}],"actions":["Regulates Qi","Nourishes Yin","Subdues swelling","Stops bleeding"],"syndromes":["Lung Qi and Yin Deficiency"],"manifestations":{"symptoms":["Coughing","A low or soft voice","Hoarseness","Shortness of breath","Chest pain","Sometimes facial edema"],"tongue":"Pale","tongueCoat":"White","pulse":"Thready"},"conditions":[{"condition":"Dyspnea","name":"Dyspnea on exertion"},{"condition":"LungCancer","name":"Lung cancer"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"stronger Blood cooling, Qi regulating and hemostatic effects","modifications":[{"herb":"ShengDiHuang","modification":"+ 9g Rx. Rehmanniae"},{"herb":"ZiSuZi","modification":"+ 9g Fr. Perillae"}]}]}