{"formula":"AnShenYin","names":{"pinyin":"an shen yin","hanzi":"安神飲","english":"calm the spirit drink","commonEnglish":"Calm the Spirit Drink","aka":["Spirit Pearls"]},"herbs":[{"herb":"SuanZaoRen","dosage":"9-18g","actions":["Nourishes Heart Yin, tonifies Liver Blood, calms the Spirit, astringes sweat and generates fluids.","With Yuan Zhi, balances the contracting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"YeJiaoTeng","dosage":"9-30g","actions":["Nourishes the Heart Yin and Blood, calms the Spirit, unblocks channels and dispels Wind-Dampness.","With Fu Shen, calms the Spirit."]},{"herb":"BaiHe","dosage":"9-30g","actions":["Clears the Heart, calms the Spirit, nourishes Stomach Yin, harmonizes the Middle Jiao, moistens the Lungs, clears Heat and stops coughing.","With Suan Zao Ren, for difficulty falling and staying asleep."]},{"herb":"FuLing","dosage":"9-18g","actions":["Quiets the Heart, calms the Spirit and soothes the nerves.","With Shi Chang Pu and Yuan Zhi, for insomnia and palpitations due to Spleen and Heart Insufficiency or Phlegm Obstructing the Heart."]},{"herb":"BaiDouKou","dosage":"2-10g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Stomach, warms the Middle Jiao, descends Qi and stops vomiting."]},{"herb":"ShiChangPu","dosage":"4 -9g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi, promotes Blood flow, reduces swelling and alleviates Wind-Damp Bi.","With Yuan Zhi and Fu Shen, for forgetfulness, tinnitus and impaired hearing."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"YunShi","dosage":"9-15g","actions":["Clears Heat, eliminates Dampness and kills parasites."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis , invigorates Blood circulation, moistens the Intestines and unblocks the bowels.","With Xing Ren, for constipation due Lung Qi Stagnation, Blood Stasis with pain in the chest, abdomen or throughout the body and wheezing and coughing due to Lung constraint."]},{"herb":"XingRen","dosage":"3-10g","actions":["Stops cough, calms wheezing, moistens the Intestines and unblocks bowels."]},{"herb":"YuanZhi","dosage":"3-15g","actions":["Calms the Spirit, sedates the Heart and clears the channel joining the Heart and Kidney Expels Phlegm, opens the Orifices, clears the Lungs and stops coughing.","With Fu Shen and Suan Zao Ren, for irritability, disorientation, palpitations, anxiety and insomnia due to Heart Blood Deficiency or Qi Stagnation."]},{"herb":"HuaShi","dosage":"9-18g","actions":["Releases Summeheat, resolves Dampness and expels Damp-Heat."]}],"actions":["Calms the Shen.","Soothes the Heart and Lungs by descending Qi.","Nourishes Heart Blood and Lung Yin.","Opens the Orifices of the Heart by removing Phlegm in the Upper Jiao.","Promotes the movement of Qi","Invigorates the Blood","Aromatically transforms Dampness","Expels Damp-Heat"],"syndromes":["Heart Blood and Lung Yin Deficiency with Wind-Damp-Heat"],"manifestations":{"symptoms":["Palpitations","Irritability","Anxiety","Easily startled","Insomnia","Much dreaming","Poor memory","Dizziness","Pale face and lips","Fatigue","Loose stools","Poor appetite","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion","Dry skin","Dry hair","Scanty periods","Severe, dry hacking cough or","A chronic dry cough","No sputum expectorated","Small amounts of difficult to expectorate sputum","Blood tinged sputum (when Yin Deficiency Fire is present)","Afternoon fever","Night sweats","Malar flush (especially in afternoon)","Five Sole Heat","Dry mouth and throat","Itching in throat","Hoarse voice, low voice or loss of voice","Emaciation"],"tongue":"Pale or Red and dry","tongueCoat":"None or Thin and white","pulse":"Thready and rapid or Weak or Thin and choppy"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}