{"formula":"BaiAiTang","names":{"pinyin":"bai ai tang","hanzi":"artemisiae argyi decoction (topical)","commonEnglish":"Artemisiae Argyi Decoction","aka":[""]},"herbs":[{"herb":"AiYe","dosage":"6g","actions":["Warms the channels, disperses Cold, eliminates Dampness and stops itching."]},{"herb":"JuHua","dosage":"6g","actions":["Disperses Wind and clears Heat.","With Fang Feng, for Wind-Heat irritating the Exterior."]},{"herb":"BoHe","dosage":"6g","actions":["Disperses Wind-Heat, cools and clears the head and eyes and benefits the throat.","With Jing Jie, for Wind-Heat.","With Ju Hua, for Wind-Heat.",""]},{"herb":"FangFeng","dosage":"6g","actions":["Releases the Exterior, expels External Wind and expels Wind-Dampness.","With Jing Jie, expels Wind and stops itching."]},{"herb":"GaoBen","dosage":"6g","actions":["Expels Wind, Cold and Dampness."]},{"herb":"SheXiang","dosage":"6g","actions":["Activates the Blood, dissipates masses, reduces swellings, detoxifies and opens the channels."]},{"herb":"GanSong","dosage":"6g","actions":["Awakens the Spleen, promotes the movement of Qi, unblocks Stagnation, disperses Cold and alleviates pain."]},{"herb":"ManJingZi","dosage":"6g","actions":["Disperses Wind, clears Heat and drains Dampness.","With Bo He, Jing Jie and Ju Hua, for headache, facial swelling and pain due to Wind-Heat."]},{"herb":"JingJie","dosage":"6g","actions":["Releases the Exterior, expels Wind and relieves itching.","With Bo He, disperses Wind in the head."]}],"actions":["Nourishes Yin and Blood","Clears Deficient Heat"],"syndromes":["Yin and Blood Deficiency"],"manifestations":{"symptoms":["Alopecia occurs over the vertex or at the lateral frontal areas","The hair loss is insidious","Often affects people in their twenties and thirties","The scalp is frequently greasy or itchy with dandruff","Soreness of the lower back","Abdominal pain","Emaciation","Achy and uncomfortable flesh and bones of the hands and feet","Five sole Heat","Anxiety","Dizziness","Light headedness","Tinnitus","Tidal fever","Fever with exhaustion","Recurrent fever with night sweats or hemoptysis","General disquietude","Gradually worsening afternoon fevers"],"tongue":"Red","tongueCoat":"Scanty","pulse":"Thready and rapid"},"conditions":[{"condition":"Alopecia","name":"Alopecia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Decoct the ingredients in 1.25 to 1.5 liters of water. Pour the decoction and its dregs into a large basin and allow the steam to envelop the face. When the fluid has suitably cooked, wash the head and massage the scalp for five minutes. Allow the formula to dissolve into the scalp for another five minutes. Repeat the procedure and rinse with warm water.","Do not shampoo the hair immediately after using this formula. If the hair needs washing, do so before applying the decoction."],"modifications":[]}