{"formula":"BaiHeBingSiHao","names":{"pinyin":"bai he bin si hao","hanzi":"百合病三号","english":"lily syndrome #4","commonEnglish":"Lily Syndrome #4","aka":[""]},"herbs":[{"herb":"BaiHe","dosage":"30g","actions":["Nourishes Yin, moistens the Lungs, clears Heat, stops coughing, clears the Heart and calms the Shen.","With Zhi Mu, for Lily Syndrome with irritability and mental disorientation due to Yin Deficiency or lingering Heat in the late stages of a febrile disease, dry cough and vexation and agitation after a warm disease.","With Sheng Di Huang, cools the Heart and treats both Qi and Blood to restore harmony to the Ying and Wei after a warm febrile disease."]},{"herb":"ZhiMu","dosage":"15g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, generates fluids and cools Heart Fire.","With Sha Ren, prevents Stagnation with symptoms of diarrhea, nausea or abdominal pain."]},{"herb":"GuiZhi","dosage":"6g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang, warms and facilitates the flow of Yang Qi in the chest, warms the Middle and directs Turbid Yin downward."]},{"herb":"CangZhu","dosage":"15g","actions":["Strongly dries Dampness and tonifies the Spleen."]},{"herb":"ShaRen","dosage":"15g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea."]},{"herb":"DaiZheShi","dosage":"15g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire and strongly descends rebellious Qi."]},{"herb":"YuJin","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, alleviates pain, clears the Heart and Pericardium and opens the Orifices."]},{"herb":"ChuanJiao","dosage":"7g","actions":["Warms the Middle Jiao, disperses Cold, dispels Dampness, relieves diarrhea and alleviates pain."]}],"actions":["Moves Qi","Dries Dampness","Warms the Middle","Benefits the Lungs"],"syndromes":["Lily Syndrome Bai He Bing due to Stagnation of Spleen Qi with Lung impairment"],"manifestations":{"symptoms":["Coughing","Wheezing","Dizziness","Vertigo","Headache","Abdominal distention, fullness and pain","Absentmindedness","An abnormal appetite and behavior","A bitter taste in the mouth","Belching","Hiccup","Vomiting","Diarrhea"]},"conditions":[{"condition":"LilySyndrome","name":"Lily Syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}