{"formula":"BaiHeBingYiHao","names":{"pinyin":"bai he bing yi hao","hanzi":"百合病一号","english":"lily syndrome #1","commonEnglish":"Lily Syndrome #1","aka":[""]},"herbs":[{"herb":"BaiHe","dosage":"30g","actions":["Nourishes Yin, moistens the Lungs, clears Heat, stops coughing, clears the Heart and calms the Shen.","With Zhi Mu, for Lily Syndrome with irritability and mental disorientation due to Yin Deficiency or lingering Heat in the late stages of a febrile disease, dry cough and vexation and agitation after a warm disease.","With Sheng Di Huang, cools the Heart and treats both Qi and Blood to restore harmony to the Ying and Wei after a warm febrile disease."]},{"herb":"ZhiMu","dosage":"10g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin, generates fluids and cools Heart Fire."]},{"herb":"HeHuanHua","dosage":"10g","actions":["Relieves Stagnant Liver Qi, promotes the flow of Qi in the collaterals, harmonizes the Stomach and calms the Shen.","With Ye Jiao Teng, gently and harmoniously relieves constraint, regulates Qi and nourishes the Blood and Yin to calm the Shen for insomnia secondary to Stagnation."]},{"herb":"YeJiaoTeng","dosage":"10g","actions":["Nourishes Heart Yin and Blood and calms the Spirit."]},{"herb":"MuXiang","dosage":"9g","actions":["Promotes the movement of Qi, alleviates pain, strengthens the Spleen and prevents Stagnation."]},{"herb":"DaZao","dosage":"30g","actions":["Nourishes the Blood and calms the Spirit."]}],"actions":["Nourishes Yin","Moistens the Lungs","Clears Heat","Reinforces the Heart","Calms the Shen"],"syndromes":["Lily Syndrome Bai He Bing due to Heart and Lung Yin Deficiency"],"manifestations":{"symptoms":["Severe, dry hacking cough","No sputum expectorated","Small amounts of difficult to expectorate sputum","Blood tinged sputum (when Yin Deficiency Fire is present)","Afternoon fever","Night sweats","Malar flush (especially in afternoon)","Five Sole Heat","Dry mouth and throat","Itching in throat","Hoarse voice, low voice or loss of voice","Emaciation","Palpitations","Irritability","Easily startled","Insomnia","Much dreaming","Poor memory","Low grade fever","Restlessness","Thirst"],"tongue":"Red and dry","tongueCoat":"Little or None","pulse":"Thready and rapid"},"conditions":[{"condition":"LilySyndrome","name":"Lily Syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}