{"formula":"BaiHeBingLiuHao","names":{"pinyin":"bai he bing liu hao","hanzi":"百合病六号","english":"lily syndrome #6","commonEnglish":"Lily Syndrome #6","aka":[""]},"herbs":[{"herb":"BaiHe","dosage":"30g","actions":["Clears Heat from the Heart, calms the Spirit, nourishes Yin, moistens the Lungs, clears Heat and stops coughing.","With Zhi Mu, for Lily syndrome.","With Sheng Di Huang, cools the Heart and treats both Qi and Blood to restore harmony to the Ying and Wei after a warm febrile disease.","With Zhi Mu and Sheng Di Huang, for palpitations, insomnia, restlessness, dark urine and inability to concentrate in the aftermath of a febrile disease."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, and generates fluids."]},{"herb":"ZhiMu","dosage":"10g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"QingPi","dosage":"6g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness and transforms Phlegm."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"ZhiShi","dosage":"12g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"WaLengZi","dosage":"15g","actions":["Invigorates the Blood, dissolves Phlegm and resolves Stagnation."]},{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi, alleviates pain, strengthens the Spleen and prevents Stagnation.","With Qing Pi, for abdominal pain, distention and belching."]},{"herb":"FoShou","dosage":"6g","actions":["Spreads and regulates Liver Qi, harmonizes the Stomach, dries Dampness,strengthens the Spleen, regulates Lung Qi and transforms Phlegm.","With Mu Xiang and Qing Pi, for indigestion, fullness, and discomfort in the chest, epigastrium and abdomen, anorexia, and belching or vomiting."]}],"actions":["Regulates Qi","Nourishes Yin","Nourishes the Liver"],"syndromes":["Liver Qi Stagnation with Yin Deficiency"],"manifestations":{"symptoms":["Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Dizziness","Blurred vision","Impaired vision","Dry eyes","Night blindness","Tinnitus","Headache","Nervousness","Insomnia with much dreaming","Dry throat","Thirst","Five Sole Heat","Night sweats","Light menses or","Late menses or","Amenorrhea"],"tongue":"Pink or Red","tongueCoat":"Thin and white or Little or None","pulse":"Wiry or Thready, wiry and rapid"},"conditions":[{"condition":"LilySyndrome","name":"Lily Syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Stomach Heat","modifications":[{"herb":"HuangLian","modification":"+ 7g Rz. Coptidis"},{"herb":"WuZhuYu","modification":"+ 3g Fr. Evodiae"}]}]}