{"formula":"BaiHeHuanTanTang","names":{"pinyin":"bai he huan tan tang","hanzi":"百合涣痰汤","english":"lily bulb decoction to dissolve phlegm","commonEnglish":"Lily Bulb Decoction to Dissolve Phlegm","aka":[""]},"herbs":[{"herb":"BaiHe","dosage":"30g","actions":["Nourishes Yin, moistens the Lungs, clears Heat, stops coughing, clears the Heart and calms the Shen.","With Zhi Mu, for Lily Syndrome with irritability and mental disorientation due to Yin Deficiency or lingering Heat in the late stages of a febrile disease, dry cough and vexation and agitation after a warm disease."]},{"herb":"ZhiMu","dosage":"10g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin, generates fluids and cools Heart Fire."]},{"herb":"GuaLou","dosage":"10g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi and unbinds the chest.","With Dan Nan Xing and Huang Qin, for a cough due to Phlegm-Heat.","With Zhi Ban Xia, for focal distention in the chest and diaphragm due to clumping of Phlegm and Heat leading to Qi Stagnation.","With Zhi Ban Xia, Huang Qin, Dan Nan Xing and Zhi Shi, for a productive cough with yellow, sticky Phlegm, chest congestion and hard stools due to Heat in the Lung and Large Intestine."]},{"herb":"XingRen","dosage":"9g","actions":["Stops coughing and calms wheezing."]},{"herb":"ZhiShi","dosage":"10g","actions":["Transforms Phlegm, reduces distention and resolves hardenings.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia and Fu Ling, for a cough due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Huang Qin, Zhi Mu and Gua Lou, for Phlegm-Heat in the Lungs with yellow, viscous sputum, with other Heat signs and vomiting.","With Huang Qi, for Phlegm-Heat induced Rebellious Qi with coughing, nausea, and vomiting."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao, quiets the Heart, calms the Spirit and soothes the nerves.","With Zhi Ban Xia, for Phlegm, thin mucus and turbid Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"DanNanXing","dosage":"10g","actions":["Clears Heat and dissolves Phlegm."]},{"herb":"HuangQin","dosage":"10g","actions":["Clears Heat and dries Dampness.","With Zhi Mu, for acute and chronic Lung Heat coughing."]},{"herb":"GanCao","dosage":"6g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Heat","Resolves Phlegm"],"syndromes":["Lily Syndrome due to Phlegm-Heat (Re Tan)"],"manifestations":{"symptoms":["Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"LilySyndrome","name":"Lily Syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}