{"formula":"BanXiaFuLingTang","names":{"pinyin":"ban xia fu ling tang","hanzi":"半夏茯苓湯","english":"pinellia and poria decoction","commonEnglish":"Pinellia and Poria Decoction","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"3-14g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Fu Ling, expels Phlegm and stops nausea and vomiting.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Sheng Jiang, for vomiting due to cold, thin mucus."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids.","With Zhi Ban Xia, Chen Pi and Sheng Jiang, for congested fluids in the Stomach causing nausea and vomiting."]},{"herb":"ShengJiang","dosage":"1-10g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Da Zao, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]},{"herb":"ShaRen","dosage":"1.5-7g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, calms the fetus and prevents miscarriage.","With Zhi Ban Xia, for morning sickness.","With Chen Pi, for vomiting of unadulterated, or scanty but viscous fluids."]},{"herb":"WuMei","dosage":"3-30g","actions":["Expels roundworms and alleviates pain."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and Descends Qi.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen and augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and calms the fetus.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"DaZao","dosage":"3-12 Dates","actions":["Tonifies the Spleen and Stomach and augments Qi and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Stops vomiting","Tonifies the Spleen and Stomach","Resolves Dampness"],"syndromes":["Phlegm Dampness"],"manifestations":{"symptoms":["Nausea","Vomiting","Dizziness","Anorexia","Fatigue","Abdominal and epigastric distention after eating","Four limbs feel tired and heavy","Maybe acid regurgitation or vomiting","Loose stools","Shortness of breath"],"tongue":"Pale and flabby - may have teethmarks","tongueCoat":"White","pulse":"Even, forceless and Deficient"},"conditions":[{"condition":"conditionsMorinigSickness","name":"Pernicious vomiting (gravid hyperemesis) "},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Fatigue","name":"Fatigue"},{"condition":"conditionsMorinigSickness","name":"Morning sickness"},{"condition":"Anorxia","name":"Anorexia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}