{"formula":"BaWuTang","names":{"pinyin":"ba wu tang","hanzi":"八物汤","english":"eight substances decoction","commonEnglish":"Eight Substances Decoction","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"4-21g","actions":["Strengthens the Liver and Kidneys and nourishes the Yin of the Blood.","With Bai Shao, strongly nourishes Liver Blood."]},{"herb":"BaiShao","dosage":"4-15g","actions":["Nourishes Blood, preserves Yin, calms Liver Yang and alleviates pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Blood Stasis."]},{"herb":"DangGui","dosage":"4-12g","actions":["Nourishes and activates Blood, regulates Liver and Kidneys, regulates menses and alleviates pain.","With Shu Di Huang, Bai Shao and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"ChuanXiong","dosage":"3-9g","actions":["Invigorates Blood, moves Qi, releases Stagnation and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"YanHuSuo","dosage":"9-30g","actions":["Invigorates the Blood, circulates Qi, stops pain.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Chuan Lian Zi, for flank, upper right quadrant, epigastric and abdominal pain."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation, stops pain and conducts Heat out from below.","With Yan Hu Suo, for intermittent epigastric and hypochondriac pain, hernia pain or menstrual pain with irritability due to Liver Stagnation with Heat."]},{"herb":"BingLang","dosage":"6-15g","actions":["Regulates Qi, reduces accumulations, drains downward and unblocks the bowels."]},{"herb":"MuXiang","dosage":"6-30g","actions":["Promotes the movement of Qi, alleviates pain and adjusts and regulates stagnant Qi in the Intestines.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation with abdominal distention and fullness, anorexia, aversion to the smell of food, nausea without the ability to vomit and an uncomfortable urge to defecate which is often unsuccessful."]}],"actions":["Invigorates and nourishes the Blood","Regulates Qi"],"syndromes":["Qi and Blood Stagnation with Qi Stagnation more prominent"],"manifestations":{"symptoms":["Dysmenorrhea","Distended abdominal pain, one or two days before or during menstruation which is worse with pressure","Qi Stagnation: more distention than pain","Blood Stagnation: more pain than distention","Hypomenorrhea with dark purple Blood","Bleeding is hesitant with clots","Distention and pain in the chest and flanks","Pain that is fixed, stabbing and /or severe or","Pains that move around","Depression","Irritability","Dark complexion","Fixed, palpable masses","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark Blood or clots"],"tongue":"Purple, possible purple or red spots","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"Dysmenorrhea","name":"Dysmenorrhea"},{"condition":"DrySkin","name":"Dry skin"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}