{"formula":"BaXianTang","names":{"pinyin":"ba xian tang","hanzi":"八仙散","english":"eight immortals combination","commonEnglish":"Eight Immortals Combination","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"1.5g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions.","With Shu Di Huang, for severe Qi and Blood Deficiency.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Shu Di Huang, Bai Zhu, Fu Ling and Bai Shao, for Qi and Blood Deficiency."]},{"herb":"FuLing","dosage":"2.5g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools.","with Gui Zhi, warms and transforms fluids, unblocks Yang and promotes urination.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"BaiZhu","dosage":"5g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating.","With Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Ren Shen, Fu Ling, Dang Gui, Bai Shao, Chuan Xiong, Shu Di Huang and Gan Cao, for Blood Deficiency."]},{"herb":"GanCao","dosage":"1g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChuanXiong","dosage":"1.5g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"DangGui","dosage":"1.5g","actions":["Tonifies, invigorates and harmonizes the Blood and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","with Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"BaiShao","dosage":"2g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for Dizziness, blurred vision and dysmenorrhea due to Blood Deficiency.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews for muscle spasms, pain and numbness, especially in the calf, due to Blood Deficiency.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Gui Zhi, harmonizes the Ying and Wei."]},{"herb":"ShuDiHuang","dosage":"1.5g","actions":["Nourishes the Blood.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"QiangHuo","dosage":"1.5g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"ZhiBanXia.htm","dosage":"1.5g","actions":["Dries Dampness and transforms Phlegm."]},{"herb":"ChenPi","dosage":"2g","actions":["Regulates Qi, adjusts the Middle, descends Qi, relieves the diaphragm, Dries Dampness, transforms Phlegm and helps prevent Stagnation from tonic herbs.","With Bai Shao, Fang Feng and Bai Zhu, for borborygmus, abdominal pain, and diarrhea due to Liver Attacking the Spleen.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"QinJiao","dosage":"1.5g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals.","With Dang Gui and Bai Shao, for Blood Deficiency with hemiplegia, especially with excess muscle tension in the upper extremities."]},{"herb":"NiuXi","dosage":"1.5g","actions":["Nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints."]},{"herb":"GuiZhi","dosage":"1g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]},{"herb":"ChaiHu","dosage":"1g","actions":["Harmonizes the Exterior and Interior and raises Yang Qi.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Bai Shao, Dang Gui and Chuan Xiong, harmonizes the Blood."]},{"herb":"FangFeng","dosage":"1.5g","actions":["Expels Wind-Dampness, alleviates pain, expels Internal Wind and stops spasms.","With Qin Jiao, for Wind Damp Bi with spasms of the tendons or numbness of the limbs. and pain due to Wind-Dampness in patients with Blood Deficiency.","With Qiang Huo, for Wind-Dampness.","With Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi."]}],"actions":["Activates the functions of the Liver and Kidneys","Strengthens Qi","Nourishes the Blood","Expels Wind and Dampness","Stops numbness and pain"],"syndromes":["Wind-Dampness with Qi and Blood Deficiency"],"manifestations":{"symptoms":["Joint pain","Numbness","Bones and joints sore and painful","Worse with movement","Face is dull yellow","Spasms or contractures of muscles and sinews","Palpitations","Asthenia","Shortness of breath","Spontaneous sweating","Weight loss","Poor appetite","Diarrhea"],"tongue":"Pale","tongueCoat":"None or White","pulse":"Soggy and Weak or Thin and Faint"},"conditions":[{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"Stroke","name":"Cerebral vascular accident"},{"condition":"FacialParalysis","name":"Facial paralysis"},{"condition":"Parylysis","name":"Paralysis"},{"condition":"Numbness","name":"Numbness of the joints"},{"name":"Facial tics and spasms"},{"condition":"Palpitations","name":"Palpitations"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}