{"formula":"BieJiaWan","names":{"pinyin":"bie jia wan","hanzi":"鳖甲丸","english":"turtle shell pills","commonEnglish":"Turtle Shell Pills","aka":[""]},"herbs":[{"herb":"BieJia","dosage":"120g","actions":["Nourishes Yin, anchors Yang, activates the Blood, promotes menstruation, softens hardness and dissipates nodules.","With San Leng, E Zhu and Qing Pi, for hard immobile masses of the epigastrium and abdomen."]},{"herb":"WaLengZi","dosage":"120g","actions":["Activates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules."]},{"herb":"MaiYa","dosage":"60g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi."]},{"herb":"SanLeng","dosage":"60g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain."]},{"herb":"EZhu","dosage":"60g","actions":["Activates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With Qing Pi, for stagnant Qi with chest and abdominal fullness and pain.","With San Leng, for hepatosplenomegaly with distention, pain and immobile, palpable epigastric, sub costal and abdominal masses."]},{"herb":"TuBieChong","dosage":"60g","actions":["Breaks up and drives out Blood Stasis, activates Blood circulation and disperses lumps and masses."]},{"herb":"XiangFu","dosage":"30g","actions":["Spreads and regulates Liver Qi and alleviates pain."]},{"herb":"QingPi","dosage":"30g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations and reduces Food Stagnation.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","with San Leng and E Zhu, for masses where prolonged Qi Stagnation has led to Blood Stagnation."]}],"actions":["Activates the Blood","Regulates Qi","Breaks up Stagnant Qi and Blood","Reduces abdominal masses"],"syndromes":["Abdominal masses due to Qi and Blood Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"AbdominalMasses","name":"Abdominal masses"},{"condition":"DrySkin","name":"Dry skin"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}