{"formula":"BieJiaJianWan","names":{"pinyin":"bie jia jian wan","hanzi":"鳖甲煎丸","english":"turtle shell pills","commonEnglish":"Turtle Shell Pills","aka":[""]},"herbs":[{"herb":"BieJia","dosage":"90g","actions":["Nourishes Yin, anchors Yang, invigorates the Blood, promotes menstruation, softens hardness and dissipates nodules.","With Chai Hu and Tu Bie Chong, for chronic malarial disorders with organomegaly and hypochondriac pain."]},{"herb":"SheGan","dosage":"22.5g","actions":["Clears Heat, relieves Fire toxicity, transforms Phlegm, clears the Lungs and eliminates wheezing."]},{"herb":"HuangQin","dosage":"22.5g","actions":["Clears Heat, dries Dampness and cools the Blood.","With Da Huang, for constipation."]},{"herb":"ZhiFuZi","dosage":"22.5g","actions":["Disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang, and Disperses Cold."]},{"herb":"GanJiang","dosage":"22.5g","actions":["Warms the Middle, warms the channels and expels Cold.","With Zhi Fu Zi, for overabundance of Yin fluids due to Deficiency Cold."]},{"herb":"DaHuang","dosage":"22.5g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis and eliminates Phlegm.","With Zhi Fu Zi, for constipation due to Cold accumulation.","With Dang Gui, for Blood Stasis.","With Gui Zhi, removes Stasis and unblocks the flow of Qi for Blood Stasis.","With Mang Xiao, eliminates obstruction in the Intestines for severe constipation with passage of liquid but no solid stool.","With Ren Shen and E Jiao, for chronic Blood Stasis with Qi and Blood Deficiency."]},{"herb":"GuiZhi","dosage":"22.5g","actions":["Unblocks Yang, transforms Qi and thin mucus, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels, warms the Middle and directs Turbid Yin downward.","With Bai Shao, warms and tonifies the Middle Jiao.","With Mu Dan Pi, for gynecological discomfort due to Blood Stasis and lower abdominal masses."]},{"herb":"ShiWei","dosage":"22.5g","actions":["Clears Damp-Heat and expels Phlegm."]},{"herb":"HouPo","dosage":"22.5g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Gui Zhi and Gan Jiang, for distention and fullness due to congealing of Cold leading to Qi Stagnation.","With Gan Jiang, for acute diarrhea from Cold attacking the Middle."]},{"herb":"QuMai","dosage":"22,5g","actions":["Drains Damp-Heat from the Urinary Bladder, breaks up Blood Stasis, invigorates Blood circulation, regulates menstruation and unblocks the bowels."]},{"herb":"LingXiaoHua","dosage":"22.5g","actions":["Dispels Blood Stagnation, unblocks the channels and vessels and disperses abdominal masses."]},{"herb":"EJiao","dosage":"22.5g","actions":["Tonifies the Blood and nourishes and moistens Yin."]},{"herb":"ChaiHu","dosage":"45g","actions":["Spreads Liver Qi and relieves Stagnation.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Huang Qin, restores normal function of the Liver and Gallbladder.","Wit"]},{"herb":"QiangLang(Chong)","dosage":"45g","actions":["Relieves constipation, attacks toxins and disperses Blood Stagnation."]},{"herb":"BaiShao","dosage":"37g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and relieves pain.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Huang Qin, cools Heat and nourishes the Blood."]},{"herb":"MuDanPi","dosage":"37g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Huang Qin and Chai Hu, for Heat causing pre-menstrual fevers or epistaxis during periods.","With Tao Ren and Gui Zhi, for amenorrhea and abdominal pain due to Blood Stasis."]},{"herb":"TuBieChong","dosage":"37g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation and disperses lumps and masses.","With Da Huang, breaks up fixed abdominal masses from Blood Stasis.","With Da Huang and Tao Ren, for menstrual pain or postpartum abdominal pain due to Blood Stasis."]},{"herb":"LuFengFang","dosage":"30g","actions":["Expels Wind, dries Dampness, treats tumors and stops pain."]},{"herb":"MangXiao","dosage":"90g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat, drains Fire and reduces swelling."]},{"herb":"TaoRen","dosage":"15g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines, unblocks the bowels and drains abscesses.","With Gui Zhi and Da Huang, for Blood Stasis and Heat in the Lower Jiao."]},{"herb":"RenShen","dosage":"7.5g","actions":["Tonifies Spleen and Stomach Qi."]},{"herb":"ZhiBanXia.htm","dosage":"7.5g","actions":["Dries Dampness, transforms Phlegm, dissipates nodules and reduces Stagnation.","With Hou Po, for s Phlegm-Dampness with Qi Stagnation.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"TingLiZi","dosage":"7.5g","actions":["Circulates water, reduces edema and reduces Phlegm."]}],"actions":["Invigorates the Blood","Removes Stasis","Circulates Qi","Resolves Phlegm","Eliminates accumulations","Softens and resolves hard masses"],"syndromes":["Qi, Blood and Phlegm Stagnation"],"manifestations":{"symptoms":["Immobile masses below the hypochondrium or in the abdomen","Abdominal pain","Emaciation","Poor appetite","Alternating chills and fever","Amenorrhea","Hard abdominal masses that produce pain","Aggravated by pressure","Hypochondriac distention"],"tongue":"Purple with echymoses","pulse":"Choppy"},"conditions":[{"condition":"UterineMyoma","name":"Uterine myoma"},{"name":"Malaria with splenomegaly "},{"condition":"ChronicHepatitis","name":"Chronic hepatitis"},{"name":"Hepatomegaly"},{"condition":"Jaundice","name":"Jaundice"},{"condition":"AbdominalMasses","name":"Abdominal masses"},{"condition":"Amenorrhea","name":"Amenorrhea"},{"condition":"CirrhosisOfTheLiver","name":"Cirrhosis of the Liver"},{"name":"Schistosomiasis"},{"name":" Splenomegaly "},{"condition":"LiverCancer","name":"Liver cancer "},{"condition":"AbdominalPain","name":"Abdominal pain "},{"condition":"Anorxia","name":"Poor appetite"}],"contra":{"contraindications":["Use caution for those with Zheng Qi Deficiency."],"interactions":[""]},"notes":["1.5kg of plant ash is steeped in 5kg of millet wine and then the ash is filtered out to get the decoction, in which Bie Jia is decocted into a gum. All the other drugs are ground into fine powder. The gum and the powder are made with honey into pills. 3g of the pills are taken with warm boiled water each time, 3 times daily."],"modifications":[{"purpose":"decreased Food intake and indigestion","modifications":[{"herb":"ShanZha","modification":"+ Fr. Crataegi"},{"herb":"ShenQu","modification":"+ Massa Medicata Fermentata"},{"herb":"JiNeiJin","modification":"+ Endothelium Corneum Gigeriae Galli"}]}]}