{"formula":"BiShuLing","names":{"pinyin":"bi shu ling","hanzi":"鼻舒醽","english":"nose soothing elixir","commonEnglish":"Nose Soothing Elixir","aka":[""]},"herbs":[{"herb":"YuXingCao","dosage":"15g","actions":["Clears Heat, relieves toxicity, reduces swellings and abscesses and expels pus, especially in the Lungs."]},{"herb":"PuGongYing","dosage":"15g","actions":["Clears the Liver, clears Heat and resolves Dampness."]},{"herb":"ChaiHu","dosage":"12g","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion.","With Huang Qin, restores the normal functioning of the Liver and Gallbladder."]},{"herb":"CangErZi","dosage":"12g","actions":["Disperses Wind and Dampness and opens the nasal passages."]},{"herb":"HuoXiang","dosage":"9g","actions":["Aromatically transforms Dampness and releases the Exterior."]},{"herb":"YiYiRen","dosage":"9g","actions":["Strengthens the Spleen, resolves Dampness, expels Wind-Dampness and relieves pain."]},{"herb":"DanShen","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness and calms ascending Liver Yang."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi and dries Dampness."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi, promotes Blood flow, reduces swelling and alleviates Wind-Damp."]}],"actions":["Clears Heat","Tonifies Qi","Eliminates Dampness","Activates the Blood","Calms the Liver","Opens the nasal passages"],"syndromes":["Lung Qi Deficiency with Liver Qi Stagnation Invading the Spleen, Blood Stagnation and Deficiency Heat"],"manifestations":{"symptoms":["Chronic variable and intermittent nasal and sinus congestion or","Continuous or sustained nasal congestion","Chronic discharge of copious thin white or sticky mucus which does not smell (even though the patient may perceive it to)","The discharge is aggravated to exposure to Wind and Cold","It may be worse when lying down or at night and better during the day","Pale, swollen mucous membranes","Variable and transient sense of smell or","Transient, declining sense of smell or loss of sense of smell or","Permanent loss of sense of smell","Dull or thick headache with dizziness","Easily catches cold","Heavy-headedness","Dizziness","Shortness of breath","Weak voice or","Reluctance to speak","Fatigue","Spontaneous sweating","Weak cough with thin white or watery sputum","Waxy, pale complexion","Sinus pain","Generally severe frontal, maxillary or temporal headache","Chronic sinus inflammation and congestion which is worse with stress or emotional upset","May have occasional postnasal discharge","Frontal or temporal headaches","Neck and shoulder tension","Red eyes","Facial flushing","Irritability","Easily angered","Hypochondriac tension or discomfort","Bitter taste in the mouth","Chronic, continuous nasal congestion or","Post nasal drip with sticky yellow or white","Nasal mucous membranes appear swollen, hard and or dark purple","Reduction or loss of sense of smell"],"tongue":"Pale or Red edges with spots or Dark red or Purple with brown or purple spots","tongueCoat":"Thin and white or Thin and yellow","pulse":"Weak and forceless or Wiry and possibly rapid or Wiry and thready or Choppy"},"conditions":[{"condition":"Sinusitis","name":"Chronic sinusitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}