{"formula":"BoYunTuiYiWan","names":{"pinyin":"bo yun tui yi wan","hanzi":"拨云退翳丸","english":"bolus for removing nebula","commonEnglish":"Bolus for Removing Nebula","aka":[""]},"herbs":[{"herb":"MiMengHua","dosage":"80g","actions":["Clears the Liver, brightens eyes and reduces superficial visual obstruction.","With Ju Hua and Mu Zei, for eye disorders caused by Wind-Heat."]},{"herb":"BaiJiLi","dosage":"60g","actions":["Calms the Liver, anchors Yang, dredges Liver Qi, disperses Stagnation and clumping,dispels Wind-Heat and brightens the eyes.","With Mu Zei, Ju Hua and Chan Tui, for corneal opacities."]},{"herb":"JuHua","dosage":"20g","actions":["Disperses Wind, clears Heat, calms the Liver, clears the eyes and detoxifies.","With Bo He, for Liver Qi Stagnation turning to Liver Fire Flaring upward with blurred vision, dizziness, headache and red, swollen eyes.","With Chuan Xiong, for headache due to Wind-Heat or Liver Yang Rising.","With Chan Tui, for superficial visual obstruction red, watery, swollen and painful eyes due to Liver Heat from either Wind-Heat or Liver Yang Rising.","With Mi Meng Hua, Chan Tui and Mu Zei, for superficial visual obstruction."]},{"herb":"MuZei","dosage":"80g","actions":["Disperses Wind-Heat, clears the eyes and eliminates superficial visual obstruction.","With Ju Hua, for swelling, pain and redness of the eyes and pterygium.","With Bai Ji Li, for pterygium, and excessive tearing."]},{"herb":"SheTui(Pi)","dosage":"12g","actions":["Removes superficial visual obstruction.","With Chan Tui and Bai Ji Li, for superficial visual obstruction."]},{"herb":"ChanTui","dosage":"20g","actions":["Disperses Wind, clears Heat, clears the eyes and removes superficial visual obstruction.","With Mu Zei and Ju Hua, for Wind-Heat in the Liver Channel with red, watery eyes and blurred vision."]},{"herb":"JingJie","dosage":"40g","actions":["Releases the exterior and expels Wind.","With Bo He, disperses Wind in the head."]},{"herb":"ManJingZi","dosage":"80g","actions":["Disperses Wind, clears Heat, dispels Wind-Heat in the Liver channel and clears and benefits the head and eyes.","With Bai Ji Li, for Liver Fire Rising with red, sore eyes.","With Bai Ji Li, Chan Tui and Ju Hua, for eye disorders due to Wind-Heat Attacking the Liver channel.","With Bo He, Jing Jie and Ju Hua, for headache, facial swelling and pain due to Wind-Heat."]},{"herb":"BoHe","dosage":"20g","actions":["Disperses Wind-Heat, cools and clears the head and eyes and relieves Stagnation of Liver Qi.","With Ju Hua, for redness, and swelling of the eyes due to Liver Fire.","With Chan Tui, powerfully expels Wind-Heat."]},{"herb":"DangGui","dosage":"60g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"60g","actions":["Invigorates the Blood, promotes the movement of Qi expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain."]},{"herb":"HuangLian","dosage":"20g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity."]},{"herb":"DiGuPi","dosage":"40g","actions":["Cools the Blood and drains Yin Deficiency Fire."]},{"herb":"ChuanJiao","dosage":"28g","actions":["Warms the Middle Jiao, disperses Cold and dispels Dampness, for moist dermal ulcers."]},{"herb":"ChuShiZi","dosage":"20g","actions":["Tonifies the Liver and Kidney Yin, clears the Liver and clears the eyes."]},{"herb":"TianHuaFen","dosage":"24g","actions":["Relieves toxicity, expels pus and reduces swelling."]},{"herb":"GanCao","dosage":"12g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Expels Wind","Clears Heat","Removes nebula","Improves eyesight"],"syndromes":["Nebula due to Wind-Heat","Nebula due to Liver Fire"],"manifestations":{"symptoms":["The scar left after an inflammation is smooth on the surface with a clear boundary","Different thickness","The thickness of the nebula is like congealed fat","Redness of the eyes","Lacrimation","Headache","Photophobia","Constipation","Dark urine"],"tongue":"Normal","tongueCoat":"Yellow","pulse":"Slippery and rapid"},"conditions":[{"condition":"Nebula","name":"Nebula"},{"name":"Blurred vision "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}