{"formula":"BreastCancer!","names":{"pinyin":"breast cancer #1","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"10g","actions":["Spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Bai shao, for Liver Blood Deficiency with Liver Qi Stagnation and vertigo, dizziness, thoracic and costal pain, and menstrual irregularity due to Liver Qi Stagnation."]},{"herb":"QinPi","dosage":"10g","actions":["Clears Heat, resolves toxicity, dries Dampness, Drains Liver Fire and resolves Phlegm."]},{"herb":"YuJin","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores, Clears Heat, cools the Blood and alleviates pain.","With Chai Hu, for Liver Qi and Blood Stagnation with flank pain and distention, dysmenorrhea, and irregular menstruation."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis, regulates the menses, reduces swelling, expels pus and generates flesh.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"10g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver, calms Liver Yang and Liver Wind and alleviates pain.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"BaiZhi","dosage":"10g","actions":["Reduces swelling, eliminates toxins, expels dampness and expels pus."]},{"herb":"BaiZhu","dosage":"10g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"GuaLou","dosage":"30g","actions":["Regulates Qi (unbinds the chest), transforms Hot Phlegm, reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"ShanCiGu","dosage":"30g","actions":["Clears Heat, resolves toxicity, reduces abscesses, reduces swelling and dissipates nodules."]}],"actions":["Benefits the Liver","Regulates Qi","Dispels Phlegm","Eliminates the tumor"],"syndromes":["Liver Qi Stagnation"],"manifestations":{"symptoms":["Anxiety","Easily angered","Breast full and painful","Dry mouth","Dry pharynx","Dizziness"],"tongue":"Dark","tongueCoat":"Whit or Light yellow","pulse":"Wiry"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}