{"formula":"BuGanYiShenTang","names":{"pinyin":"bu gan yi shen tang","hanzi":"tonifying the liver and benefitting the kidneys decoction","commonEnglish":"Tonifying the Liver and Benefiting the Kidneys Decoction","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"6g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"ShanYao","dosage":"6g","actions":["Tonifies the Spleen, tonifies Kidney Yin and astringes Jing."]},{"herb":"ShanZhuYu","dosage":"4.5g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin, &#xA0;&#xA0;&#xA0; strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Wu Wei Zi, for spermatorrhea, abnormal sweating, palpitations and shortness of breath due to Yin and Yang Deficiency of the Liver and Kidneys."]},{"herb":"ZeXie","dosage":"6g","actions":["Promotes urination, leaches out Dampness, and settles Ministerial Fire in the Kidneys by draining Damp-Heat from the lower Jiao."]},{"herb":"MuDanPi","dosage":"6g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for Kidney Yin Deficiency with steaming bones.","With Ze Xie, Shan Zhu Yu and Fu Ling, for spermatorrhea due to Kidney Yin Deficiency with Heat."]},{"herb":"FuLing","dosage":"6g","actions":["Promotes urination, leaches out Dampness, transforms Phlegm, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness."]},{"herb":"HuangBai","dosage":"6g","actions":["Drains Damp-Heat especially from the Lower Jiao."]},{"herb":"BaiShao","dosage":"3g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, calms Liver Yang and Liver Wind, softens the Liver and relieves pain."]},{"herb":"WuWeiZi","dosage":"3g","actions":["Tonifies the Kidneys, astringes Jing and stops diarrhea and spermatorrhea."]},{"herb":"ShenQu","dosage":"6g","actions":["Reduces Food Stagnation, promotes digestion, harmonizes the Stomach and moves Qi."]}],"actions":["Nourishes Liver and Kidney Yin","Clears Damp-Heat from the Lower Jiao"],"syndromes":["Liver and Kidney Yin Deficiency"],"manifestations":{"symptoms":["White vaginal discharge","Dilute discharge which does not have an odor","Dizziness","Tinnitus","Five sole Heat","A sensation or general feeling of Heat in the evening"],"tongue":"Red","tongueCoat":"Little or None","pulse":"Thready and rapid"},"conditions":[{"condition":"VaginalDischarge","name":"Vaginal discharge "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula is generally prepared as a decoction.","Although this formula can effectively treat leukorrhea when the appropriate symptoms are present it is not limited to women's disorders."],"modifications":[]}