{"formula":"BuGuZhiWan","names":{"pinyin":"bu gu zhi wan","hanzi":"补骨脂囊","english":"psoralia pill","commonEnglish":"Psoralia Pill","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"18g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency."]},{"herb":"DuZhong","dosage":"12g","actions":["Tonifies the Kidneys and Liver, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"TuSiZi","dosage":"12g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver and improves vision.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency.","With Bu Gu Zhi and Du Zhong, for spermatorrhea, premature ejaculation, and low back pain from Kidney Deficiency."]},{"herb":"BuGuZhi","dosage":"9g","actions":["Tonifies the Kidneys, strengthens Yang and stabilizes Jing."]},{"herb":"HuLuBa","dosage":"9g","actions":["Warms the Kidneys, disperses Dampness and alleviates pain."]},{"herb":"BaiZhi","dosage":"9g","actions":["Expels Wind, eliminates Dampness, unblocks the nasal passages and dispels Cold."]},{"herb":"BaiJiLi","dosage":"9g","actions":["Calms the Liver, anchors Yang, dredges Liver Qi, disperses Stagnation and Extinguishes Liver Wind."]},{"herb":"CiShi","dosage":"9g","actions":["Anchors Liver Yang, calms the Spirit, benefits Yin, nourishes the Kidneys, augments the Liver and improves hearing and vision."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, activates and harmonizes the Blood and disperses Cold"]},{"herb":"ChuanXiong","dosage":"6g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and activates the Blood and disperses Blood Stasis."]},{"herb":"ShiChangPu","dosage":"6g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, awakens the Spleen and promotes the movement of Qi.","With Ci Shi, for tinnitus or diarrhea due to Kidney Deficiency."]},{"herb":"ChuanJiao","dosage":"5g","actions":["Warms the Middle Jiao and disperses Cold."]},{"herb":"RouGui","dosage":"4g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire."]}],"actions":["Tonifies and strengthens the Kidneys","Benefits Yang"],"syndromes":["Kidney Yang Deficiency","Kidney Qi Deficiency"],"manifestations":{"symptoms":["Gradual and progressive onset of tinnitus or hearing loss","The tinnitus is general mild and constant and worse at night or when fatigued or after exertion and ejaculation","The sound of the tinnitus is variable, sometimes high-pitched and sometimes like holding a shell over the ear","Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Cold limbs","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Lassitude","Withdrawn, subdued behavior","Knees feel cold and aching","Dizziness","Tinnitus","Impotence","Spermatorrhea","Premature ejaculation","Low libido","Female infertility (\"uterus cold and infertile\")","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white","pulse":"Deep and thready - maybe slow"},"conditions":[{"condition":"Tinnitus","name":"Tinnitus"},{"condition":"Hypertension","name":"Hypertension"},{"condition":"LowBackPain","name":"Low back pain"},{"condition":"Spermatorrhea","name":"Spermatorrhea"},{"condition":"Deafness","name":"Deafness"},{"name":"Chronic labrynthitis"},{"condition":"Edema","name":"Edema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}