{"formula":"BuPiWeiXieYinHuoShengYangTangJiaJian","names":{"pinyin":"bu pi wei xie yin huo sheng yang tang jia jian","hanzi":"补脾胃泻阴火升阳汤加減","english":"modified tonify the spleen and stomach, drain yin fire and raise the yang decoction","commonEnglish":"Modified Tonify the Spleen and Stomach, Drain Yin Fire and Raise the Yang Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"12g","actions":["Tonifies Qi and Blood, strengthens the Spleen and raises the Yang Qi of the Spleen and Stomach.","With Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Sheng Ma, raises the Yang Qi of the Spleen, allowing turbid Yin to descend and be eliminated.","With Sheng Ma and Chai Hu, for Spleen Qi Sinking with rectal and/or uterine prolapse or excessive uterine bleeding."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao and augments Qi."]},{"herb":"CangZhu","dosage":"10g","actions":["Strongly dries Dampness and tonifies the Spleen."]},{"herb":"QiangHuo","dosage":"3g","actions":["Expels Wind-Cold-Dampness and guides Qi to the Tai Yang and Du channels.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"ShengMa","dosage":"3g","actions":["Raises Yang and lifts sunken Qi.","With Chai Hu, for prolapse due to Yang Deficiency.","With Chai Hu, Huang Lian and Huang Qin, for erysipelas of the head and face and swelling and pain due to Fire toxin.","With Chai Hu and Huang Qi, for prolapse of internal organs."]},{"herb":"ChaiHu","dosage":"3g","actions":["Raises Yang Qi, specifically the Clear Qi of the Stomach and Gallbladder.","With Huang Qin, restores normal function of the Liver and Gallbladder.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi and Sheng Ma, for Central Qi Sinking."]},{"herb":"HuangLian","dosage":"6g","actions":["Cools Blood Heat and resolves Fire toxicity."]},{"herb":"HuangQin","dosage":"6g","actions":["Clears Lower Jiao Heat, cools the Blood and stops bleeding.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]},{"herb":"MuDanPi","dosage":"6g","actions":["Clears Deficiency Fire, clears Heat, cools, invigorates and harmonizes the Blood and dispels Blood Stasis.","With Chi Shao, for purpuric rash, hematemesis, and Heat injuring the Ying and Xue levels.","With Huang Qin and Chai Hu, for Heat causing pre-menstrual fevers or epistaxis during periods."]},{"herb":"HongHua","dosage":"4.5g","actions":["Activates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain."]},{"herb":"ChiShao","dosage":"4.5","actions":["Activates the Blood, dispels Blood Stasis,clears Heat, cools the Blood and relieves pain."]},{"herb":"HanShuiShi","dosage":"15g","actions":["Clears Heat and drains Fire from the Yang Ming/Qi Level."]}],"actions":["Tonifies Qi","Stabilizes Yuan Qi","Activates the Blood","Reduces spots"],"syndromes":["Qi Deficiency with Blood Stagnation"],"manifestations":{"symptoms":["Widespread purple lesions","The lesions are often atrophied","Joint pain","Occasional low-grade fever"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Thready and choppy"},"conditions":[{"condition":"LupusErythematosis","name":"Lupus erythematosis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}