{"formula":"BuPiWeiXieYinHuoShengYangTang","names":{"pinyin":"bu pi wei xie yin huo sheng yang tang","hanzi":"补脾胃泻阴火升阳汤","english":"tonify the spleen and stomach, drain yin fire and raise the yang decoction","commonEnglish":"Tonify the Spleen and Stomach, Drain Yin Fire and Raise the Yang Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"9g","actions":["Tonifies Qi and Blood, strengthens the Spleen and raises the Yang Qi of the Spleen and Stomach.","With Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Sheng Ma, raises the Yang Qi of the Spleen, allowing turbid Yin to descend and be eliminated.","With Sheng Ma and Chai Hu, for Spleen Qi Sinking with rectal and/or uterine prolapse or excessive uterine bleeding."]},{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao and augments Qi."]},{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness and tonifies the Spleen."]},{"herb":"QiangHuo","dosage":"9g","actions":["Expels Wind-Cold-Dampness and guides Qi to the Tai Yang and Du channels.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"ShengMa","dosage":"9g","actions":["Raises Yang and lifts sunken Qi.","With Chai Hu, for prolapse due to Yang Deficiency.","With Chai Hu, Huang Lian and Huang Qin, for erysipelas of the head and face and swelling and pain due to Fire toxin.","With Chai Hu and Huang Qi, for prolapse of internal organs."]},{"herb":"ChaiHu","dosage":"9g","actions":["Raises Yang Qi, specifically the Clear Qi of the Stomach and Gallbladder.","With Huang Qin, restores normal function of the Liver and Gallbladder.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi and Sheng Ma, for Central Qi Sinking."]},{"herb":"HuangLian","dosage":"3g","actions":["Cools Blood Heat and resolves Fire toxicity."]},{"herb":"HuangQin","dosage":"6g","actions":["Clears Lower Jiao Heat, cools the Blood and stops bleeding.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]},{"herb":"CangErZi","dosage":"9g","actions":["Disperses Wind and Dampness and opens the nasal passages."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Tonifies Qi","Stabilizes Yuan Qi","Invigorates the Blood","Reduces spots"],"syndromes":["Qi Deficiency with Liver Qi Stagnation an Deficiency Heat"],"manifestations":{"symptoms":["Chronic variable and intermittent nasal and sinus congestion or","Chronic discharge of copious thin white or sticky mucus which does not smell (even though the patient may perceive it to)","It may be worse when lying down or at night and better during the day","Pale, swollen mucous membranes","Variable and transient sense of smell or","Permanent loss of sense of smell","Dull or thick headache with dizziness","Afternoon tidal fever","Five Sole Heat","Night sweats","Easily catches cold","Heavy-headedness","Dizziness","Shortness of breath","Weak voice or","Reluctance to speak","Fatigue","Spontaneous sweating","Waxy, pale complexion","Weak cough with thin white or watery sputum"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Weak and forceless"},"conditions":[{"condition":"Sinusitis","name":"Chronic sinusitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"sinusitis with Blood Stagnation","modifications":[{"herb":"MuDanPi","modification":"+ 9g Cx. Moutan"},{"herb":"ChiShao","modification":"+ 9g Rx. Paeoniae Rubra"}]}]}