{"formula":"BuQiZengLiTang","names":{"pinyin":"bu qi zeng li tang","hanzi":"补益增力汤","english":"supplement qi and increase the force decoction","commonEnglish":"Supplement Qi and Increase the Force Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"60g","actions":["Strongly tonifies Qi, strengthens the Spleen and raises Spleen Yang.","With Dang Shen, for Qi Deficiency with general debility, anorexia and spontaneous perspiration.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Dang Gui, for Qi and Blood Deficiency with numbness, painful obstruction and paresthesia.","With Gui Zhi, for Qi and Blood Deficiency and Ying and Wei Deficiency with numbness and painful obstruction of the musculature."]},{"herb":"JiXueTeng","dosage":"24g","actions":["Activates and tonifies the Blood, activates the channels and relaxes the sinews."]},{"herb":"DangGui","dosage":"18g","actions":["Tonifies the Qi of the Blood and activates and harmonizes the Blood.","With Bai Shao, regulates and harmonizes Qi and Blood.","with Chuan Xiong, harmonizes, nourishes and activates the Blood and disperses Blood Stasis."]},{"herb":"GeGen","dosage":"18g","actions":["Discharges Exterior conditions and releases the muscles, especially of the neck and upper back.","With Gu Zhi and Bai Shao, for Wind-Cold with stiffness and tension in the upper back and neck."]},{"herb":"ShanYao","dosage":"15g","actions":["Tonifies Spleen and Lung Qi , nourishes Lung and Stomach Yin, tonifies Kidney Yin and astringes Jing.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools.","with Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema."]},{"herb":"BaiZhu","dosage":"15g","actions":["Strengthens the Spleen and dries Dampness."]},{"herb":"FuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Gui Zhi, warms and transforms fluids, un-blocks Yang and promotes urination.","With Gui Zhi and Bai Zhu, for Dampness Obstruction causing Lin Syndrome, edema, heaviness of the body, and irritability."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, tonifies the Spleen, assists raising Qi, dries Dampness, transforms Phlegm, aids digestion of tonics and prevents bloating which may accompany Qi tonics.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and activates the Blood and disperses Blood Stasis.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"ChiShao","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, clears Liver Fire, clears Heat, cools the Blood and relieves pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChaiHu","dosage":"9g","actions":["Raises Yang Qi and relieves Stagnation."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, releases the muscle layer, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]}],"actions":["Tonifies Qi","Nourishes the Blood","Activates the Blood","Circulates Qi"],"syndromes":["Qi and Blood Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Drooping eyelids","Double vision","Sallow complexion or","A bright, white, lusterless complexion or","A pale face","Fatigue","Lassitude","Anorexia","Four limbs feel tired and heavy","Abdominal and epigastric distention after eating","Maybe acid regurgitation or vomiting","Loose stools","Shortness of breath","Disinclination to speak","A weak voice","Symptoms better in the morning and worse in the evening","Dizziness","A weak voice","Reluctance to speak","Sweating with little or no exertion","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Scanty periods","Pain that is fixed, stabbing and/or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","A dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Pale and flabby - may have teethmarks or Pale, thin and dry or Purple with possible purple or red spots","tongueCoat":"White","pulse":"Even or Soft and thready or Weak or Thin and choppy or Choppy or Wiry and choppy"},"conditions":[{"condition":"MyastheniaGravis","name":"Myasthenia gravis"},{"condition":"DrySkin","name":"Dry skin"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}