{"formula":"BuTianDaZaoWan","names":{"pinyin":"bu tian da zao wan","hanzi":"补天大造囊","english":"tonify heaven great creation pill","commonEnglish":"Tonify Heaven Great Creation Pill","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"100g","actions":["Nourishes the Blood, strongly enriches Yin and arrests coughing and wheezing.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","with Gui Ban, for dizziness, insomnia, tinnitus, forgetfulness, afternoon fevers and night sweats due Yin Deficiency with Yang Rising.","With Ren Shen, Bai Zhu, Dang Gui, Bai Shao and Fu Ling, for anemia with fatigue and weakness."]},{"herb":"HuangQi","dosage":"50g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior and tonifies the Lungs.","With Ren Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweating.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"BaiZhu","dosage":"40g","actions":["Tonifies the Spleen,augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling, Ren Shen and Huang Qi, for severe Qi Deficiency.","With Shu Di Huang, Bai Shao and Dang Gui, for Blood Deficiency."]},{"herb":"SuanZaoRen","dosage":"40g","actions":["Nourishes Heart Yin, tonifies Liver Blood, calms the Spirit, astringes sweat and generates fluids."]},{"herb":"BaiShao","dosage":"40g","actions":["Nourishes the Blood, astringes Yin and adjusts the Ying and Wei.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis.","With Dang Gui, nourishes Yin and Blood.","With Huang Qi and Ren Shen, restrains sweating from Deficiency.","With Huang Qi, Ren Shen and Bai Zhu, for Qi Deficiency signs such as fatigue, weakness, and pale and scanty menstrual Blood.",""]},{"herb":"ShanYao","dosage":"40g","actions":["Tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools.","With Ren Shen and Bai Zhu, for decreased appetite and lack of energy due to Spleen Deficiency."]},{"herb":"FuLing","dosage":"40g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","with Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"GuiBan","dosage":"40g","actions":["Nourishes Yin, anchors Yang, nourishes the Blood and enriches Yin.","With Lu Jiao Jiao, for weakness and debility due to Kidney Deficiency.","With Lu Jiao Jiao, Ren Shen and Gou Qi Zi, for Kidney Yin and Yang Deficiency with weak bones, spermatorrhea or nocturnal emissions, weight loss and blurred vision."]},{"herb":"LuRong","dosage":"30g","actions":["Tonifies the Kidneys, strengthens Yang and nourishes and tonifies Qi and Blood.","With Gui Ban, nourishes and tonifies Qi and Blood.","with Dang Gui and Huang Qi, for aplastic anemia associated with severely deficient Jing and Blood.","with Ren Shen, for Yang Deficiency with weakness of Fire at the Ming Men."]},{"herb":"DangGui","dosage":"30g","actions":["Tonifies, activates and harmonizes the Blood, disperses Cold, stops coughing and treats dyspnea.","With Huang Qi, for Qi and Blood Deficiency.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"RenShen","dosage":"30g","actions":["Powerfully tonifies Yuan Qi, tonifies Lung Qi, generates Body Fluids and stops thirst.","With Shu Di Huang, for Qi and Yin Deficiency.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Huang Qi, for Lung Qi Deficiency.",""]},{"herb":"GouQiZi","dosage":"30g","actions":["Nourishes Yin, moistens the Lungs and nourishes and tonifies Liver and Kidney Blood and Yin.","With Shu Di Huang, for Liver and Kidney Deficiency."]},{"herb":"YuanZhi","dosage":"30g","actions":["Expels Phlegm, opens the Orifices, clears the Lungs and stops coughing.","With Suan Zao Ren, Bai Zhu and Dang Gui, for palpitations and insomnia due to Qi Deficiency."]},{"herb":"ZiHeChe","dosage":"6g","actions":["Tonifies Lung Qi and augments Kidney Jing.","With Shu Di Huang, for chronic weakness and debility.","With Shu Di Huang, Huang Qi and Ren Shen, for Qi Deficiency.","With Shu Di Huang, Dang Gui and Bai Shao, for Blood Deficiency.","With Shu Di Huang, Bai Zhu and Shan Yao, for a decreased appetite due to Spleen Deficiency.","With Shu Di Huang, Ren Shen, Dang Gui and Huang Qi, for Qi and Blood Deficiency."]}],"actions":["Nourishes Yin","Tonifies Yang","Supports Yuan Qi","Consolidates the root"],"syndromes":["Yin and Yang Deficiency"],"manifestations":{"symptoms":["Coughing and wheezing which is worse on exertion","Expectoration of frothy or dark-streaked mucus","A mild tidal fever","A cold body","Aversion to Cold","Spontaneous sweating","Night sweats","Superficial and facial edema","Mouth and tongue ulcers","Emaciation","Anxiety","Nervousness","Dark lips","Anorexia","Loose stools or","\"Cockcrow diarrhea\"","Amenorrhea","Impotence"],"tongue":"Red, dry and peeled or Pale, purplish and swollen with teethmarks","tongueCoat":"White or none","pulse":"Minute, thready and rapid or Deficient and large"},"conditions":[{"condition":"PulmonaryTuberculosis","name":"Pulmonary tuberculosis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a fine powder and form into 9g pills with honey. Take 3-5 pills daily.","If decocted, take Zi He Che in pill form."],"modifications":[{"purpose":"tuberculosis due to Yin Deficiency with Heat and mild night sweats","modifications":[{"herb":"MuLiSan","modification":"+ one or two of the following"}]},{"purpose":"tuberculosis due to Yin Deficiency with Heat and severe spontaneous sweating","modifications":[]},{"purpose":"targeting the tuberculosis pathogen","modifications":[]},{"purpose":"For tuberculosis due to Yin Deficiency with bone steaming fever","modifications":[]},{"purpose":"tuberculosis with recurrent hemoptysis","modifications":[]},{"purpose":"tuberculosis with hemoptysis","modifications":[]},{"purpose":"tuberculosis with mild coughing","modifications":[]},{"purpose":"tuberculosis with distressing chest pain","modifications":[{"herb":"SiGuaLou","modification":"+ 12g Fr. Luffae"},{"herb":"YuJin","modification":"+ 9g Rx. Curcumae"}]},{"purpose":"tuberculosis with mild nocturnal emission","modifications":[{"herb":"WuZhuYu","modification":"+ 15g Fr. Evodiae"}]},{"purpose":"tuberculosis with severe nocturnal emission","modifications":[{"herb":"RouDouKou","modification":"+ 40g Sm. Myristicae"},{"herb":"BuGuZhi","modification":"+ 40g Fr. Psoraliae"}]}]}