{"formula":"BuYaoTang","names":{"pinyin":"bu yao tang","hanzi":"补腰汤","english":"tonify the lower back decoction","commonEnglish":"Tonify the Lower Back Decoction","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain.",""]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"GouJi","dosage":"4.5-15g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, expels Wind-Dampness, relieves Bi syndrome, warms and stabilizes the Kidneys and prevents leakage.","With Dang Gui, for a long term disease leading to lower extremity swelling.","With Du Zhong, Shu Di Huang and Xu Duan, for back pain."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, tonifies Kidney Yang and aids the smooth flow of Qi and Blood.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees and weakness of the legs which makes walking difficult."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, Tonifies Wei Qi, stabilizes the Exterior and relieves numbness and pain."]},{"herb":"LuRong","dosage":"3-5g","actions":["Tonifies the Kidneys, strengthens Yang, tonifies the Du Channel, strengthens Jing and Blood, strengthens the sinews and bones and benefits marrow."]}],"actions":["Reinforces the Kidneys","Benefits Jing"],"syndromes":["Jing Insufficiency"],"manifestations":{"symptoms":["Insidious onset of low back and knees weak and aching","Pain worsens with fatigue and is better with bed rest","A rotating sensation in the brain","Dizziness","Tinnitus","Insomnia","In adults: Hair loss Graying or whitening of hair Weak sexual function Atrophy and weakness of feet with difficulty walking Poor memory Senility (premature or mature) Brittle bones Gradual deterioration of hearing","In children Retardation in mental and/or physical development Failure to thrive Late or incomplete closing of fontanel","Poor bone development, brittle bones"],"tongue":"With Kidney Yin Deficiency predominant: Irritability Insomnia Dry mouth and throat Malar flush Five Sole Heat Constipation  Red C: Little or None P: Thready and rapid"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}