{"formula":"BuZhongXiongGuiTang","names":{"pinyin":"bu zhong xiong gui tang","hanzi":"补中芎归汤","english":"tonify the middle decoction with angelica and chuanxiong","commonEnglish":"Tonify the Middle Decoction with Angelica and Chuanxiong","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"0.6-12g","actions":["Tonifies the Qi of the Blood and invigorates and harmonizes the Blood."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, warms the channels and stops bleeding."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"HuangQi","dosage":"1.5-30g","actions":["Strongly tonifies Qi, strengthens the Spleen and raises Spleen Yang.","With Ren Shen, for Qi Deficiency with general debility, anorexia and spontaneous perspiration.","With Huang Qi, for Blood Deficiency due to hemorrhage with fatigue, low grade fever, irritability and thirst in patients with a weak pulse due to Qi and Blood Deficiency."]},{"herb":"RenShen","dosage":"1-20g","actions":["Strongly tonifies Qi, reinforces Yang and harmonizes the Middle Jiao.","With Shu Di Huang, for severe Qi and Blood Deficiency due to loss of Blood."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and aids the smooth flow of Qi and Blood."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi and alleviates pain."]},{"herb":"GanCao","dosage":"1-15g","actions":["Tonifies the Spleen, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels ."]}],"actions":["Returns Yang","Scatters Cold","Consolidates the Chong and Ren"],"syndromes":["Insufficiency of the Chong and Ren"],"manifestations":{"symptoms":["Menorrhagia or","Prolonged menstruation","Lower abdominal Cold, distention and pain","Sporadic abdominal pain which is better with warmth pressure","Irregular menstruation (usually long and heavy or scant with clots)","Delayed menstruation with a small amount of pale Blood","Mild, persistent uterine bleeding","Lumbar and sacral pain which are worse following menstruation or when tired","Profuse, clear, watery leukorrhea","Maybe infertility","Maybe dark rings around the eyes","Palpitations","Shortness of breath","Faint, weak respiration","Drenched with perspiration","Dizziness","Vertigo","Above symptoms worse on exertion or when tired","Four limbs cold and sore","Intolerance of Cold","Cold abdominal pain","An extremely pale face","Cyanosis of mouth and lips","Reduced appetite","Loss of taste","Fatigue","Upset stomach","Loose stools"],"tongue":"Pale and thick with teeth marks","tongueCoat":"White and greasy","pulse":"Minute (on the point of collapse) or Deep and slow"},"conditions":[{"condition":"Menorrhagia","name":"Menorrhagia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}