{"formula":"CangZhuBaiZhiTang","names":{"pinyin":"cang zhu bai zhi tang","hanzi":"苍术白芷汤","english":"atractylodes and angelica dahurica decoction","commonEnglish":"Atractylodes and Angelica Dahurica Decoction","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"3-10g","actions":["Induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"ShengMa","dosage":"3-9g","actions":["Releases the Exterior Raises Yang and lifts sunken Qi.","With Gen Gen, for relatively superficial Yang Ming disorders."]},{"herb":"BaiZhi","dosage":"3-10g","actions":["Expels Wind, eliminates Dampness, dispels Cold and alleviates pain.","With Ge Gen, for Wind-Cold trapped at the level of the muscles and interstices.",""]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao and warms the channels.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Cang Zhu, for pain due to Wind-Damp Bi with aching joints, heavy limbs and generalized aching and discomfort."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"DuHuo","dosage":"3-10g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain, especially in the low back and legs.","With Fang Feng, for numbness in the legs."]},{"herb":"GeGen","dosage":"4-21g","actions":["Discharges Exterior conditions, releases the muscles, especially of the neck and upper back, raises Yang and lifts sunken Qi."]}],"actions":["Dispels Wind","Warms Cold","Eliminates Dampness","Warms the Yang Ming"],"syndromes":["Cold Dampness in the Lower Jiao","Yang Ming Cold-Damp"],"manifestations":{"symptoms":["Chronic cold pain in the lower back and body with a heavy sensation","A preference for warmth","Pain worse in Damp weather","Pain radiating downward and to the lower limbs","Limited movement of the lower spine","Severe hardness and stiffness in the lumbar area with obvious tenderness","A cord-like, swollen sensation of the supraspinous ligament on palpation","A movable cord-like sensation at the origin of the sacro-spinal muscle","Pain and other symptoms worsen gradually","A long-lasting course of illness","A heavy sensation in the head","The lower back region feels Cold to the touch","The pain is a deep, unremitting ache","The pain may be occasionally be severe","Twisting and bending are difficult","The pain is aggravated by cold weather","Lying down provides no improvement","Stiffness which is worse on rainy days","Aversion to Cold","Cold extremities","Sciatica","Copious urination","Extreme heavy sensation in the lower back","Absence of thirst","Maybe headaches","Nausea","Loose stools","A poor appetite","Maybe general body aches","Spontaneous contracture of the limbs","Maybe a feverish sensation in the upper body","Craves hot drinks and compresses","Dizziness","Vomiting","Profuse, purulent leukorrhea with a foul odor"],"tongue":"Pale","tongueCoat":"White or Greasy and white at the root","pulse":"Deep, thready and moderate or Deep and slow or Moderate or Slippery and slow"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}