{"formula":"CangBaiNiuXiFang","names":{"pinyin":"cang bai niu xi fang","hanzi":"苍柏牛膝方","english":"atractylodis, phellodendron and achyranthis formula (topical)","commonEnglish":"Atractylodis, Phellodendron and Achyranthis Formula","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"10g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Damp-Heat in the Lower Jiao.","With Huang Bai, for skin lesions due to Wind-Dampness."]},{"herb":"HuangBai","dosage":"10g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Cang Zhu, eliminates Dampness and clears Heat for Damp-Heat sores."]},{"herb":"NiuXi","dosage":"10g","actions":["Invigorates the Blood, expels Blood Stasis and clears Damp-Heat in the Lower Jiao."]},{"herb":"YinChen(Hao)","dosage":"10g","actions":["Clears Heat and facilitates the resolution of Dampness.","With Di Fu Zi, Ku Shen and Bai Xian Pi, externally or internally for Damp-Heat rashes and sores."]},{"herb":"ZhiMu","dosage":"10g","actions":["Clears Heat, nourishes Yin, moistens Dryness, drains Fire and ameliorates the Dryness of Dampness resolving herbs."]},{"herb":"BaiXianPi","dosage":"10g","actions":["Clears Damp-Heat, resolves Fire-toxicity, expels Wind and stops itching.","With Ku Shen, for Damp-Heat sores that itch.","With Cang Zhu, Ku Shen and Di Fu Zi, for dermatological disorders characterized by Damp-Heat and toxins."]},{"herb":"MingFan","dosage":"10g","actions":["Purges Fire, relieves toxicity, dries Dampness, alleviates itching, restrains and inhibits sores, generates flesh and transforms putrefication."]},{"herb":"KuShen","dosage":"30g","actions":["Clears Heat, Dampness, disperses Wind and stops itching."]},{"herb":"TuFuLing","dosage":"20g","actions":["Relieves toxicity, eliminates Dampness and clears Damp-Heat from the skin.","With Bai Xian Pi, for skin lesions associated with Damp-Heat.","With Di Fu Zi, Ku Shen and Cang Zhu, for eczema, carbuncles, Damp sores or psoriasis."]},{"herb":"DiFuZi","dosage":"20g","actions":["Clears Damp-Heat, promotes urination and stops itching.","With Ku Shen, for skin irritation and itchiness due to Damp-Heat."]},{"herb":"JinYinHua","dosage":"20g","actions":["Clears Heat, resolves Fire toxicity and clears Damp-Heat from the Lower Jiao."]}],"actions":["Drains Damp Heat","Resolves Fire toxicity","Clears Damp-Heat from the skin"],"syndromes":["Damp-Heat diaper dermatitis"],"manifestations":{"symptoms":["The skin becomes reddened","Eventually it becomes dry and scaly","Chronic or severe: Papules Blisters Erosions"]},"conditions":[{"condition":"DiaperDermatitis","name":"Diaper rash"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}