{"formula":"CangZhuSan","names":{"pinyin":"cang zhu san","hanzi":"苍术散","english":"atractylodis pill","commonEnglish":"Atractylodis Pill","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Bai Zhu, for musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation."]},{"herb":"MuXiang","dosage":"3-10g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen."]},{"herb":"RuXiang","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels and alleviates pain."]},{"herb":"MoYao","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling.","With Ru Xiang, for Wind-Cold-Damp Bi with numbness throughout the body and unresponsive extremities."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones, benefits the joints and clears Damp-Heat in the Lower Jiao."]},{"herb":"ZhiChuanWu","dosage":"1.5-9g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain.","With Quan Xie, warms the channels and collaterals, disperses Cold, expels Wind and Dampness, unblocks the collaterals and stops pain to treat stubborn painful obstruction with severe symptoms due to Wind, Dampness and/or Cold."]},{"herb":"QuanXie","dosage":"2-5g","actions":["Tracks down Wind, unblocks the collaterals and stops pain."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction."]},{"herb":"MuGua","dosage":"2-12g","actions":["Relaxes the sinews, increases Qi and Blood circulation, unblocks the channels and transforms Dampness."]},{"herb":"AiYe","dosage":"3-10g","actions":["Warms the channels, disperses Cold, alleviates pain, eliminates Dampness and resolves Phlegm."]}],"actions":["Eliminates Heat and Dampness","Eases the tendons","Invigorates the Blood","Moves Qi","Stops pain"],"syndromes":["Damp-Heat in the Lower Jiao"],"manifestations":{"symptoms":["The lower back feels hot either to the patient or practitioner","Chronic pain in the low back and knees, with possible acute exacerbations","The pain is aggravated by Heat, humid or rainy weather and is not improved by rest","Limited lumbar movement","Maybe inability to move forward and backward","Slight swelling and redness in the back area","Obvious tenderness at the sides of the spinous processes or in the sacroiliac joint","The low back feels sore and heavy","The pain may radiate to the lower abdomen","Aches and pains in the bones and sinews","Weakness or atrophy of lower extremities","Painful and/or scanty yellow urine","Red, hot, swollen and painful feet or knees","Edema in lower legs","Leukorrhea (thick, yellow, foul-smelling)","Sores on lower extremities due to Damp","Redness, swelling and pain of the knees with burning sensations","Oliguria","Eczema","Irritability","Feverishness","Spontaneous sweat","A bitter taste in the mouth","Nausea","Vomiting","Diarrhea","Thirst","Loose stools or","Discharge of purulent, bloody stools","Yellowish or reddish urine","Painful urination"],"tongue":"Normal or Red","tongueCoat":"Yellow and greasy","pulse":"Soft and rapid or Slippery and rapid"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}