{"formula":"CanShiTang","names":{"pinyin":"can shi tang","hanzi":"蚕矢汤","english":"silkworm droppings decoction","commonEnglish":"Silkworm Droppings Decoction","aka":["Decoction of Excrementum Bombycis"]},"herbs":[{"herb":"CanSha","dosage":"9-20g","actions":["Dispels Wind, eliminates Dampness, harmonizes the Stomach and transforms turbid Dampness.","With Wu Zhu Yu, Huang Qin and Mu Gua, for Dampness causing abdominal pain, spasms of the calf muscles, nausea, vomiting, and diarrhea."]},{"herb":"YiYiRen","dosage":"12-20g","actions":["Strengthens the Spleen, resolves Dampness, expels Wind-Dampness, relieves pain and clears Damp-Heat."]},{"herb":"DanDouChi","dosage":"12g","actions":["Releases the Exterior, clears Damp-Heat, invigorates Qi and Blood, reduces water distention, raises Yang Qi and opens the channels and collaterals."]},{"herb":"MuGua","dosage":"9-12g","actions":["Relaxes the sinews, increases Qi and Blood circulation, unblocks the channels, harmonizes the Stomach and transforms Dampness.","With Yi Yi Ren, for Summerheat-Dampness with vomiting, diarrhea, abdominal pain and cramping, painful, heavy legs, softened sinews, leg Qi, and Damp painful obstruction.","With Wu Zhu Yu, for \"Leg Qi\" entering the abdomen leading to intolerable stifling encumbrance with abdominal distention and fullness."]},{"herb":"HuangLian","dosage":"6-10g","actions":["Cools Stomach Fire and Heat, alleviating nausea and descending rebellious Qi.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for explosive diarrhea and dysentery with burning pain in the anus or fitted, filthy stools and abdominal pain.","With Zhi Ban Xia, for Cold and Heat in the Middle Jiao with abdominal fullness, nausea and vomiting.","With Wu Zhu Yu, for epigastric and abdominal pain, acid regurgitation, ulcers, vomiting and epigastric upset due to Liver Fire or Stomach Heat.","With Huang Qin and Zhi Zi, for a high fever, irritability, dry mouth and throat, and dark urine due to Fire toxin in the three burners."]},{"herb":"ZhiBanXia.htm","dosage":"3-10g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, harmonizes the Stomach and stops vomiting.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"HuangQin","dosage":"3-6g","actions":["Clears and eliminates Damp-Heat from the Upper Jiao.","With Zhi Zi, for Damp-Heat and jaundice."]},{"herb":"TongCao","dosage":"2-3g","actions":["Promotes urination, resolves Dampness and clears Heat."]},{"herb":"ZhiZi","dosage":"5-6g","actions":["Clears Heat, reduces Fire, eliminates irritability, resolves Dampness and Drains Damp-Heat."]},{"herb":"WuZhuYu","dosage":"0.9-2g","actions":["Warms the Middle, descends Qi and stops nausea."]}],"actions":["Clears Heat","Resolves Dampness","Separates the clear from the turbid (Ascends the clear and Descends the turbid )"],"syndromes":["Damp-Heat sudden turmoil disorder","Damp-Heat Bi"],"manifestations":{"symptoms":["Vomiting","Diarrhea","Spasms","Cramps","Thirst","Irritability","Oliguria with reddish urine","Restlessness","Arthralgia with a burning sensation, redness and swelling","Abdominal pain"],"tongue":"Pink","tongueCoat":"Thick, dry and yellow or Yellow and greasy","pulse":"Soggy and rapid or Floating and rapid or Floating, soft and rapid"},"conditions":[{"condition":"Dysentery","name":"Dysentery"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"name":"Diarrhea"},{"name":"Wet beriberi "},{"condition":"Indigestion","name":"Fermentative indigestion"},{"condition":"AbdominalPain","name":"Abdominal pain "},{"condition":"Gastroenteritis","name":"Acute gastroenteritis"},{"condition":"RheumatoidArthritis","name":"Rheumatoid arthritis"},{"name":"Rheumatic arthritis "},{"condition":"Arthralgia","name":"Arthralgia"},{"name":"Salmonella food poisoning "}],"contra":{"contraindications":["Contraindicated for those with sudden turmoil disorder due to Cold.","Replenish fluids and electrolytes."],"interactions":[""]},"notes":["This formula should be taken Cold or at room temperature."],"modifications":[]}