{"formula":"ChaiHuSiWuTang","names":{"pinyin":"chai hu si wu tang","hanzi":"柴胡四物湯","english":"bupleurum and four substance decoction","commonEnglish":"Bupleurum and Four Substance Decoction","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"8-24g","actions":["Resolves Shao Yang disorders and reduces fever Spreads Liver Qi and relieves Stagnation.","With Huang Qin, for Heat in the Shao Yang.","With Huang Qin and Zhi Ban Xia, for Shao Yang disorders with alternating chills and fever and a sensation of fullness in the hypochondria and chest.","With Huang Qin. Zhi Ban Xia, Zhi Gan Cao and Ren Shen, for weak patients.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation and vertigo, dizziness, thoracic and costal pain, due to Liver Qi Stagnation.","With Bai Shao, Dang Gui and Chuan Xiong, harmonizes the Blood for irregular menstruation."]},{"herb":"HuangQin","dosage":"3-9g","actions":["Drains Fire and detoxifies."]},{"herb":"ZhiBanXia.htm","dosage":"3-9g","actions":["Dries Dampness and transforms Phlegm.","With Ren Shen, for vomiting due to Stomach Deficiency."]},{"herb":"GanCao","dosage":"3-9g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"RenShen","dosage":"3-9g","actions":["Tonifies Spleen and Stomach Qi.","With Shu Di Huang, for severe Qi and Blood Deficiency due to loss of Blood."]},{"herb":"BaiShao","dosage":"15-45g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and relieves pain.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis.","With Zhi Gan Cao, for abdominal pain due to disharmony between the Liver and Stomach.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShuDiHuang","dosage":"15-45g","actions":["Nourishes the Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia."]},{"herb":"DangGui","dosage":"15-45g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Shu Di Huang, Bai Shao and Chuan Xiong, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Chai Hu and Bai Shao, for dysmenorrhea from Liver Qi Stagnation and Blood Deficiency.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"15-45g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]}],"actions":["Spreads Liver Qi","Harmonizes the Blood","Alleviates pain"],"syndromes":["Jue Yin Stage","Chronic consumptive disorders","Blood Deficiency with Stasis"],"manifestations":{"symptoms":["Pain extending from the chest to the back","Alternating chills and fever","Symptoms worsen at night","Late menstruation","Menstrual discharge is scant, dark and clotted","Lower abdominal pain and distention","Flank discomfort","Breast discomfort"],"tongue":"Pale with purple spots","tongueCoat":"Thin","pulse":"Thready and wiry"},"conditions":[{"name":"Chronic consumptive disorders"},{"name":"Colds during menstruation "},{"condition":"LateMenstruation","name":"Delayed menstruation"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"delayed menstruation","modifications":[{"herb":"HuangQin","modification":"- Rx. Scutellariae"},{"herb":"ZhiBanXia","modification":"- Rz. Pinelliae Preparatum"},{"herb":"GanCao","modification":"- Rx. Glycyrrhizae Preparata"},{"herb":"XiangFu","modification":"+ Rz. Cyperi X"},{"herb":"YuJin","modification":"+ Rx. Curcumae"},{"herb":"DanShen","modification":"+ Rx. Salviae Miltiorrhizae"},{"herb":"FoShou","modification":"+ Fr. Citri Sarcodactylis"},{"herb":"WuMei","modification":"+ Fr. Mume"}]}]}