{"formula":"ChaiHuDaYuanYin","names":{"pinyin":"chai hu da yuan yin","hanzi":"柴胡達垣饮","english":"bupleurm decoction to reach the membrane source","commonEnglish":"Bupleurum Decoction to Reach the Membrane Source","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"5g","actions":["Resolves Shao Yang disorders reduces fever, harmonizes the Exterior and Interior, spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Huang Qin, for Heat in the Shao Yang with alternating chills and fever and nausea.","With Zhi Ke, for a stifling sensation in the chest, abdominal pain, poor appetite and irregular bowel movements.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"HuangQin","dosage":"5g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies and calms ascending Liver Yang."]},{"herb":"ZhiKe(Qiao)","dosage":"5g","actions":["Promotes the movement of Qi, reduces distention and pressure, removes stagnated food and resolves hardenings.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"JieGeng","dosage":"3g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm and benefits the throat."]},{"herb":"HouPo","dosage":"3-5g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, resolves Food Stagnation, Promotes the descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ke, for abdominal distention due to Qi and Food Stagnation."]},{"herb":"CaoGuo","dosage":"2g","actions":["Strongly dries Dampness, warms the Middle Jiao, disperses Cold, alleviates malarial disorders, dissolves Stagnation and distention and removes Phlegm.","With Hou Po and Bing Lang, for a pathogen entering the membrane source manifesting as strong alternating chills and fever, a stifling sensation in the chest, nausea or vomiting, headache and a tongue with deep red edges and a thick, foul and pasty coat."]},{"herb":"QingPi","dosage":"5g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"BingLang","dosage":"6g","actions":["Regulates Qi, reduces accumulations, drains downward, unblocks the bowels, promotes urination, treats malarial disorders and relieves nausea."]},{"herb":"HeYe","dosage":"9-15g","actions":["Relieves Summerheat, unblocks Qi, relaxes the sinews, raises Yang fluids, alleviates thirst and cools Heat."]},{"herb":"GanCao","dosage":"2-3g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dispels Dampness","Dissolves Phlegm","Eliminates pathogenic factors from pleurodiaphragmatic interspace"],"syndromes":["Phlegm-Damp Obstruction of the pleurodiaphragmatic interspace (membrane source)"],"manifestations":{"symptoms":["Fullness in the chest and hypochondrium","Restlessness","Irritability","Heartburn","Dizziness","Vertigo","A greasy mouth cavity","Coughing with sputum","Difficulty expectorating","Alternating chills and fever as that in malaria every other day"],"tongue":"Normal","tongueCoat":"Thick and rough","pulse":"Taut and slippery or Wiry and slippery"},"conditions":[{"name":"Malaria"},{"name":"Biliary infection "},{"condition":"Cholecystitis","name":"Cholecystitis"},{"condition":"Dizziness","name":"Dizziness"},{"condition":"Fever","name":"Alternating chills and fever"},{"condition":"Vertigo","name":"Vertigo"},{"condition":"Cough","name":"Cough"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}