{"formula":"ChaiPingTang","names":{"pinyin":"chai ping tang","hanzi":"柴平汤","english":"minor bupleurum decoction with peptic powder","commonEnglish":"Minor Bupleurum Decoction with Peptic Powder","aka":[""]},"herbs":[{"herb":"YinChaiHu","dosage":"6g","actions":["Clears Deficiency Heat."]},{"herb":"HuangQin","dosage":"4.5g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies."]},{"herb":"RenShen","dosage":"3g","actions":["Tonifies Spleen and Stomach Qi."]},{"herb":"ZhiBanXia.htm","dosage":"3g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, harmonizes the Stomach, stops vomiting, dissipates nodules and reduces Stagnation.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Sheng Jiang, for vomiting due to cold, thin mucus.","With Ren Shen, for vomiting due to Stomach Deficiency.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"GanCao","dosage":"1.5g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChenPi","dosage":"3.6g","actions":["Regulates Qi, adjusts the Middle, descends Qi, relieves the diaphragm Dries Dampness and transforms Phlegm.","With Hou Po and Cang Zhu, for epigastric and abdominal fullness and distention, acid regurgitation, fatigue, loose stool and other symptoms associated with Damp-Cold Stagnating in the Spleen and Stomach.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi."]},{"herb":"CangZhu","dosage":"4.5g","actions":["Strongly dries Dampness and tonifies the Spleen.","With Hou Po, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat.","With Hong Zao, for chronic accumulation of Dampness in the Spleen with hypochondriac pain, acid reflux and anorexia."]},{"herb":"HouPo","dosage":"3g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Ren Shen and Gan Cao, for distention and fullness due to Deficiency Cold."]},{"herb":"DaZao","dosage":"4-6g","actions":["Tonifies the Spleen and Stomach, augments Qi and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen."]},{"herb":"ShengJiang","dosage":"10g","actions":["Warms the Middle, stops vomiting, normalizes the flow of Qi at the center and reduces the toxicity of other herbs."]}],"actions":["Harmonizes the Shao Yang","Eliminates Dampness","Harmonizes the Stomach"],"syndromes":["Malaria due to Dampness"],"manifestations":{"symptoms":["Alternating chills and fever","Heat type vomiting"]},"conditions":[{"name":"Malaria"},{"condition":"StomachCancer","name":"Stomach cancer"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}