{"formula":"ChaiHuQingZaoTang","names":{"pinyin":"chai hu qing zao tang","hanzi":"柴胡燥清汤","english":"bupleurum decoction to clear dryness","commonEnglish":"Bupleurum Decoction to Clear Dryness","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"6-12g","actions":["Resolves Shao Yang disorders, reduces fever, harmonizes the Exterior and Interior, disperses Wind-Heat, Spreads Liver Qi and relieves Stagnation.","With Huang Qin, for Heat in the Shao Yang."]},{"herb":"HuangQin","dosage":"4.5-9g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Zhi Mu, for acute and chronic Lung Heat cough."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moistens the Lungs, resolves Phlegm, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ShengJiang","dosage":"4-8g","actions":["Releases the Exterior, disperses Cold, reduces the toxicity of other herbs and normalizes the flow of Qi at the center."]},{"herb":"DaZao","dosage":"10-30g","actions":["Nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, for External Wind-Cold."]},{"herb":"ChenPi","dosage":"6-9g","actions":["Regulates Qi, adjusts the Middle and relieves the diaphragm.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi."]},{"herb":"TianHuaFen","dosage":"9-12g","actions":["Clears and drains Lung Heat, generates Fluids, transforms Phlegm and moistens Lung Dryness."]},{"herb":"ZhiMu","dosage":"9-12g","actions":["Clears Heat and drains Fire from the Qi Stage, from the Lungs and from the Stomach, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]}],"actions":["Harmonizes and releases the Shao Yang","Clears Heat","Generates Fluids"],"syndromes":["Unresolved pathogens in the Shao Yang causing a high fever with perspiration and shivering"],"manifestations":{"symptoms":["Alternating chills and fever or","High fever","Perspiration with shivering"]},"conditions":[{"condition":"Perspiration","name":"Perspiration with shivering"},{"condition":"Fever","name":"Fever"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}