{"formula":"ChaiHuZhiJieTang","names":{"pinyin":"chai hu zhi jie tang","hanzi":"柴胡枳桔汤","english":"bupleurum, bitter orange and platycodon decoction","commonEnglish":"Bupleurum, Bitter Orange and Platycodon Decoction","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"3-9g","actions":["Resolves Shao Yang disorders, reduces fever, harmonizes the Exterior and Interior, spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion.","With Huang Qin, for Heat in the Shao Yang.","With Huang Qin and Zhi Ban Xia, for Shao Yang disorders with alternating chills and fever and a sensation of fullness in the hypochondria and chest."]},{"herb":"ZhiBanXia.htm","dosage":"4.5-9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting."]},{"herb":"HuangQin","dosage":"4.5-9g","actions":["Clears Heat, dries Dampness and calms ascending Liver Yang."]},{"herb":"ZhiKe(Qiao)","dosage":"4.5-9g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi and Cold-Dampness Obstructing the Middle with nausea and hiccup.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction."]},{"herb":"ShengJiang","dosage":"3-6g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting, warms the Lungs, stops cough and reduces the toxicity of other herbs.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold and productive cough due to Phlegm-Dampness."]},{"herb":"JieGeng","dosage":"3-6g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm and benefits the throat.","With Zhi Ban Xia, for cough due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]}],"actions":["Harmonizes and releases the Shao Yang","Promotes the smooth flow of Qi in the chest and diaphragm"],"syndromes":["Shao Yang syndrome","Shao Yang-stage disorder with Stagnation of Qi"],"manifestations":{"symptoms":["Alternating chills and fever","Headache in the lateral aspect of the forehead","Diminished hearing","Vertigo","Fullness in the chest and hypochondrium","Chest pain","Dizziness","Hypoacusis","Pain of the hypochondrium","Parietal headache"],"tongue":"Normal","tongueCoat":"White","pulse":"R: Wiry and slippery, L: Wiry, floating and large"},"conditions":[{"condition":"IrritableBowelSyndrome","name":"Irritable bowel syndrome"},{"condition":"Indigestion","name":"Indigestion"},{"condition":"Headache","name":"Headache"},{"condition":"Gastroenteritis","name":"Chronic gastroenteritis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}