{"formula":"ChanSuDing","names":{"pinyin":"chan su ding (topical)","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ChanSu","dosage":"0.01-0.03g","actions":["Relieves toxicity, reduces swellings and alleviates pain","With Xiong Huang, She Xiang and Zhu Sha, for Dermatological disorders characterized by Heat and toxins."]},{"herb":"MoYao","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, reduces swelling, generates flesh and promotes healing.","With Ru Xiang, topically as a powder for skin lesions and ulcerations."]},{"herb":"RuXiang","dosage":"3-15g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling and generates flesh.","With Mo Yao, Xiong Huang and She Xiang,topically for chronic non-healing wounds and ulcers."]},{"herb":"XiongHuang","dosage":"0.15-0.36g","actions":["Relieves toxicity, dries Dampness and expels Phlegm."]},{"herb":"BaDou","dosage":"3-9g","actions":["Promotes healing of abscesses and ulcers topically.","With Ru Xiang and Mo Yao, topically for sores that have not ulcerated.","With Xiong Huang, topically for skin disorders."]},{"herb":"ZhangNao","dosage":"0.03-0.2g","actions":["Expels Wind and Dampness, invigorates the Blood, Disperses Cold and alleviates pain."]},{"herb":"SheXiang","dosage":"0.03-0.1g","actions":["Activates the Blood, dissipates masses, reduces swellings, detoxifies, opens the channels and alleviates pain.","With Ru Xiang, Mo Yao and Xiong Huang, for trauma induced injury and suppurating sores.","With Ru Xiang and Mo Yao, for carbuncles, sores and hot swellings."]},{"herb":"ZhuSha","dosage":"0.1-2.7g","actions":["Clears Heat, relieves toxicity and prevents putrefaction."]}],"actions":[""],"syndromes":["External Wind Toxin Invasion (Topical)"],"manifestations":{"symptoms":["Postpartum breast swelling and pain","Difficulty breast feeding","Cracked nipple","Localized burning","Heat","Maybe redness","Palpable nodular lumps which are worse with pressure","Aversion to Cold","Fever","Anhidrosis","Headache","Muscular soreness and pain","Whole body joint pain","Chest oppression"],"tongue":"Normal","tongueCoat":"Thin and yellow or Thin and white","pulse":"Floating and rapid or Floating and tight"},"conditions":[{"condition":"Mastitis","name":"Mastitis"},{"name":""}],"contra":{"contraindications":["For External use only."],"interactions":[""]},"notes":["Grind into a powder and make into pills the size of mung beans using Chan Su dissolved in wine. Use one pill, applied to the local area, and covered with a plaster."],"modifications":[]}