{"formula":"ChenRenHuaTieTang","names":{"pinyin":"chen ren hua tie tang","hanzi":"晨人化铁汤","english":"scirpus combination","commonEnglish":"Scirpus Combination","aka":[""]},"herbs":[{"herb":"SanLeng","dosage":"2g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With E Zhu, Dang Gui, Hong Hua and Tao Ren, for Blood Stasis with immobile abdominal masses and postpartum abdominal pain.","With E Zhu, Qing Pi and Shan Zha, for epigastric and abdominal pain and distention and pain due to Qi Stagnation and indigestion."]},{"herb":"EZhu","dosage":"2g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations, alleviates pain and inhibits the growth of cancer cells.","With Mu Xiang, for Food Stagnation with abdominal distention, fullness and pain.","With Qing Pi, for Stagnant Qi with chest and abdominal fullness and pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts, Food Stagnation and hepatosplenomegaly with distention, pain and immobile, palpable epigastric, sub costal and abdominal masses.","With San Leng, Zhi Shi and Mu Xiang, for abdominal pain due to Qi Stagnation."]},{"herb":"QingPi","dosage":"2g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With San Leng and E Zhu, for masses where prolonged Qi Stagnation has led to Blood Stagnation."]},{"herb":"ChenPi","dosage":"2g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Mu Xiang and Zhi Shi, for abdominal distention, fullness and pain.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"ShenQu","dosage":"2g","actions":["Reduces Food Stagnation, promotes digestion, harmonizes the Stomach and moves Qi.","With Bing Lang, for distention of the abdomen due to Food Stagnation."]},{"herb":"ShanZha","dosage":"2g","actions":["Reduces and guides out Food Stagnation, transforms accumulations, transforms Blood Stasis, invigorates Blood circulation and dissipates clumps.","With Shen Qu, for general indigestion and Food Stagnation.","With Zhi Shi, San Leng, E Zhu, Shen Qu and Hong Hua, for Phlegm and Food Stagnation with palpable masses in the abdomen."]},{"herb":"XiangFu","dosage":"2g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis."]},{"herb":"ZhiShi","dosage":"2g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Shan Zha and Shen Qu, for focal distention, swelling and pain along with foul-smelling belching associated with Food Stagnation and Qi Obstruction.","With Chen Pi, strengthens the Middle Jiao.","With Mu Xiang, Bing Lang and Shen Qu, for abdominal fullness, pain, gas and irregular bowel movements."]},{"herb":"HuangLian","dosage":"2g","actions":["Clears Heat, drains Dampness and inhibits the growth of cancer cells.","With Mu Xiang, for dysenteric disorders due to Damp-Heat Obstructing the Intestines.","With Mu Xiang and Bing Lang, for Damp-Heat in the Middle Jiao with intense tenesmus."]},{"herb":"HouPo","dosage":"2g","actions":["Promotes the movement of Qi in the Middle Jiao and resolves Stagnation descends Qi, dries Dampness and transforms Phlegm.","With Zhi Shi, for abdominal or chest distention, focal epigastric distention, wheezing, shortness of breath, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem.","With Xiang Fu and Chen Pi, for Epigastric and abdominal bloating due to Dampness Obstructing the Qi."]},{"herb":"DangGui","dosage":"2g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Tao Ren and Hong Hua, for amenorrhea, pain, swelling and other symptoms associated with Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi."]},{"herb":"ChuanXiong","dosage":"2g","actions":["Invigorates the Blood and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Dang Gui, Hong Hua and Tao Ren, for headaches from Blood Stagnation."]},{"herb":"TaoRen","dosage":"2g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses."]},{"herb":"HongHua","dosage":"2g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, alleviates pain and inhibits the growth of cancer cells.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With San Leng and E Zhu, for abdominal masses and accumulations.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation such as dysmenorrhea, amenorrhea, swollen painful sores and chest and abdominal pain."]},{"herb":"MuXiang","dosage":"2g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen.","With Qing Pi, for abdominal pain, distention and belching.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation with abdominal distention and fullness, anorexia, aversion to the smell of food, nausea without the ability to vomit and an uncomfortable urge to defecate which is often unsuccessful."]},{"herb":"ShengJiang","dosage":"2g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei and normalizes the flow of Qi at the center.","\\With Da Zao, nourishes the Blood, prevents injury from harsh Blood movers and assists the movement of Qi.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccups."]},{"herb":"DaZao","dosage":"2g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit, and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"BingLang","dosage":"2.5g","actions":["Regulates Qi, reduces accumulations, drains downward, unblocks the bowels, promotes urination, relieves nausea and inhibits the growth of cancer cells.","With Mu Xiang and Qing Pi, for Qi Stagnation and Food Accumulation.","With Mu Xiang and Hou Po, for tenesmus."]},{"herb":"GanCao","dosage":"1.5g","actions":["Moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs, guides the herbs to all twelve channels and inhibits the growth of cancer cells."]}],"actions":["Regulates Qi","Invigorates the Blood","Breaks up Stasis","Reduces Food Stagnation","Clears Heat","Inhibits the growth of cancer cells"],"syndromes":["Qi and Blood Stagnation with Food Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe or","Pains that move around","Epigastric fullness, distention and pain","Belching with rotten food smell","Acid regurgitation","Detests food or","Vomits after eating","Distention is reduced after vomiting","Unformed stools or","Knotted constipation","Depression","Irritability","Pain is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White or Thick and greasy","pulse":"Choppy or Wiry and choppy or Slippery"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}