{"formula":"ChenTanTangLuoYIn","names":{"pinyin":"chen tan tang luo yin","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"3-14g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"ZeXie","dosage":"4.5-16g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Zhi Ban Xia, for Turbid Dampness in the Middle Jiao causing epigastric and abdominal distention.","With Fu Ling, facilitates the removal of water and leaches out Dampness."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao, transforms Phlegm, Quiets the Heart, calms the Spirit and soothes the nerves.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis and descends Blood and Fire."]},{"herb":"YuJin","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, alleviates pain, clears Heat, cools the Blood, clears the Heart and Pericardium and opens the Orifices."]},{"herb":"ShiChangPu","dosage":"1.5-10g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind,transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi and promotes Blood flow.","With Yu Jin, transforms Dampness, opens the Orifices, and awakens the brain to treat Warm-Damp.","With Yu Jin and Zhi Ban Xia, for disorientation, irritability, dizziness, and hearing problems due to Turbid Dampness Blocking the Orifices."]},{"herb":"DiLong","dosage":"4-15g","actions":["Drains Heat, settles convulsions, extinguishes Wind, stops spasms, clears Heat, unblocks and promotes movement in the channels and collaterals, anchors Liver Yang and lowers Blood pressure."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Resolves Phlegm","Removes Stagnation"],"syndromes":["Phlegm Stagnation"],"manifestations":{"symptoms":["Dizziness","Stiff tongue","Deviation of the eyes and mouth","Hemiplegia","Fullness of the chest or","Masses or","Distended abdomen","Heavy limbs","Nausea","Omitting"],"tongue":"Pink","tongueCoat":"Sticky and yellow","pulse":"Slippery"},"conditions":[{"condition":"Stroke","name":"Stroke"},{"condition":"AIDS-HIV","name":"AIDS/HIV"},{"condition":"Hypertension","name":"Hypertension due to Phlegm Stagnation "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}