{"formula":"ChouDongLingChongJi","names":{"pinyin":"chou dong ling chong ji","commonEnglish":"","aka":[""]},"herbs":[{"herb":"TianMa","dosage":"3-10g","actions":["Extinguishes Wind, calms the Liver, stops spasms and tremors, subdues Rising Liver Yang and alleviates pain."]},{"herb":"GouTeng","dosage":"6-16g","actions":["Extinguishes Wind, drains Liver Heat, pacifies Liver Yang and alleviates spasms.","With Tian Ma, calms the Liver and extinguishes Wind."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen and augments Qi."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, softens the Liver, calms Liver Yang and Liver Wind and alleviates pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Long Gu and Mu Li, for spontaneous sweating and night sweats due to Yin Deficiency."]},{"herb":"ShiChangPu","dosage":"1.5-3g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, awakens the Spleen, promotes the movement of Qi and promotes Blood flow."]},{"herb":"LongGu","dosage":"15-30g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang."]},{"herb":"MuLi","dosage":"9-30g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Bai Shao, for anxiety, palpitations, insomnia, and dream disturbed sleep, headache, dizziness and tinnitus and other symptoms associated with Yin Deficiency with Yang Rising."]},{"herb":"JiangCan","dosage":"3-10g","actions":["Extinguishes Wind, transforms Phlegm and stops spasms and convulsions."]},{"herb":"YuJin","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears the Heart and Pericardium and opens the Orifices."]},{"herb":"GanCao","dosage":"3-14g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain and moderates and harmonizes the harsh properties of other herb.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]}],"actions":["Extinguishes Wind","Calms the Liver","Stops spasms and tremors","Tonifies the Spleen","Augments Qi","Opens the Orifices","Calms the Spirit","Invigorates the Blood","Dispels Blood Stasis","Regulates Qi flow"],"syndromes":["Qi and Blood Deficiency Generate Wind"],"manifestations":{"symptoms":["Tics","Spasms"]},"conditions":[{"condition":"TouretteSyndrome","name":"Tourette syndrome "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"a stronger effect","modifications":[{"herb":"QuanXie","modification":"+ Scorpio"}]}]}