{"formula":"ChuanShanJiaQuShiQingDuWan","names":{"pinyin":"chuan shan jia qu shi qing du wan","hanzi":"armadillo counter","english":"poison pills","commonEnglish":"Armadillo Counter Poison Pills","aka":[""]},"herbs":[{"herb":"ChuanShanJia","dosage":"20g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling and promotes the discharge of pus."]},{"herb":"DangShen","dosage":"6.5g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"ShuDiHuang","dosage":"5g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin."]},{"herb":"NiuHuang","dosage":"5g","actions":["Drains Heat and resolves Fire toxicity."]},{"herb":"DaJi","dosage":"5g","actions":["Cools the Blood, disperses Blood Stasis, reduces swelling and generates flesh."]},{"herb":"DaFengZi","dosage":"5g","actions":["Expels Wind, dries Dampness, attacks toxicity and kills parasites."]},{"herb":"BaiXianPi","dosage":"4g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"TuFuLing","dosage":"4g","actions":["Relieves toxicity, eliminates Dampness and clears Damp-Heat from the skin."]},{"herb":"JuHua","dosage":"4g","actions":["Disperses Wind, clears Heat, detoxifies, calms Liver Yang and extinguishes Wind."]},{"herb":"CangErZi","dosage":"3g","actions":["Disperses Wind and Dampness and opens the nasal passages."]},{"herb":"ChuanBeiMu","dosage":"3g","actions":["Clears Heat, transforms Phlegm and dissipates nodules.","With Lian Qiao, releases constrained toxins."]},{"herb":"LianQiao","dosage":"2.5g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat.","With Jin Yin Hua, for initial stage Wind-Heat."]},{"herb":"NiuBangZi","dosage":"2.5g","actions":["Disperses Wind-Heat.","With Lian Qiao, unblocks and drains Heat toxin and disperses clumps and swellings for sore, swollen throat, swellings like mumps, boils and other Heat toxin lesions and ulcerations.."]},{"herb":"SheChuangZi","dosage":"2.5g","actions":["Dries Dampness, kills parasites, stops itching, dispels Wind and dries Dampness."]},{"herb":"HuangQin","dosage":"2g","actions":["Clears Heat, dries Dampness, drains Fire, cools the Blood and detoxifies."]},{"herb":"BaiShao","dosage":"2g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind, softens the Liver and relieves pain."]},{"herb":"JinYinHua","dosage":"2g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat, clears Damp-Heat from the Lower Jiao and cools the Blood.","With Lian Qiao, for various Heat disorders."]},{"herb":"ChuanXiong","dosage":"3g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Tu Fu Ling,raises the clear Yang while directing turbid Qi downward, moves Qi, invigorates the Blood, clears Heat and removes Dampness for headache from constrained Damp-Heat in the Liver channel."]},{"herb":"HuangQi","dosage":"5g","actions":["Tonifies Qi and Blood, aids circulation of moisture downward from the face, promotes the discharge of pus, generates flesh and expels toxins."]}],"actions":["Clears Heat","Clears Damp-Heat","Disperses Dampness","Disperses Wind-Damp","Eliminates Toxicity","Invigorates the Blood"],"syndromes":["Damp-Heat and toxins affecting the skin"],"manifestations":{"symptoms":["Itching","Pruritic moist rash"]},"conditions":[{"condition":"AcneVulgaris","name":"Acne"},{"condition":"Dermatitis","name":"Dermatitis"},{"condition":"Urticaria","name":"Urticaria"},{"condition":"Eczema","name":" Weeping eczema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}