{"formula":"DaChangAiTang","names":{"pinyin":"da chang ai tang","hanzi":"大肠癌汤","english":"colon cancer decoction","commonEnglish":"Colon Cancer Decoction","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity, clears Damp-Heat from the Lower Jiao and inhibits the growth of cancer cells."]},{"herb":"BaYueZha","dosage":"30g","actions":["Dredges the Liver, regulates Qi, controls pain, expels Phlegm, disperses clumps, invigorates the Blood, removes toxins and inhibits the growth of cancer cells."]},{"herb":"BaiHuaSheSheCao","dosage":"60g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses, clears Heat, promotes urination and inhibits the growth of cancer cells."]},{"herb":"YaDanZi","dosage":"15g","actions":["Cools Heat, resolves toxicity, expels Dampness, cools the Blood, softens hardness and treats cancer caused by Toxic Heat."]},{"herb":"BaiJiangCao","dosage":"30g","actions":["Clears Heat, resolves toxicity, expels pus, eliminates Phlegm, reduces abscesses, invigorates the Blood, dispels Blood Stasis, stops pain and inhibits the growth of cancer cells.","With Jin Yin Hua, for suppurative abscesses."]},{"herb":"SheGan","dosage":"30g","actions":["Clears Heat, relieves Fire toxicity and transforms Phlegm."]},{"herb":"MuLi","dosage":"15g","actions":["Softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"DaFuPi","dosage":"15g","actions":["Descends Qi, eases the Middle, promotes urination and reduces edema."]},{"herb":"DaHuang","dosage":"5g","actions":["Clears Heat, reduces Fire toxicity, transforms Dampness, promotes urination, eliminates Phlegm, invigorates the Blood, dispels Blood Stasis and inhibits the growth of cancer cells."]}],"actions":["Clears Heat","Relieves toxicity","Transforms Phlegm","Softens hardness","Dissipates nodules","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat"],"manifestations":{"symptoms":["Tumor develops quickly","Fluid inside the breast with a lump inside it","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia"],"tongue":"Red","tongueCoat":"White or Yellow and greasy or Thick, sticky, dry and yellow","pulse":"Wiry or Rolling and rapid or Wiry, overflowing and rapid"},"conditions":[{"condition":"BreastCancer","name":"Chemo support for breast cancer with Colon metastasis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}