{"formula":"DaHuangTuBieChongWan","names":{"pinyin":"da huang tu bie chong wan","hanzi":"大簧土鳖虫囊","english":"pill with rhubarb root and eupolyphaga/steleophaga","commonEnglish":"Pill with Rhubarb Root and Eupolyphaga/Steleophaga","aka":[""]},"herbs":[{"herb":"SanLeng","dosage":"9g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With E Zhu, for hepatosplenomegaly with distention, pain and immobile, palpable epigastric, sub-costal, and abdominal masses. (only for strong patients)"]},{"herb":"EZhu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"DaHuang","dosage":"9g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis and inhibits the growth of cancer cells."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis , invigorates Blood circulation, moistens the Intestines, unblocks the bowels and drains abscesses.","With Da Huang, for severe abdominal infections."]},{"herb":"TuBieChong","dosage":"9g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation, disperses lumps and masses and inhibits the growth of cancer cells.","With Da Huang, breaks up fixed abdominal masses from Blood Stasis."]},{"herb":"ShuiZhi","dosage":"9g","actions":["Breaks up and drives out Blood Stasis, reduces fixed masses and inhibits the growth of cancer cells.","With San Leng and E Zhu, for palpable, fixed abdominal masses.","With Da Huang, regulates Yin and Yang to quickly attack and break up Blood Stasis."]}],"actions":["Invigorates the Blood","Strongly breaks up Blood Stasis","Softens hard masses","Inhibits the growth of cancer cells"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["A hard, enlarged Liver","Pain that is fixed, stabbing and /or severe","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Varicose and spider veins","Blue, dark or purplish discoloration of skin in small or large areas,","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":["Contraindicated for weak patients."],"interactions":[""]},"notes":["This treats a hard, enlarged Liver in a strong patient.","Grind the ingredients into a fine powder and make into small pills. Take 9g a day. The dosage is proper if the stools are kept slightly loose."],"modifications":[]}