{"formula":"DanErChongTang","names":{"pinyin":"dan er chong tang","hanzi":"丹二虫汤","english":"salvia two worms decoction","commonEnglish":"Salvia Two Worms Decoction","aka":[""]},"herbs":[{"herb":"DanShen","dosage":"15g","actions":["Activates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"GuaLou","dosage":"12g","actions":["Clears Lung Heat, transforms Hot Phlegm and regulates Qi."]},{"herb":"ZhiBaiFuZi","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, expels Wind and stops spasms."]},{"herb":"DanNanXing","dosage":"9g","actions":["Clears Heat, dissolves Phlegm, calms Wind and stops convulsions."]},{"herb":"ZhiShi","dosage":"9g","actions":["Breaks up Stagnant Qi, reduces accumulation, transforms Phlegm and descends Qi."]},{"herb":"TianZhuHuang","dosage":"9g","actions":["Clears and transforms Phlegm-Heat, clears Heat, cools the Heart and settles convulsions and tremors.","With Shi Chang Pu, Tian Ma, Quan Xie, and Dan Nan Xing, for comas associated with Heat and Wind-Stroke with Phlegm Obstruction."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind and promotes Blood flow."]},{"herb":"YuanZhi","dosage":"9g","actions":["Calms the Spirit, sedates the Heart, expels Phlegm and opens the Orifices."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"HongHua","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Chuan Xiang, for chest and abdominal pain due to Qi and Blood Stasis."]},{"herb":"TianMa","dosage":"4.5g","actions":["Extinguishes Wind, calms the Liver, stops spasms and tremors, extinguishes Wind, subdues Rising Liver Yang and alleviates pain.","With Chuan Xiong, for overwhelming attacks of Wind leading to migraines and dizziness so severe that the person feels as if they are about to fall over."]},{"herb":"ShuiZhi","dosage":"3g","actions":["Breaks up and drives out Blood Stasis."]},{"herb":"QuanXie","dosage":"1.5g","actions":["Extinguishes Wind and stops tremors and convulsions."]}],"actions":["Breaks up Phlegm","Opens the Orifices","Activates the Blood","Breaks up Stasis"],"syndromes":["Phlegm and Blood Stagnation"],"manifestations":{"symptoms":["The tongue does not move freely","Unclear speech","Drooling"],"tongue":"Deviated","tongueCoat":"Thin and slimy","pulse":"Slippery and slow"},"conditions":[{"condition":"Aphasia","name":"Aphasia"},{"condition":"Aphasia","name":"Difficult speech "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}