{"formula":"DangShaoDiHuangTang","names":{"pinyin":"dang shao di huang tang","hanzi":"当芍地黄汤","english":"dang gui, peony and rehmannia decoction","commonEnglish":"Dang Gui, Peony and Rehmanniae Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Gui Zhi, harmonizes the Ying and Wei."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood and nourishes Yin.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Induces sweating, expels Wind-Dampness, strongly dries Dampness and tonifies the Spleen."]},{"herb":"MuGua","dosage":"2-12g","actions":["Relaxes the sinews, increases Qi and Blood circulation, unblocks the channels, harmonizes the Stomach, nourishes the Liver and transforms Dampness.","With Dang Gui and Bai Shao, for Blood Deficiency causing muscle spasms."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for a residual Warm pathogen which has injured the Yin."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention."]},{"herb":"ZeXie","dosage":"4.5-16g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Mu Dan Pi, for steaming bone disorder, dizziness and vertigo."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints.","With Sheng Di Huang, powerfully clears Deficiency Fire."]},{"herb":"CheQianZi","dosage":"4-15g","actions":["Promotes urination and clears Damp-Heat.","With Ze Xie, for Lin syndrome, edema and distention.","With Niu Xi, for Kidney Deficiency edema.","With Cang Zhu, for Damp-Heat vaginal discharge with Spleen Deficiency."]},{"herb":"GuiZhi","dosage":"3-10g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels and relieves pain.","With Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei including spontaneous sweating, fever and chills.","With Fu Ling, unblocks Yang and facilitates the removal of congested fluids associated with Yang Deficiency edema."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Niu Xi, for Wind-Damp Bi causing joint pain, especially in the lower joints."]},{"herb":"ChuanShanLong","dosage":"15-30g","actions":["Dispels Wind, eliminates Dampness,invigorates the Blood, unblocks the collaterals and relaxes the sinews."]}],"actions":["Cools the Blood","Clears Blood Heat","Nourishes and invigorates the Blood","Releases the Exterior","Expels Wind-Dampness","Alleviates pain"],"syndromes":["Severe Wind-Cold or Heat and Dampness with Blood Deficiency"],"manifestations":{"symptoms":["Joint redness, swelling, Heat and pain","Stiffness and inflexibility","Initially the pain eases when exposed to coolness","Later, coolness does not help. but warmth does","Dry mouth","Bitter taste in the mouth","Parched throat","Insomnia","Agitation","Irritability","Fatigue","Loose stools","Anorexia","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion"],"tongue":"Red or Pale","tongueCoat":"White or Yellow or Slimy and yellow","pulse":"Empty or Wiry and rapid"},"conditions":[{"condition":"RheumatoidArthritis","name":"Rheumatoid arthritis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Cold","modifications":[{"herb":"ZhiFuZi","modification":"+ Rx. Aconiti Lateralis Preparata"}]},{"purpose":"Heat","modifications":[{"herb":"ShiGao","modification":"+ Gypsum Fibrosum"}]},{"purpose":"severe Yin Deficiency","modifications":[{"herb":"ShengDiHuang","modification":"+ more (60g) Rx. Rehmanniae"}]},{"purpose":"Qi Deficiency","modifications":[{"herb":"RenShen","modification":"+ Rx. Ginseng"},{"herb":"HuangQi","modification":"+ Rx. Astragali"}]}]}