{"formula":"DangGuiAiYeTang","names":{"pinyin":"dang gui ai ye tang","hanzi":"当归艾叶汤","english":"dang gui and artemisia combination","commonEnglish":"Dang Gui and Artemisia Combination","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"13.5g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Tu Si Zi and Hou Po, for restless fetus disorder with lower back and abdominal pain.",""]},{"herb":"AiYe","dosage":"6g","actions":["Warms the channels, warms the womb, stops bleeding, calms the fetus, disperses Cold and alleviates pain."]},{"herb":"HouPo","dosage":"6g","actions":["Promotes the movement of Qi in the Middle Jiao and resolves Stagnation."]},{"herb":"ChuanXiong","dosage":"3.5g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"JingJie","dosage":"7.2g","actions":["Releases the Exterior, expels Wind and relieves muscle spasms.","With Dang Gui, for itching and tremors of the hands and feet from Wind due to Blood Deficiency.","With Dang Gui and Chuan Xiong, for postpartum External Wind."]},{"herb":"ChuanBeiMu","dosage":"4g","actions":["Clears Heat, transforms Phlegm, stops coughing and nourishes and moistens the Lungs.","With Dang Gui and Bai Shao, harmonizes the Ying Qi.",""]},{"herb":"TuSiZi","dosage":"9g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver and calms the fetus."]},{"herb":"HuangQi","dosage":"7.2g","actions":["Tonifies Qi and Blood and relieves numbness and pain."]},{"herb":"QiangHuo","dosage":"4.5g","actions":["Releases the Exterior and disperses Cold.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"ZhiKe(Qiao)","dosage":"5.4g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"GanCao","dosage":"4.5g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"BaiShao","dosage":"18g","actions":["Nourishes the Blood, softens the Liver, relieves pain and regulates menstruation.","With Gan Cao, for abdominal pain due to disharmony between the Liver and Stomach.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShengJiang","dosage":"3g","actions":["Releases the Exterior, induces perspiration, disperses Cold and reduces the toxicity of other herbs."]}],"actions":["Nourishes the Blood","Stabilizes the fetus"],"syndromes":["Blood Deficiency"],"manifestations":{"symptoms":["Fetal Irritability","Habitual miscarriage","Pain in the waist and abdomen during pregnancy","Dizziness","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Fatigue","Scanty periods"],"tongue":"Pale","tongueCoat":"Thin, white and dry","pulse":"Thready and rapid or Weak"},"conditions":[{"condition":"Pregnancy","name":"Fetal irritability"},{"condition":"HabitualMiscarriage","name":"Habitual miscarriage"},{"condition":"FetalRestlessness","name":"Fetal restlessness"},{"condition":"Pregnancy","name":"Difficult Labor"},{"condition":"Pregnancy","name":"Pain in the waist and abdomen during pregnancy"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}