{"formula":"DanShenHuoXueTang","names":{"pinyin":"dan shen huo xue tang","hanzi":"丹参活血汤","english":"red sage root decoction for promoting blood circulation","commonEnglish":"Red Sage Root Decoction for Promoteing Blood Circulation","aka":[""]},"herbs":[{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Huang Qi, for many Blood Deficiency and Qi and Blood patterns.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"JiXueTeng","dosage":"9-20g","actions":["Invigorates and tonifies the Blood, invigorates the channels and relaxes the sinews.","With Sang Ji Sheng and Niu Xi, for Wind-Damp Bi, especially chronic painful obstruction in women and the elderly where there is also Blood Deficiency."]},{"herb":"SangJiSheng","dosage":"9-30g","actions":["Tonifies Liver and Kidney Yin, strengthens the sinews and bones and expels Wind-Dampness."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes the Liver and Kidney Yin, strengthens the sinews and bones, benefits the joints and Clears Damp-Heat in the Lower Jiao."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness, and paralysis."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood and relieves numbness and pain.","With Dang Gui, for Qi and Blood Deficiencies with chronic non-healing sores, numbness, painful obstruction and paresthesias."]},{"herb":"YuJin","dosage":"3-15g","actions":["Invigorates Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores and alleviates pain.","With Dan Shen, for Heat with Blood Stasis causing chest Bi."]}],"actions":["Tonifies Qi and Blood","Invigorates the Blood","Dispels Blood Stasis","Expels Wind-Dampness","Relaxes the sinews and bones"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["The local skin of the affected area is dark purple in color.","There are some hard cord-like subcutaneous swollen masses which are not painful when they are pressed.","Coldness","Numbness","Pain"],"tongue":"Some echymoses","tongueCoat":"White","pulse":"Soft and slow or Taut and uneven"},"conditions":[{"condition":"Phlebitis","name":"Chronic phlebitis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}