{"formula":"DaQiangHuoTang","names":{"pinyin":"da qiang huo tang","hanzi":"大羌活汤","english":"major notopterygium decoction","commonEnglish":"Major Notopterygium Decoction","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"9g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Du Huo, for Wind-Dampness.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"DuHuo","dosage":"9g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain.","With Fang Feng , for numbness in the legs.","With Qiang Huo, for joint pain and numbness.","With Xi Xin, for joint pain due to Wind-Cold-Dampness.",""]},{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior, expels Wind-Dampness and alleviates pain.","With Cang Zhu, for pain due to Wind-Dampness Bi with aching joints, heavy limbs and generalized aching discomfort.","With Qiang Huo, for Wind-Dampness."]},{"herb":"XiXin","dosage":"9g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Chuan Xiong, for Wind-Cold headache, toothache and Bi pain.","With Qiang Huo, Fang Feng and Chuan Xiong, for Wind-Cold."]},{"herb":"GuangFangJi","dosage":"9g","actions":["Expels Wind-Dampness and clears Heat."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat and dries Dampness.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, a dry mouth, a parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease."]},{"herb":"HuangLian","dosage":"9g","actions":["Clears Heat and drains Dampness."]},{"herb":"CangZhu","dosage":"9g","actions":["Induces sweating, expels Wind-Dampness, strongly dries Dampness and tonifies the Spleen.","With Qiang Huo, Du Huo, Qiang Huo and Xi Xin, for Exterior Wind-Cold-Dampness."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction."]},{"herb":"ZhiMu","dosage":"30g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire, quenches thirst and ameliorates the Dryness of warming herbs.",""]},{"herb":"ChuanXiong","dosage":"30g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Xi Xin and Fang Feng, for Wind-Cold headaches.",""]},{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin, generates fluids and protects against the drying effects of other herbs."]}],"actions":["Scatter Wind-Cold","Expel Dampness","Clear Heat"],"syndromes":["Wind-Cold-Damp Bi with Interior Heat"],"manifestations":{"symptoms":["Fever and chills with fever predominant","Headache","Dry mouth","Thirst","Irritability"]},"conditions":[{"condition":"PainfulObstruction","name":"Painful obstruction"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}