{"formula":"DaTuSiZiWanJiaJian","names":{"pinyin":"da tu si zi wan jia jian","hanzi":"大菟丝子囊加減","english":"modified major cuscuta pills","commonEnglish":"Modified Major Cuscuta Pills","aka":[""]},"herbs":[{"herb":"TuSiZi","dosage":"12g","actions":["Tonifies the Kidneys, strengthens Yang, nourishes Yin, astringes Jing and urine and benefits the marrow.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency."]},{"herb":"LuRong","dosage":"1g","actions":["Tonifies the Kidneys and strengthens Yang.","With Shu Di Huang, for impotence and spermatorrhea (men) and infertility and thin vaginal discharge (women) due to Kidney Deficiency Cold."]},{"herb":"MuLi","dosage":"15g","actions":["Prevents leakage of fluids."]},{"herb":"ShuDiHuang","dosage":"9g","actions":["Nourishes Liver and Kidney Yin.","With Zhi Fu Zi and Rou Gui, for Kidney Yang Deficiency.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"RouGui","dosage":"3g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and Deficiency of Ming Men Fire with impotence or infertility.","With Zhi Fu Zi, Shan Zhu Yu and Shu Di Huang, for Kidney Yang Deficiency."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang."]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys and strengthens the sinews and bones.","With Du Zhong, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees, weakness of the legs which makes walking difficult",""]},{"herb":"ShanZhuYu","dosage":"9g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Xu Duan and Du Zhong, for low back pain and weakness."]},{"herb":"DuZhong","dosage":"9g","actions":["Tonifies the Kidneys and Liver and strengthens the sinews and bones.","With Shan Zhu Yu and Tu Si Zi, for impotence and frequent urination due to Deficiency Cold of the Kidneys."]},{"herb":"SangPiaoXiao","dosage":"12g","actions":["Tonifies the Kidneys, assists Yang, retains Jing and astringes urine.","With Tu Si Zi, for spermatorrhea and vaginal discharge due to Kidney Deficiency."]},{"herb":"BaJiTian","dosage":"9g","actions":["Tonifies the Kidneys and strengthens Yang."]},{"herb":"FuPenZi","dosage":"9g","actions":["Tonifies and stabilizes the Kidneys, tonifies Yang and astringes Jing and urine.","With Du Zhong, for low back pain and coldness in the lower extremities due to Kidney Deficiency."]}],"actions":["Warms and Reinforces Kidney Yang","Secures the Bladder"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Enuresis or","Urinary incontinence","Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Cold limbs","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Lassitude","Withdrawn, subdued behavior","Knees feel cold and aching","Dizziness","Tinnitus","Impotence","Spermatorrhea","Premature ejaculation","Low libido","Female infertility (\"uterus cold and infertile\")","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white","pulse":"Deep and thready - maybe slow"},"conditions":[{"condition":"Enuresis","name":"Enuresis"},{"condition":"UrinaryIncontinence","name":"Urinary incontinence"},{"condition":"Tinnitus","name":"Tinnitus"},{"name":"Premature ejaculation"},{"name":"Nocturia"},{"condition":"LowBackPain","name":"Low back pain"},{"condition":"Deafness","name":"Deafness"},{"condition":"Spermatorrhea","name":"Spermatorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}