{"formula":"DaYanTang","names":{"pinyin":"da yan tang","hanzi":"大延汤","english":"great corydalis decoction","commonEnglish":"Great Corydalis Decoction","aka":[""]},"herbs":[{"herb":"YanHuSuo","dosage":"15g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"BanLanGen","dosage":"15g","actions":["Drains Heat, relieves Fire toxicity and cools the Blood."]},{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, aids circulation of moisture downward from the face, promotes urination, reduces edema, promotes the discharge of pus, generates flesh, expels toxins and relieves pain."]},{"herb":"DaQingYe","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood and dissipates maculae.","With Jin Yin Hua, for Toxic Heat sores.","with Dan Shen, for icteric and anicteric hepatitis and cholecystitis."]},{"herb":"JinYinHua","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao.","With Gan Cao, for toxic swellings and sores.","With Huang Qin, for suppurating boils that have not ulcerated, or have ulcerated but are not discharging pus."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao and augments Qi.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"ZiCao","dosage":"12g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins, encourages rashes and clears Damp-Heat from the skin.","With Da Qing Ye, for dense purpuric rash associated with severe Fire toxin."]},{"herb":"DanShen","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, cools the Blood and reduces abscesses."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies and calms ascending Liver Yang.","With Chai Hu, for Heat in the Shao Yang with alternating chills and fever and nausea."]},{"herb":"BaiZhi","dosage":"9g","actions":["Expels Wind, eliminates Dampness, reduces swelling, eliminates toxins and expels pus.","With Gan Cao, for a Stomach ache."]},{"herb":"BaiXianPi","dosage":"9g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind and dries Dampness."]},{"herb":"HanFangJi","dosage":"6g","actions":["Promotes urination, reduces edema especially in the lower body, expels Wind-Dampness, purges Damp-Heat and alleviates pain.","With Huang Qi, for Wind-Dampness with exterior Deficiency."]},{"herb":"ChaiHu","dosage":"6g","actions":["Spreads Liver Qi, relieves Stagnation and reduces fever.","With Gan Cao, for hepatitis and upper right quadrant pain.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen,d augments Qi, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Clears and dredges the Liver","Clears Heat","Resolves toxins","Moves Qi","Invigorates the Blood","Disinhibits Dampness","Tonifies Qi"],"syndromes":["Toxic Damp-Heat"],"manifestations":{"symptoms":["Fever","Restlessness","Irritability","Thirst","Foul breath","Vomiting","Abdominal pain","Constipation","Scanty urine","Skin rashes","Epistaxis","Bleeding gums","Muscular spasms or","Convulsions","Hypochondriac and Stomach fullness and pain","Unclear thinking","Delirium","Epistaxis","Hematochezia","Bleeding from the mouth","Bruises easily"],"tongue":"Deep red","tongueCoat":"Dry yellow","pulse":"Rapid"},"conditions":[{"condition":"HerpesZoster","name":"Herpes zoster"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}