{"formula":"DaYingJian","names":{"pinyin":"da ying jian","hanzi":"大营煎","english":"big nutritive qi decoction","commonEnglish":"Big Nutritive Qi Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"9g","actions":["Nourishes the Blood and Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"GouQiZi","dosage":"6g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs."]},{"herb":"NiuXi","dosage":"9g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes the Liver and Kidney Yin and clears Damp-Heat in the Lower Jiao."]},{"herb":"RouGui","dosage":"6g","actions":["Warms the Kidneys, Spleen and Heart, strengthens the Yang and Ming Men Fire, disperses deep Cold, warms the channels,","unblocks the channels and vessels, leads the Fire back to its source, assists the generation of Qi and Blood and alleviates pain."]}],"actions":["Nourishes the Blood","Tonifies Kidney Yang and Ming Men Fire"],"syndromes":["Deficiency Cold entering the uterus"],"manifestations":{"symptoms":["Late period","Scanty bleeding with dark clots during menstruation","Dysmenorrhea","Abdominal pain","Pain alleviated by warmth and pressure","General feeling of Cold","Soft abdomen when palpated"],"tongue":"Pale","tongueCoat":"White","pulse":"Deep and slow"},"conditions":[{"condition":"LateMenstruation","name":"Late menstruation "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}