{"formula":"DeShengTangJiaWei","names":{"pinyin":"de sheng tang jia wei","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chai Hu and Bai Shao, for dysmenorrhea from Liver Qi Stagnation and Blood Deficiency.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis, regulates menstruation.","With Dang Gui, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness and scanty menstruation.","With Dang Gui, Bai Shao and Dan Shen, for abdominal pain due to irregular menstruation or amenorrhea."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi and relieves Stagnation.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation and vertigo, dizziness and thoracic and costal pain due to Liver Qi Stagnation.","With Bai Shao, Dang Gui and Chuan Xiong, harmonizes the Blood for irregular menstruation."]},{"herb":"MuXiang","dosage":"3-10g","actions":["Promotes the movement of Qi, alleviates pain and harmonizes the Liver and Spleen."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Dang Gui, for irregular menstruation."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation, stops pain and conducts Heat out from below."]}],"actions":["Tonifies the Blood","Soothes the Liver","Unblocks the Liver","Moves Qi","Releases Stagnation","Regulates menstruation"],"syndromes":["Liver Qi Stagnation"],"manifestations":{"symptoms":["Infertility","Inability to conceive for many years","Decreased and dark-colored menses that contain clots or","Scanty, pale-colored menses","Irregular menstruation","Breast and hypochondria pain","Abdominal pain with periods","Maybe premenstrual breast distention","Premenstrual breast tension","Painful periods","Irritability before periods","Anxiety before periods","Depression","Abdominal distention","Eructation","sighing","Water retention","Headache","A history of cramping"],"tongue":"Normal color or slightly red on the sides; if Stagnation of Qi arises from Blood Deficiency, the sides might be Pale","tongueCoat":"Normal","pulse":"Taut or Wiry; if Qi Stagnation arises from Blood Deficiency, it may be Choppy"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}