{"formula":"DianKuangMengXingTang","names":{"pinyin":"dian kuang meng xing tang","hanzi":"癫狂梦醒汤","english":"decoction to wake from the nightmare of insanity","commonEnglish":"Decoction to Wake from the Nightmare of Insanity","aka":[""]},"herbs":[{"herb":"TaoRen","dosage":"24g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"ChaiHu","dosage":"9g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion.","With Gan Cao, for upper right quadrant pain.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"XiangFu","dosage":"6g","actions":["Spreads and regulates Liver Qi.","With Chai Hu, for Qi Stagnation."]},{"herb":"MuTong","dosage":"6g","actions":["Promotes urination and drains Heart Heat through the Small Intestine."]},{"herb":"ChiShao","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, clears Liver Fire and relieves pain.","With Xiang Fu, for flank pain, abdominal pain, and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"ZhiBanXia.htm","dosage":"6g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and reduces Stagnation.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi."]},{"herb":"DaFuPi","dosage":"9g","actions":["Descends Qi, eases the Middle, promotes urination and reduces edema."]},{"herb":"QingPi","dosage":"6g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing and excessive white, viscous sputum due to Phlegm-Damp Obstruction."]},{"herb":"SangBaiPi","dosage":"9g","actions":["Drains Heat from the Lungs, stops coughing, calms wheezing, promotes urination and reduces edema."]},{"herb":"ZiSuZi","dosage":"12g","actions":["Stops cough, calms wheezing, descends Qi and dissolves Phlegm."]},{"herb":"GanCao","dosage":"6g","actions":["Resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Activates the Blood","Transforms Stasis","Regulates Qi","Transforms Phlegm"],"syndromes":["Qi and Blood Stagnation with Phlegm"],"manifestations":{"symptoms":["Mania that persists for an extended period of time","Agitation","Restlessness","Incoherent speech","Constant anger","A dark complexion","Pain and fullness of the chest and flanks","A headache","Palpitations","Severe: Climbing up to high places, singing and removing one's clothes"],"tongue":"Purple with stasis spots","tongueCoat":"White","pulse":"Thready and wiry or Thready and choppy"},"conditions":[{"condition":"Schizophrenia","name":"Schizophrenia"},{"condition":"BiPolarDisorder","name":"Bi-polar disorder "},{"condition":"BiPolarDisorder","name":"Mania-depression"},{"condition":"Depression","name":"Depression"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}