{"formula":"DieDaWan","names":{"pinyin":"die da wan","hanzi":"跌打丸","english":"trauma pill","commonEnglish":"Trauma Pill","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"30g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis, reduces swelling, expels pus, generates flesh and alleviates pain.","With Ru Xiang, Mo Yao and Zi Ran Tong, for strains and fractures.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"30g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness, and paralysis."]},{"herb":"RuXiang","dosage":"60g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, invigorates the channels, reduces swelling, generates flesh and alleviates pain.","With Mo Yao, for traumatic injury pain, blood Stasis obstructing the channels with joint pain and Wind-Cold-Damp Bi with numbness throughout the body and unresponsive extremities."]},{"herb":"MoYao","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling."]},{"herb":"XueJie","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, stops bleeding and alleviates pain.","With Ru Xiang and Mo Yao, for trauma-induced pain, swelling or hemorrhage, especially in the chest and abdomen."]},{"herb":"TuBieChong","dosage":"30g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation, disperses lumps and masses and knits together sinews and joins bones.","With Ru Xiang, Mo Yao and Zi Ran Tong, for trauma induced pain, swelling and fracture.","With Dang Gui and Chuan Xiong, for external or traumatic injuries with bruising and pain."]},{"herb":"MaHuang","dosage":"60g","actions":["Warms and disperses Cold pathogens."]},{"herb":"ZiRanTong","dosage":"30g","actions":["Dispels Blood Stasis, relieves pain and promotes healing of bones and sinews.","With Ru Xiang and Mo Yao, for for pain and swelling due to traumatic injury, especially for fractures."]}],"actions":["Invigorates the Blood","Transforms Blood Stasis","Harmonizes the Nutritive Qi","Reduces swelling","Alleviates pain"],"syndromes":["Blood Stasis due to traumatic injury"],"manifestations":{"symptoms":["Pain","Bruising","Pain with a fixed location","Swelling","Distended aches"]},"conditions":[{"condition":"TraumaticInjury","name":"Traumatic injury "},{"condition":"PainfulObstruction","name":"Painful obstruction"},{"condition":"HipIRI","name":"Hip internal rotation injuries "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula moves Wei Qi to the surface of the body."],"modifications":[]}