{"formula":"DiHuangYinZiJiaJian","names":{"pinyin":"di huang yin zi jia jian","hanzi":"地黃飲子加減","english":"modified rehmannia drink","commonEnglish":"Modified Rehmannia Drink","aka":["&#xA0;"]},"herbs":[{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, strongly enriches Yin and relieves wasting and thirsting disorder, nourishes Jing and Blood and fills the Marrow.","With Zhi Fu Zi and Rou Gui, for Kidney Yang Deficiency.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"ShanZhuYu","dosage":"12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang."]},{"herb":"RouCongRong","dosage":"12g","actions":["Tonifies the Kidneys, strengthens the Yang and benefits Jing.","With Ba Ji Tian, tonifies Yang without injuring Yin."]},{"herb":"BaJiTian","dosage":"9g","actions":["Tonifies the Kidneys, strengthens Yang, disperses Wind-Cold-Damp and strengthens the sinews and bones."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Rou Gui, for Powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees."]},{"herb":"RouGui","dosage":"3g","actions":["Warms the Kidneys, Spleen and Heart, strengthens the Yang and Ming Men Fire, d disperses deep Cold, warms and unblocks the channels and vessels and alleviates pain.","With Shu Di Huang, Shan Zhu Yu and Zhi Fu Zi, for Kidney Yang Deficiency."]},{"herb":"TuFuLing","dosage":"30g","actions":["Relieves toxicity, eliminates Dampness and clears Damp-Heat from the skin."]}],"actions":["Enriches Kidney Yin","Tonifies Kidney Yang","Clears Heat","Resolves Fire Toxicity"],"syndromes":["Toxic Heat with Kidney Yang Deficiency"],"manifestations":{"symptoms":["Latent Stage: Begins about 1 year after infection. Relapses may occur. After the second year new lesions are rare. This stage may last several years or for the remainder of the patient's life. In untreated cases, about one-third of those infected develop Late-Stage or Tertiary syphilis which may show up after many years.","Tertiary or Late-Stage: Lesions develop between 3 and 10 years after infection. The typical lesion is a rubbery, chronic, localized inflammation characterized by centralized gray-white necrosis, surrounded by granulized tissue. They increase slowly in size, heal gradually and leave scars. They may affect an organ or tissue. Often they occur in Submucosal tissue such as the: Palate Nasal septum Pharynx Larynx They lead to tissue degeneration with perforation of the palate, or septum. They occur in areas with good blood supply such as the: Leg below the knee Upper trunk Face Scalp Eyes Stomach Lungs Liver Testicles"]},"conditions":[{"condition":"Syphilis","name":"Tertiary syphilis "},{"condition":"Syphilis","name":"Latent syphilis "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}