{"formula":"DiLongTangJiaJian","names":{"pinyin":"di long tang jia jian","hanzi":"地龙汤加減","english":"modified pheretima decoction","commonEnglish":"Modified Pheretima Decoction","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"12g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Du Huo, for Wind-Dampness."]},{"herb":"DuHuo","dosage":"10g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain.","With Qiang Huo, for joint pain and numbness.","With Ma Huang, for Wind-Cold with anhidrosis, and body aches and pains."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior and warms and disperses Cold pathogens."]},{"herb":"TaoRen","dosage":"12g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"DangGui","dosage":"12g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain."]},{"herb":"DiLong","dosage":"12g","actions":["Clears Heat, unblocks and promotes movement in the channels and collaterals, extinguishes Wind and stops spasms."]},{"herb":"SuMu","dosage":"10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, reduces swellings, opens the channels and alleviates pain"]}],"actions":["Dispels Wind","Scatters Cold","Unblocks the channels"],"syndromes":["Wind-Cold-Damp Bi"],"manifestations":{"symptoms":["Head, neck, shoulder and upper back aching and pain","Fixed neck pain","Tender points on the neck","A possible palpable cord-like feeling in the neck","A stiff neck","Inhibited movement","Pain, soreness and numbness of the four limbs","Maybe weakness and heaviness of the upper limbs","Heavy-headedness","Aversion to Cold","Prefers Heat","Severe: Withering of the arm muscles Difficulty extending and flexing the fingers Maybe complete loss of sensation and rigidity of the fingers"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Floating and moderate or Floating and tight"},"conditions":[{"condition":"CervicalSpondylosis","name":"Cervical spondylosis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}