{"formula":"DingXianWan","names":{"pinyin":"ding xian wan","hanzi":"定涎丸","english":"arrest seizures pill","commonEnglish":"Arrest Seizures Pill","aka":[""]},"herbs":[{"herb":"TianMa","dosage":"6-30g","actions":["Extinguishes Wind, calms the Liver and stops spasms and tremors."]},{"herb":"ChuanBeiMu","dosage":"6-30g","actions":["Clears Heat and transforms Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"6-30g","actions":["Dries Dampness, transforms Phlegm and descends Rebellious Qi.","With Chen Pi, for a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"FuLing","dosage":"6-30g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and transforms Phlegm."]},{"herb":"FuLing","dosage":"6-30g","actions":["Quiets the Heart, calms the Spirit and soothes the nerves."]},{"herb":"DanNanXing","dosage":"3-15g","actions":["Clears Heat, dissolves Phlegm, calms Wind and stops convulsions."]},{"herb":"ShiChangPu","dosage":"3-15g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit and disperses Wind.","With Yuan Zhi and Fu Ling, for forgetfulness, tinnitus, and impaired hearing.","With Fu Shen, for forgetfulness and dulled senses."]},{"herb":"QuanXie","dosage":"3-15g","actions":["Extinguishes Wind and stops tremors and convulsions.","With Jiang Can, for Wind-Dampness."]},{"herb":"JiangCan","dosage":"3-15g","actions":["Extinguishes Wind and stops spasms and convulsions.","With Tian Ma, Quan Xie, and Dan Nan Xing, for quickly developing convulsions with generalized twitching and wheezing and convulsions with Phlegm and Fire."]},{"herb":"HuPo","dosage":"3-15g","actions":["Stops tremors and palpitations and calms the Spirit.","With Yuan Zhi, Fu Shen and Shi Chang Pu, for emotional distress, anxiety with palpitations, forgetfulness, and insomnia.","with Zhu Sha, for childhood convulsions and insomnia."]},{"herb":"DengXinCao","dosage":"3-15g","actions":["Promotes urination, leaches out Dampness, clears Heat from the Heart channel by directing Fire downward and calms the Spirit."]},{"herb":"ChenPi","dosage":"4-21g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and Descends Qi."]},{"herb":"YuanZhi","dosage":"4-21g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidney, expels Phlegm, and opens the Orifices.","With Gan cao, reduces the irritating effect of Yuan Zhi, to prevent nausea and vomiting.","With Fu Shen and Zhu Sha, for insomnia, palpitations with anxiety, nocturnal emissions and spermatorrhea."]},{"herb":"DanShen","dosage":"6-60g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"MaiMenDong","dosage":"6-60g","actions":["Clears the Heart and eliminates irritability."]},{"herb":"ZhuSha","dosage":"2-9g","actions":["Sedates the Heart, calms the Spirit, expels Phlegm and sedates jitteriness and convulsions while stopping tremors."]},{"herb":"ZhuLi","dosage":"100ml","actions":["Clears Heat, transforms Phlegm and penetrates to the channels. (Add to the decoction.)","With Jiang Zhi, for Wind-Stroke with Phlegm welling upward and Phlegm-Heat withdrawal mania."]},{"herb":"GanCao","dosage":"120g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs. (Decoct separately and add to the decoction.)"]},{"herb":"ShengJiang","dosage":"50ml","actions":["It is best for alleviating nausea, breaking up Phlegm and reducing coughing. (Add to the decoction.)"]}],"actions":["Scours out Phlegm","Opens the sensory Orifices","Clears Heat","Extinguishes Wind"],"syndromes":["Wind-Phlegm"],"manifestations":{"symptoms":["Maybe recurrent vertigo","Maybe weakness","Maybe a stifling sensation in the chest","Sudden loss of consciousness","Falling down","Opisthotonis","Spitting up of mucus with a loud, raspy sound","Semi-unconsciousness","Involuntary dripping of saliva","Deviation of the mouth","Severe cases: Tonic-clonic convulsions Sudden shrieking Incontinence of urine or stool"],"tongue":"Normal","tongueCoat":"White and greasy","pulse":"Wiry and slippery"},"conditions":[{"condition":"Epilepsy","name":"Epilepsy"},{"condition":"Epilepsy","name":"Convulsions"},{"condition":"BiPolarDisorder","name":"Mania-depression"},{"condition":"Epilepsy","name":"Seizures"},{"name":"Multi-infarct dementia "}],"contra":{"contraindications":["Do not use without modification for those with Liver Fire with Phlegm-Heat.","Do not use without modification for those with Liver and Kidney Yin Deficiency.","Do not use without modification for those with Spleen and Stomach Deficiency."],"interactions":[""]},"notes":["This condition most commonly occurs in children."],"modifications":[{"purpose":"weak patients","modifications":[{"herb":"RenShen","modification":"+ Rx. Ginseng"},{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"},{"herb":"MangXiao","modification":"+ Natrii Sulfas"}]},{"purpose":"long-term use, alternate with","modifications":[]},{"purpose":"constipation","modifications":[]},{"purpose":"continuous twitching and spasms","modifications":[{"herb":"GouTeng","modification":"+ Ram. cum Uncis Uncariae"}]},{"purpose":"stroke with numbness of the limbs or hemiplegia","modifications":[{"herb":"FuLing","modification":"- Poria Pararadicis"},{"herb":"DengXinCao","modification":"- Medulla Junci"},{"herb":"ChenPi","modification":"- Per. Citri Reticulatae"},{"herb":"SongJie","modification":"+ 6g Lignum Pini Nodi"}]}]}