{"formula":"DingGanBuShenTang","names":{"pinyin":"ding gan bu shen tang","hanzi":"定肝补腎汤","english":"fix the liver and tonify the kidneys decoction","commonEnglish":"Fix the Liver and Tonify the Kidneys Decoction","aka":[""]},"herbs":[{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat; cools, invigorates and harmonizes the Blood; clears Deficiency Fire; dispels Blood Stasis; clears Liver Fire; drains pus and reduces swelling.","With Chao Zhi Zi and Chai Hu, for Fire from constraint leading to Liver Fire or Liver Yang Rising.","With Sheng Di Huang, for a residual Warm pathogen which has injured the Yin.",""]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, eliminates irritability in the San Jiao, reduces rebellious Stomach Qi, cools the Blood, relieves toxicity, stops bleeding by astringing, reduces swelling and invigorates the Blood.","With Mu Dan Pi. resolves Qi Level Stagnation leading to Heat and Heat in the Blood, for irregular menstruation, headache, red eyes and thirst due to Liver Qi Heat from Stagnation."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi, relieves Stagnation and reduces fever."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood and nourishes Yin."]},{"herb":"HuangJing","dosage":"6-30g","actions":["Tonifies the Kidneys, strengthens Jing."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang, increases the libido and warms and unblocks the flow of Yang Qi."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"WangBuLiuXing","dosage":"4-30g","actions":["Promotes the movement of Blood, promotes lactation, invigorates the channels, reduces swelling and drains abscesses."]},{"herb":"WaLengZi","dosage":"9-30g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules"]},{"herb":"MaiYa","dosage":"100-200g","actions":["Inhibits lactation and facilitates the smooth flow of Liver Qi."]}],"actions":["Regulates the Liver","Clears Heat","Nourishes Kidney Yang","Invigorates the Blood","Inhibits lactation"],"syndromes":["Liver Qi Stagnation with Heat and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Flushed face","Red, swollen, painful eyes","Irascibility with violent angry outbursts","Dry mouth","Bitter taste in mouth","Thirst","Insomnia","Restlessness","Constipation or dry stools","Maybe rib pain","Lumbago","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Dizziness","Tinnitus","Infertility","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pink","tongueCoat":"Thin and white","pulse":"Wiry and rapid"},"conditions":[{"condition":"PolycysticOvarySyndrome","name":"Polycystic ovary syndrome with galactorrhea-amenorrhea syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}