{"formula":"DuHuoSan","names":{"pinyin":"du huo san","hanzi":"独活散","english":"angelica pubescentis powder","commonEnglish":"Angelica Pubescentis Powder","aka":[""]},"herbs":[{"herb":"DuHuo","dosage":"12g","actions":["Dispels Wind-Dampness, alleviates pain, disperses Wind-Cold-Dampness and releases the Exterior.","With Fang Feng, for numbness in the legs.","With Ma Huang, for Wind-Cold with anhidrosis and body aches and pains."]},{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior and warms and disperses Cold pathogens.","With Zhi Fu Zi, for Wind-Cold Bi."]},{"herb":"ZhiFuZi","dosage":"3g","actions":["Disperses Cold and Dampness, warms the channels and stops pain."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for a Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"ChuanNiuXi","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, expels Wind, drains Dampness, tonifies the Kidneys and Liver and strengthens the tendons and bones."]},{"herb":"DangGui","dosage":"6g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GeGen","dosage":"9g","actions":["Discharges Exterior conditions and releases the muscles, especially of the neck and upper back."]}],"actions":["Expels Wind","Dispels Cold","Ventilates the Lungs"],"syndromes":["Wind-Cold"],"manifestations":{"symptoms":["Acute lower back ache, unrelieved by changing position or stretching","The pain is often accompanied by hypertonicity and a cold sensation in the low back","Wandering pain in the back and leg","Soreness or itching of the throat","Aversion to Wind and Cold","Tight sensation and tender points in the back area","Limitation of movement","When turning from side to side the pain may radiate to the upper back and make turning difficult","Stiffness and spasm of the back muscles","Symptoms are relieved by warmth and exacerbated by Wind-Cold","Fever and chills","Shivering","Stiff neck","Occipital headache","Cough with expectoration of thin, watery or frothy white sputum","Anhidrosis","No thirst","Aversion to Wind","Blocked and / or runny nose with clear, watery nasal discharge","Sneezing","General body aches","Maybe asthma"],"tongue":"Pink","tongueCoat":"Thin, white and moist","pulse":"Floating and tight or Floating and soggy"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}