{"formula":"DuHuoCangZhuTang","names":{"pinyin":"du huo cang zhu tang","hanzi":"独活苍术汤","english":"angelica pubescentis and atractylodes decoction","commonEnglish":"Angelica Pubescentis and Atractylodes Decoction","aka":[""]},"herbs":[{"herb":"DuHuo","dosage":"3-10g","actions":["Dispels Wind-Cold-Dampness, releases the Exterior and alleviates pain.","With Fang Feng, for numbness in the legs.","With Xi Xin, for joint pain due to Wind-Cold-Dampness.","With Xi Xin and Chuan Xiong, for Shao Yin toothaches and headaches."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Expels Wind, alleviates pain, invigorates the Blood and promotes the movement of Qi.","With Xi Xin, for Shao Yin Cold headaches.","With Xi Xin and Fang Feng, for Wind-Cold headaches."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Cang Zhu, for pain due to Wind-Dampness Bi with aching joints, heavy limbs and generalized aching discomfort."]},{"herb":"XiXin","dosage":"0.5-5g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Chuan Xiong, for Wind-Cold headache, toothache and Bi pain.","With Chuan Xiong and Fang Feng, for Bi syndrome."]}],"actions":["Dispels Wind","Warms Cold","Eliminates Dampness","Invigorates the Blood"],"syndromes":["Cold Dampness in the Lower Jiao","Shao Yin Cold-Damp"],"manifestations":{"symptoms":["Chronic cold pain in the lower back and body with a heavy sensation","A preference for warmth","Pain worse in Damp weather","Pain radiating downward and to the lower limbs","Limited movement of the lower spine","Severe hardness and stiffness in the lumbar area with obvious tenderness","A cord-like, swollen sensation of the supraspinous ligament on palpation","A movable cord-like sensation at the origin of the sacro-spinal muscle","Pain and other symptoms worsen gradually","A long-lasting course of illness","A heavy sensation in the head","The lower back region feels Cold to the touch","The pain is a deep, unremitting ache","The pain may be occasionally be severe","Twisting and bending are difficult","The pain is aggravated by cold weather","Lying down provides no improvement","Stiffness which is worse on rainy days","Aversion to Cold","Cold extremities","Sciatica","Copious urination","Extreme heavy sensation in the lower back","Absence of thirst","Maybe headaches","Nausea","Loose stools","A poor appetite","Maybe general body aches","Spontaneous contracture of the limbs","Maybe a feverish sensation in the upper body","Craves hot drinks and compresses","Dizziness","Vomiting","Profuse, purulent leukorrhea with a foul odor"],"tongue":"Pale","tongueCoat":"White or Greasy and white at the root","pulse":"Deep, thready and moderate or Deep and slow or Moderate or Slippery and slow"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}