{"formula":"DuZhongWan","names":{"pinyin":"du zhong wan","hanzi":"杜仲囊","english":"eucommia pill","commonEnglish":"Eucommia Pill","aka":[""]},"herbs":[{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, tonifies Kidney Yang, strengthens the sinews and bones and aids the smooth flow of Qi and Blood.","With Gou Qi Zi, for low back pain."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"GouQiZi","dosage":"5-18g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing."]},{"herb":"GuiBan","dosage":"9-45g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys, strengthens the bones, nourishes the Blood, enriches Yin and stabilizes the Chong and Ren channels.","With Huang Bai and Zhi Mu, for afternoon fever and night sweats due to Yin Deficiency."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Damp-Heat especially from the Lower Jiao and drains Deficiency Heat.","With Zhi Mu, for Yin Deficiency fever with steaming bones and night sweats."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness,generates Fluids, clears Deficiency Fire and quenches thirst.","With Huang Bai, clears Heat and drains Fire for Yin Deficiency Fire."]},{"herb":"WuWeiZi","dosage":"3-9g","actions":["Tonifies the Kidneys, astringes Jing and tonifies Qi.","With Huang Qi, for Yang Deficiency with spontaneous sweat."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin and adjusts the Ying and Wei.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood and relieves numbness and pain."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Nourishes and replenishes Yin","Tonifies Jing","Augment Qi","Tonifies and strengthens Yang","Nourishes the Blood"],"syndromes":["Kidney Yin and Yang Deficiency"],"manifestations":{"symptoms":["Chronic lumbago: low back feels cold, weak and aching","The symptoms are improved by massage and rest","Frequent recurrences","The pain is aggravated by exertion, prolonged standing, sexual activity and fatigue","Weak, sore legs and knees","Emaciation","Weakness","Spermatorrhea","Blurred vision","Daybreak diarrhea","Weight loss","Dizziness","Nocturnal emissions"],"tongue":"Pink or Pale","tongueCoat":"White or None","pulse":"Thready and frail or Deep, slow and weak"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}