{"formula":"EJiaoSanJiaJian","names":{"pinyin":"e jiao san jia jian","hanzi":"阿膠散加減","english":"modified ass","commonEnglish":"Modified Ass-Hide Gelatin Powder","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","with E Jiao, for coughing, hematemesis, epistaxis, and uterine hemorrhage due to Heat from Deficiency."]},{"herb":"HuaShi","dosage":"15g","actions":["Promotes urination, drains Heat from the Urinary Bladder, expels Damp-Heat and stops bleeding due to Heat."]},{"herb":"CheQianZi","dosage":"12g","actions":["Promotes urination and clears Damp-Heat.","With Ze Xie, for Lin Syndrome, edema and distention."]},{"herb":"XiaoJi","dosage":"12g","actions":["Cools the Blood, stops bleeding, clears Damp-Heat and promotes urination."]},{"herb":"ZhuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness and dispels Damp-Heat.","With Ze Xie, for Edema due to Spleen Deficiency.","With Hua Shi and E Jiao, for fever, dysuria, thirst and irritability due to water and Heat Accumulation with Yin Deficiency."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination, leaches out Dampness, and settles Ministerial Fire in the Kidneys by draining Damp-Heat from the lower Jiao.","With Fu Ling and Zhu Ling, for generalized edema.","With Hua Shi and Che Qian Zi, for Damp-Heat Lin."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Ze Xie and Zhu Ling, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Che Qian Zi, for Lin syndrome, especially Milky Lin.","With Zhu Ling, for Lin Syndrome, scanty urine, edema, loose stools, vaginal discharge, jaundice, leg Qi and diarrhea."]},{"herb":"EJiao","dosage":"9g","actions":["Nourishes the Blood, stops bleeding and nourishes and moistens Yin.","With Zhu Ling and Hua Shi, for Yin and Fluid Deficiency with internal buildup of water and Heat leading to urinary dysfunction.","With Zhu Ling, Fu Ling, Hua Shi and Ze Xie, for water retention with dysuria and edema due to Heat and Yin Deficiency."]},{"herb":"BaJiTian","dosage":"9g","actions":["Tonifies the Kidneys and strengthens Yang."]}],"actions":["Nourishes Yin","Promotes urination","Eliminates Damp-Heat","Stops bleeding"],"syndromes":["Yin Deficiency due to enduring Damp-Heat"],"manifestations":{"symptoms":["Frequent short, red urination","Dizziness","Tinnitus or deafness","Poor memory","Aching, soreness or weakness of the low back","Spermatorrhea or","Premature ejaculation","Aching in the bones","Aching in the leg and heel","Dry mouth and throat","Thirst","Night sweats","Five Sole Heat","Malar flush","Low grade fever in the afternoon","Dry throat, maybe recurrent sore throat","Dry stools and/or","Constipation","Heightened libido","If Heart Fire also Flares: Insomnia Vexation Frequent dreams Palpitations","If Liver Yang also Rises: Dizziness Blurred vision"],"tongue":"Thick and reddish","tongueCoat":"Little or None or Greasy","pulse":"Thready and rapid or Slippery"},"conditions":[{"condition":"InterstitialCystitis","name":"Interstitial cystitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}