{"formula":"ErHaoXiYao","names":{"pinyin":"er hao xi yao","hanzi":"二号洗药","english":"lotion #2","commonEnglish":"Lotion #2","aka":[""]},"herbs":[{"herb":"ZhiChuanWu","dosage":"9g","actions":["Expels Wind-Dampness, disperses Cold, reduces swelling, warms and activates the channels and stops pain."]},{"herb":"ZhiCaoWu","dosage":"9g","actions":["Disperses Cold, scours out Wind, overcomes Dampness, reduces swelling and stops pain."]},{"herb":"CangZhu","dosage":"9g","actions":["Induces sweating and expels Wind-Dampness."]},{"herb":"DuHuo","dosage":"9g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain."]},{"herb":"FangFeng","dosage":"9g","actions":["Expels Wind-Dampness and alleviates pain.","With Cang Zhu, for Wind-Cold-Dampness with chills, anhidrosis, headache, heavy head, lethargy, heavy limbs and stifling fullness in the chest and abdomen."]},{"herb":"AiYe","dosage":"9g","actions":["Disperses Cold, alleviates pain, eliminates Dampness and stops itching."]},{"herb":"ChuanJiao","dosage":"9g","actions":["Warms the Middle Jiao, disperses Cold, dispels Dampness and alleviates pain."]},{"herb":"LiuJiNu","dosage":"9g","actions":["Dispels Blood Stasis and alleviates pain."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"TouGuCao","dosage":"9g","actions":["Invigorates Blood circulation, breaks up Blood Stasis, reduces swelling, generates flesh, clears Heat, eliminates toxins, cools the Blood, relieves pain, dispels Wind and Dampness and relaxes the muscles and sinews."]},{"herb":"ShenJinCao","dosage":"9g","actions":["Dispels Wind, eliminates Dampness, relaxes the sinews, invigorates the collaterals and invigorates the Blood."]}],"actions":["Expels pathogenic Cold from the Channels","Invigorates the Blood","Unblocks the Channels"],"syndromes":["Wind-Cold"],"manifestations":{"symptoms":["The case relapses or grows more severe when it is Cold","The case becomes mild or cures itself when it is warm","Dark purple maculae","The skin temperature is lower toward the end of the limbs","The fingers and toes may be swollen","Aversion to Cold","Cold extremities","Abdominal pain","Loose stools"],"tongue":"Normal","tongueCoat":"Thin and white","pulse":"Slow and soft"},"conditions":[{"condition":"Erythema","name":"Erythema multiforme"},{"name":"Dermatosclerosis"},{"condition":"Erythema","name":"Erythema nodosum"},{"name":"Erysipelas anaphase"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into coarse granules, decoct and bathe the diseased area twice a day for 20 minutes each time.."],"modifications":[]}