{"formula":"ErLongZuoCiWan","names":{"pinyin":"er long zuo ci wan","hanzi":"耳聋左慈片","english":"pill for deafness that is kind to the left (kidney)","commonEnglish":"Pill for Deafness that is Kind to the Left (Kidney)","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"20-25g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Shan Yan and Ze Xie, for Ascendant Fire due to exhaustion of Kidney Yin."]},{"herb":"ShanZhuYu","dosage":"10-15g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Wu Wei Zi, for spermatorrhea, abnormal sweating, palpitations and shortness of breath due to Yin and Yang Deficiency of the Liver and Kidneys.","With Shu Di Huang, Shan Yao, Ze Xie, Fu Ling and Mu Dan Pi, for Kidney and Liver Yin Deficiency."]},{"herb":"ShanYao","dosage":"10-15g","actions":["Tonifies Kidney Yin and astringes Jing.","With Shu Di Huang and Shan Zhu Yu, for urinary frequency (day or night), dizziness, tinnitus and lower back pain due to Kidney Deficiency."]},{"herb":"FuLing","dosage":"9-12g","actions":["Strengthens the Spleen and harmonizes the Middle Jiao Promotes urination and leaches out Dampness.","With Zi Xie, facilitates the removal of water and leaches out Dampness."]},{"herb":"MuDanPi","dosage":"6-9g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood and clears Deficiency and Liver Fire.","With Ze Xie, Fu Ling and Shan Zhu Yu, for spermatorrhea due to Kidney Yin Deficiency with Heat."]},{"herb":"ZeXie","dosage":"9-12g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Mu Dan Pi, for steaming bone disorder, dizziness, and vertigo."]},{"herb":"CiShi","dosage":"1-3g","actions":["Benefits Yin, nourishes the Kidneys, augments the Liver, improves hearing and vision and calms the Spirit."]},{"herb":"ShiChangPu","dosage":"6-9g","actions":["Transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi, promotes Blood flow and reduces swelling."]},{"herb":"JiuJIeChangPu","dosage":"(6-9g)","actions":["(Transforms Phlegm, opens the orifices, calms the Shen and awakens the Spleen. Substitutes for Shi Chang Pu.)"]},{"herb":"WuWeiZi","dosage":"6-9g","actions":["Tonifies the Kidneys, astringes Jing and stops diarrhea and spermatorrhea.","With Shu Di Huang, Shan Yao and Shan Zhu Yu, for Lung and Kidney Deficiency with cough and wheezing."]}],"actions":["Nourishes Kidney and Liver Yin","Benefits the Ears","Clears Deficiency Heat","Calms the Liver","Subdues Liver Yang"],"syndromes":["Hearing difficulty due to Kidney and Liver Yin Deficiency with Yang Rising"],"manifestations":{"symptoms":["Tinnitus","Continuous cicada-like tinnitus that is worse at night","Deafness","Vertigo","Dizziness","Irritability","Insomnia","Blurred vision","Red eyes","Dry mouth and throat"],"tongue":"Red","tongueCoat":"Little or none","pulse":"Thready and rapid"},"conditions":[{"condition":"Tinnitus","name":"Tinnitus"},{"condition":"Deafness","name":"Deafness"},{"condition":"Diabetes","name":"Diabetes"},{"condition":"Hypertension","name":"Hypertension"},{"condition":"Vertigo","name":"Meniere's disease"},{"condition":"Dizziness","name":"Dizziness"},{"condition":"Vertigo","name":"Vertigo"},{"name":"Chronic labrynthitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula is widely used for hearing loss due to old age."],"modifications":[{"purpose":"tinnitus and deafness","modifications":[]},{"purpose":"tinnitus and deafness with Liver Yin Deficiency","modifications":[{"herb":"ChaiHu","modification":"+ 9g Rx. Bupleuri"},{"herb":"GouQiZi","modification":"+ 9g Fr. Lycii"},{"herb":"NuZhenZi","modification":"+ 9g Fr. Ligustri Lucidi"},{"herb":"MoHanLian(Cao)","modification":"+ 9g Hb. Ecliptae"}]}]}