{"formula":"ErZeTang","names":{"pinyin":"er zi tang","hanzi":"二泽汤","english":"two ponds decoction","commonEnglish":"Two Ponds Decoction","aka":[""]},"herbs":[{"herb":"TuFuLing","dosage":"30g","actions":["Relieves toxicity, eliminates Dampness, benefits the joints and dispels Heat from the Lower Jiao.","With Yi Yi Ren, for joint pain due to Damp-Heat toxin.","with Bi Xie, for joint pain and turbid urine due to Damp-Heat toxin."]},{"herb":"YiYiRen","dosage":"30g","actions":["Strengthens the Spleen, resolves Dampness, expels Wind-Dampness, relieves pain and clears Damp-Heat."]},{"herb":"WeiLingXian","dosage":"30g","actions":["Dispels Wind-Dampness, unblocks the channels, regulates urination and alleviates pain."]},{"herb":"BeiXie","dosage":"20g","actions":["Resolves turbid Dampness in the Lower Jiao, expels Wind-Dampness, relaxes the sinews and unblocks the Luo channels.","With Wei Ling Xian, for Wind-Damp Bi."]},{"herb":"CheQianZi","dosage":"12g","actions":["Promotes urination and clears Damp-Heat.","With Ze Xie, for Lin Syndrome, edema and distention."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination, leaches out Dampness and drains Damp-Heat from the lower Jiao."]},{"herb":"ZeLan","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, Promotes urination and disperses swellings."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood and stops pain due to Blood Stasis."]}],"actions":["Eliminates Dampness","Discharges turbidity","Invigorates the Blood","Transforms Stasis"],"syndromes":["Turbid Dampness Pouring Downward with Blood Stasis"],"manifestations":{"symptoms":["Severe, acute joint aching and pain","The pain is fixed in location","The pain is marked by pronounced swelling and distention of the affected joints"]},"conditions":[{"condition":"Gout","name":"Gout"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}