{"formula":"FeiAiErHaoFang","names":{"pinyin":"fei ai er hao fang","hanzi":"肺癌二号方","english":"lung cancer formula #2","commonEnglish":"Lung Cancer Formula #2","aka":[""]},"herbs":[{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Yin, moistens the Lungs, dispels Phlegm and stops coughing."]},{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Lung Yin and clears Lung Heat.","With Sheng Di Huang and Mai Men Dong, for a dry, parched throat and thirst after a warm pathogen disease injuring Stomach Yin."]},{"herb":"TianMenDong","dosage":"9g","actions":["Nourishes Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, generates Fluids, resolves Phlegm and inhibits the growth of cancer cells.","With Bai Hua She She Cao, for fibrocystic breast disorders and breast cancer."]},{"herb":"MaiMenDong","dosage":"9g","actions":["Moistens the Lungs, nourishes Yin and stops coughing.","With Tian Men Dong, for Lung and Kidney Yin Deficiency with consumptive coughing and occasional hemoptysis.","With Bei Sha Shen and Nan Sha Shen, for a dry cough with little Phlegm and a parched throat due to Lung Dryness or Heat injuring the Lung Yin.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"HuangQin","dosage":"9g","actions":["Drains Fire, detoxifies, cools the Blood, stops bleeding and inhibits the growth of cancer cells.","With Bai Mao Gen and Sheng Di Huang, for Excess Internal Heat causing reckless Blood."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, descends Q and helps prevent stagnation from tonic herbs."]},{"herb":"BaiHe","dosage":"15g","actions":["Nourishes Yin, moistens the Lungs, clears Heat, stops coughing and inhibits the growth of cancer cells."]},{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Mai Men Dong, Bei Sha Shen and Nan Sha Shen, for a dry mouth, thirst, dry lips and a red tongue due to Stomach Yin Deficiency.",""]},{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat, resolves Fire toxicity and inhibits the growth of cancer cells."]},{"herb":"YiYiRen","dosage":"15g","actions":["Strengthens the Spleen, resolves Dampness and inhibits the growth of cancer cells."]},{"herb":"BaiMaoGen","dosage":"30g","actions":["Cools the Blood, stops bleeding, clears Heat from the Stomach and Lungs and inhibits the growth of cancer cells.","With Sheng Di Huang, for Heat injuring the Yin with a prolonged low grade fever."]},{"herb":"BaiHuaSheSheCao","dosage":"30g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses and inhibits the growth of cancer cells."]},{"herb":"YuXingCao","dosage":"30","actions":["Clears Heat, relieves toxicity, reduces swellings and abscesses, expels pus (acts especially on the Lungs) and inhibits the growth of cancer cells."]},{"herb":"TaoRen","dosage":"15g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses."]},{"herb":"SiGuaLuo","dosage":"15g","actions":["Resolves toxicity, reduces swelling, unblocks the channels and collaterals in the breast and expels Phlegm."]}],"actions":["Nourishes Lung Yin","Clears Heat","Resolves toxicity","Invigorates the Blood","Inhibits the growth of cancer cells"],"syndromes":["Lung Yin Deficiency"],"manifestations":{"symptoms":["Severe, dry hacking cough","No sputum expectorated","Small amounts of difficult to expectorate sputum","Blood tinged sputum (when Yin Deficiency Fire is present)","Shortness of breath","Stuffy chest","Thirst","Heartburn","Afternoon fever","Night sweats","Malar flush (especially in the afternoon)","Five Sole Heat","Malar flush","Dry mouth and throat","Itching in throat","Hoarse voice, low voice or loss of voice","Emaciation"],"tongue":"Red and dry","tongueCoat":"None","pulse":"Thready and rapid"},"conditions":[{"condition":"LungCancer","name":"Lung cancer"},{"condition":"BreastCancer","name":"Breast cancer with Lung metastasis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}