{"formula":"FengShiFangYiHao","names":{"pinyin":"feng shi fang yi hao","hanzi":"风湿方一号","english":"wind","commonEnglish":"Wind-Damp Formula #1","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"6-12g","actions":["Clears Heat and resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao.","With Mu Dan Pi and Sheng Di Huang, for Ying Stage and Xue Stage Heat."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"TuFuLing","dosage":"15-60g","actions":["Relieves toxicity, eliminates Dampness, benefits the joints and dispels Heat from the Lower Jiao."]},{"herb":"BaiWei","dosage":"3-12g","actions":["Cools the Blood, clears Deficiency Heat and promotes urination."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for a residual warm pathogen which has injured the Yin."]},{"herb":"ShiHu","dosage":"6-20g","actions":["Nourishes Yin, clears Heat, generates fluids, enriches Kidney Yin and reduces Heat from Deficiency."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels, alleviates pain and regulates urination.","With Qiang Huo, for Wind-Damp Bi causing joint pain, especially in the upper joints.","With Niu Xi, for Wind-Damp Bi causing joint pain, especially in the lower joints."]},{"herb":"QingHao","dosage":"3-12g","actions":["Clears Summerheat or Damp-Heat, and clears Deficiency fevers."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels, soothes the sinews and collaterals, clears Deficiency Heat and resolves Dampness."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones, benefits the joints and clears Damp-Heat in the Lower Jiao.","With Sheng Di Huang, powerfully clears Deficiency Fire Blazing Upward with pain and swelling of the gums, epistaxis, hematemesis and other hemorrhage in the upper body."]},{"herb":"SangZhi","dosage":"9-15g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, benefits the joints, stops spasms, promotes diuresis and reduces edema."]}],"actions":["Resolves Dampness","Clears Heat","Disperses Wind","Stops pain"],"syndromes":["Wind-Damp Heat"],"manifestations":{"symptoms":["Generalized body aches and pains","Joint swelling, pain and heaviness","Restricted movement","Irritability","Heavy sensation in the shoulder and back","Discomfort or a constricted sensation in the area of the chest and diaphragm","Redness of the affected joints","Affected joints are burning hot to the touch","symptoms are better with cold","Multiple sores, carbuncles furuncles or abscesses","Itching","Persistent swelling","Chest pain","Maybe vomiting","Fever","Sweating","Aversion to Wind","Thirst, may not have a desire to drink","Aching and painful extremities","Unbearable swelling and pain of the lower extremities","Shoulder stiffness","Short, reddish urination"],"tongue":"Normal or Red","tongueCoat":"Greasy and slightly yellow","pulse":"Wiry and rapid or Soft and moderate or Soft, superficial and slow or Slippery and rapid or Deep and tight"},"conditions":[{"condition":"RheumatoidArthritis","name":"Rheumatoid arthritis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}