{"formula":"FengShiHanTang","names":{"pinyin":"feng shi han tang","hanzi":"风势寒湯","english":"wind","commonEnglish":"Wind-Cold Excess Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, promotes urination, reduces edema and relieves numbness and pain.","With Zhi Fu Zi, for Yang Deficiency with spontaneous sweat.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesias.","With Han Fang Ji, for Wind edema with numbness, pain, swelling of the face and extremities, sweating, sensitivity to Wind, and reduced urination."]},{"herb":"LuRong","dosage":"3-5g","actions":["Tonifies the Kidneys, strengthens Yang, tonifies the DU Channel, strengthens Jing and Blood, strengthens the sinews and bones and benefits the marrow.","With Dang Gui and Huang Qi, for severely deficient Jing and Blood."]},{"herb":"GouQiZi","dosage":"5-18g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing."]},{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, and stops pain due to Blood Stasis."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood."]},{"herb":"HongHua","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness and cools the Blood."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Rou Gui and Dang Gui, for musculoskeletal pain caused by accumulation of Wind and Dampness."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain and assists the generation of Qi and Blood.","With Zhi Fu Zi, for Damp-Cold Bi in the channels with generalized aches and pains and difficulty in rotating the trunk."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Disperses Cold and Dampness, warms the channels and stops pain."]},{"herb":"HanFangJi","dosage":"3-12g","actions":["Expels Wind-Dampness and alleviates pain.","With Huang Qi, for Wind-Dampness with exterior Deficiency."]},{"herb":"YiYiRen","dosage":"9-30g","actions":["Expels Wind-Dampness and relieves pain."]}],"actions":["Tonifies Qi","Nourishes Jing","Nourishes the Blood","Clears Heat","Clears toxins","Relieves pain","Invigorates the Blood","Warms Yang","Expels Wind","Dispels Dampness"],"syndromes":["Bi Syndrome"],"manifestations":{"symptoms":["Recalcitrant to treatment","Joint swelling and pain","Swelling is hard","Pain is excruciating","Limbs are numb"],"tongue":"Normal or Purple spots","tongueCoat":"White or White and greasy","pulse":"Thin and choppy or Soggy and even"},"conditions":[{"condition":"Osteoarthritis","name":"Advanced cases of arthritis "},{"condition":"Arthralgia","name":"Arthralgia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}