{"formula":"FenXiaoTang","names":{"pinyin":"fen xiao tang","hanzi":"分消汤","english":"separate and reduce decoction","commonEnglish":"Separate and Reduce Decoction","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"3g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao.","With Hou Po, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat.","With Hou Po and Chen Pi, for epigastric fullness, fatigue and discomfort, anorexia, vomiting and/or diarrhea with a turbid, greasy tongue coat due to Dampness Obstructing the Middle Jiao.","With Xiang Fu, for chest, epigastric and abdominal pain, distention and discomfort due to Dampness and Qi Obstruction."]},{"herb":"BaiZhu","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Zhi Shi, for Spleen Deficiency with Qi Stagnation with anorexia, epigastric focal distention and fullness.","With Zhu Ling and Ze Xie, for edema due to Internal Dampness.","With Fu Ling, Zhu Ling and Ze Xie, for edema with Spleen Deficiency."]},{"herb":"FuLing","dosage":"3g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Ze Xie and Zhu Ling, strengthens its ability to promote urination and leach out Dampness.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"ChenPi","dosage":"3g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Zhi Shi and Mu Xiang, for abdominal distention, fullness and pain.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drink."]},{"herb":"HouPo","dosage":"3g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, dries Dampness, transforms Phlegm and descends Rebellious Qi.","With Zhi Shi, for abdominal or chest distention, focal epigastric distention, wheezing, shortness of breath, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem.","With Zhi Shi and Bai Zhu, for epigastric and abdominal distention due to Qi and Food Stagnation.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi.",""]},{"herb":"XiangFu","dosage":"2.4g","actions":["Spreads and regulates Liver Qi.","With Sha Ren and Mu Xiang, for ulcer and digestive disturbance."]},{"herb":"ZhuLing","dosage":"2.4g","actions":["Promotes urination and leaches out","Dampness","With Fu Ling, promotes urination.","With Ze Xie, drains Damp, unblocks and drains urinary pathways and drains Heat from the Bladder."]},{"herb":"ZeXie","dosage":"2.4g","actions":["Promotes urination and leaches out Dampness.","With Sha Ren, for Scanty urine, abdominal distention and urinary discomfort.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness.","With Fu Ling and Zhu Ling, for generalized edema."]},{"herb":"ZhiShi","dosage":"3g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels and removes Stagnant Food.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"DaFuPi","dosage":"2.4g","actions":["Descends Qi, eases the Middle, promotes urination and reduces edema.","With Hou Po and Chen Pi, for epigastric and abdominal distention and discomfort with difficult bowel movements associated with stagnant Qi and Dampness.","With Bai Zhu, strengthens the Spleen, assists transportation, dredges clogged Stagnation, facilitates the removal of pathogenic water and Dampness, and reduces edema for treatment of Spleen Qi Deficiency with Dampness Obstruction."]},{"herb":"ShaRen","dosage":"2.1g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen and stops vomiting.","With Mu Xiang and Zhi Shi, for Qi Stagnation due to Food Stagnation.","With Hou Po, for constrained Dampness with Qi Stagnation leading to distention and fullness in the epigastrium and abdomen.","With Chen Pi, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea.","With Zhi Shi and Bai Zhu, for Spleen and Stomach Qi Stagnation with indigestion."]},{"herb":"MuXiang","dosage":"0.5g","actions":["Promotes the movement of Qi, alleviates pain, strengthens the Spleen and prevents Stagnation.","With Bai Zhu, for anorexia with epigastric and abdominal pain and distention.","With Sha Ren, for distention, epigastric and abdominal pain, anorexia, nausea, vomiting, diarrhea, dysentery, or tenesmus due to Qi Obstruction and/or Food Stagnation.",""]},{"herb":"DengXinCao","dosage":"3g","actions":["Promotes urination, leaches out Dampness."]},{"herb":"ShengJiang","dosage":"3g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei and normalizes the flow of Qi at the center.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]}],"actions":["Promotes urination","Promotes the movement of Qi","Guides out Stagnation","Strengthens the Spleen"],"syndromes":["Spleen Deficiency Edema with Qi Stagnation"],"manifestations":{"symptoms":["Abdominal fullness","Drum-like distention","Firm local distention in the epigastrium","Pitting edema","Ascites","Scanty urination","Anorexia","Decreased food intake","Acid regurgitation","A feeling of fullness, oppression and distention in the chest","Constipation"]},"conditions":[{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Edema","name":"Pitting edema"},{"condition":"Ascites","name":"Ascites"},{"condition":"Oliguria","name":"Scanty urination"},{"condition":"Constipation","name":"Constipation"},{"condition":"CirrhosisOfTheLiver","name":"Cirrhosis of the Liverascites"},{"condition":"AcidReflux","name":"Acid regurgitation"},{"name":"Belching"},{"condition":"Anorxia","name":"Anorexia"},{"condition":"Nephritis","name":"Nephritis"},{"name":"Peritonitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"increased respiration","modifications":[{"herb":"ChenXiang","modification":"+ Lignum Aquilariae"}]},{"purpose":"swelling and fullness in the abdomen due to Food Stagnation","modifications":[{"herb":"LaiFuZi","modification":"+ Sm. Raphani"}]},{"purpose":"a bitter taste in the mouth and hypochondriac fullness and distention","modifications":[]}]}