{"formula":"FuKeZhongZiWan","names":{"pinyin":"fu ke zhong zi wan","hanzi":"婦科種子丸","english":"women's seed planting pills","commonEnglish":"Women's Seed Planting Pills","aka":["Gynecology Seed Pill","Fertile Fields Tea Pills","Pills for Menstrual Disorders and Sterility"]},"herbs":[{"herb":"ShuDiHuang","dosage":"24g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Dang Gui, E Jiao and Ai Ye, for excessive uterine bleeding."]},{"herb":"DuZhong","dosage":"12g","actions":["Tonifies the Kidneys and Liver, tonifies Kidney Yang, aids the smooth flow of Qi and Blood and calms the fetus.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels and treats restless fetus or bleeding during pregnancy accompanied by lower back pain and a sense of dropping in the lower trunk.","With Xu Duan, Dang Gui, Bai Shao, E Jiao and Ai Ye, for continuous bleeding after miscarriage."]},{"herb":"XiangFu","dosage":"12g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"ChuanXiong","dosage":"12g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain,","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys, stops uterine bleeding, calms the fetus, prevents miscarriage, promotes the movement of Blood and alleviates pain.","With Ai Ye, for excessive uterine bleeding with abdominal pain."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Chuan Xiong, Shu Di Huang and Bai Shao, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"AiYe","dosage":"9g","actions":["Warms the channels, warms the womb, stops bleeding, calms the fetus, disperses Cold and alleviates pain.","With E Jiao, for heavy, painful periods due to Cold obstruction, prolonged uterine bleeding and menorrhagia, bleeding during pregnancy or postpartum bleeding and restless fetus and threatened miscarriage with cold abdominal pain."]},{"herb":"EJiao","dosage":"6g","actions":["Tonifies and nourishes the Blood, stops bleeding and nourishes and moistens Yin.","With Bai Shao and Ai Ye, for excessive menstrual bleeding.","With Dang Gui, Bai Shao, and Shu Di Huang, for anemia."]},{"herb":"HuangQin","dosage":"6g","actions":["Clears Heat, dries Dampness, cools the Blood, stops bleeding, calms the fetus and calms ascending Liver Yang."]},{"herb":"BaiShao","dosage":"6g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, calms Liver Yang and Liver Wind, softens the Liver and relieves pain.","With Huang Qin, cools Heat and nourishes the Blood for calming the fetus which is disturbed by Heat and treats Liver Heat Attacking the Spleen and Stomach during pregnancy with nausea and vomiting.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]}],"actions":["Reinforces the Kidney and Liver","Supports Yang","Eliminates Cold","Warms the uterus to help conception","Regulates menstruation","Nourishes the Blood","Invigorate the Blood","Relieves cramps associated with the menstrual cycle"],"syndromes":["Deficiency Cold of the Uterus","Deficiency of Qi and Blood with Retention of Cold pathogen in the Uterus","Cold Stagnation with Blood Stasis","Blood Deficiency and Qi Stagnation with Cold in the Uterus"],"manifestations":{"symptoms":["Thin and profuse leukorrhea","Sallow complexion or","Dark and gloomy complexion","Pain of lower limbs","Lassitude","Lack of vitality","Weakness","Irregular circulation of channels","Failure to conceive for a long time","Intolerance of Cold","Cold limbs","Soreness of waist","Pain in the lower back","Long-term or heavy menstrual bleeding","Painful menstruation which gets increasing worse","Pelvic pain during intercourse","Fullness and stuffiness in the hypochondriac region","Dizziness","Tinnitus","Shortness of breath","Difficult speech","Delayed menstrual cycle","Abdominal pain during menstruation","Abdominal Cold pain which can be relieved by warmth","Scanty menstruation","Dark in color","Blood masses or","Amenorrhea","Distending pain in the lower abdomen prior to or during menstruation which can be relieved by warmth"],"tongue":"Pale","tongueCoat":"White or White and greasy fur","pulse":"Weak or Deep and tense pulse or Thready and weak or Deep and slow"},"conditions":[{"condition":"Gonorrhea","name":"Gonorrhea"},{"condition":"VaginalDischarge","name":"Leukorrhea"},{"condition":"AbdominalPain","name":"Abdominal pain during menstruation "},{"name":"Adenomyosis"},{"condition":"Amenorrhea","name":"Amenorrhea"},{"condition":"FetalRestlessness","name":"Fetal Restlessness"},{"condition":"Infertility","name":"Infertility"},{"condition":"LateMenstruation","name":"Delayed menstrual cycle"},{"condition":"ScantyMenstruation","name":"Scanty menstruation"},{"condition":"Dysmenorrhea","name":"Dysmenorrhea"},{"condition":"AbdominalCold","name":"Abdominal Cold"},{"condition":"VaginalBleedingDuringPregnancy","name":"Bleeding during pregnancy"}],"contra":{"contraindications":["Contraindicated during pregnancy.","Do not use long term or in excess of recommended amounts.","Do not use for those with diarrhea, indigestion, headaches, or excessive menstrual bleeding.","Use with caution for those with abdominal distention."],"interactions":[""]},"notes":[""],"modifications":[]}