{"formula":"FuLingTang","names":{"pinyin":"fu ling tang","hanzi":"茯苓汤","english":"poria decoction","commonEnglish":"Poria Decoction","aka":[""]},"herbs":[{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Ze Xie and Zhu Ling, strengthens its ability to promote urination and leach out Dampness.","With Gui Zhi, Bai Zhi and Ze Xie, for Dampness Obstruction causing Lin Syndrome, edema, heaviness of the body, and irritability.","With Zhu Ling, promotes urination."]},{"herb":"ZhuLing","dosage":"5-18g","actions":["Promotes urination and leaches out Dampness.","With Ze Xie, drains Damp, unblocks and drains urinary pathways and drains Heat from the Bladder."]},{"herb":"ZeXie","dosage":"4.5-16g","actions":["Promotes urination and leaches out Dampness.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen and augments Qi Dries Dampness and promotes water metabolism.","With Fu Ling and Yi Yi Ren, for Spleen and Stomach Deficiency with Dampness.","With Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema.","With Zhu Ling and Ze Xie, for edema due to Internal Dampness.","With Fu Ling, Zhu Ling, Ze Xie and Gui Zhi, for edema with Spleen Yang Deficiency."]},{"herb":"YiYiRen","dosage":"9-30g","actions":["Strengthens the Spleen and resolves Dampness.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels, warms the Middle and directs Turbid Yin downward.","With Fu Ling, warms and transforms fluids, unblocks Yang and promotes urination.","With Fu Ling and Bai Zhu, for Heart and Spleen Yang Deficiency with palpitations, edema and shortness of breath."]},{"herb":"HuaShi","dosage":"9-18g","actions":["Promotes urination and drains Heat from the Urinary Bladder.","With Fu Ling and Yi Yi Ren, for Damp-Heat diarrhea."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi and alleviates pain."]},{"herb":"HeZi","dosage":"3-10g","actions":["Contains leakage of Lung Qi, stops coughing, improves the condition of the throat, descends Lung Qi and relieves Qi Stagnation in the diaphragm and chest."]},{"herb":"WuWeiZi","dosage":"3-9g","actions":["Astringes the leakage of Lung Qi and stops coughing."]}],"actions":["Strengthens the Spleen","Resolves Dampness","Promotes urination","Reduces edema"],"syndromes":["Water Accumulation"],"manifestations":{"symptoms":["Edema","Generalized swelling","Heaviness or sluggishness of the body","Fatigue","Hypersomnia"]},"conditions":[{"condition":"Edema","name":"Edema"},{"condition":"Fatigue","name":"Fatigue"},{"name":"Hypersomnia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}