{"formula":"FuLingGuiZhiGanCaoDaZaoTang","names":{"pinyin":"fu ling gui zhi gan cao da zao tang","hanzi":"茯苓桂枝甘草大枣汤","english":"poria, cinnamon twig, licorice and jujube decoction","commonEnglish":"Poria, Cinnamon Twig, Licorice and Jujube Decoction","aka":["Cinnamon Twig, Licorice, Jujube and Hoelen Combination."]},"herbs":[{"herb":"FuLing","dosage":"250g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Gui Zhi, warms and transforms fluids, un-blocks Yang and promotes urination.","With Zhi Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations, and shortness of breath."]},{"herb":"GuiZhi","dosage":"120g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang and warms and facilitates the flow of Yang Qi in the chest.","With Fu Ling, for palpitations and dyspnea due to Heart Yang Deficiency."]},{"herb":"GanCao","dosage":"60g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"DaZao","dosage":"15pcs","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Strengthens the Spleen and Stomach to control water circulation"],"syndromes":["Spleen and Stomach Deficiency with Heart Yang Deficiency"],"manifestations":{"symptoms":["Running piglet","Ascending sensation of gas from the umbilicus to the chest and throat","Heart palpitations","Diarrhea","Anorexia"],"tongue":"Normal","tongueCoat":"Slippery and white","pulse":"Wiry"},"conditions":[{"condition":"Palpitations","name":"Palpitations"},{"name":"Palpitations below the umbilicus "},{"condition":"Anorxia","name":"Anorexia"},{"name":"Distention below the Heart"},{"name":" Gas"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}