{"formula":"FuLingGanCaoTang","names":{"pinyin":"fu ling gan cao tang","hanzi":"茯苓甘草汤","english":"poria and licorice decoction","commonEnglish":"Poria and Licorice Decoction","aka":[""]},"herbs":[{"herb":"FuLing","dosage":"6g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Gui Zhi, warms and transforms fluids, un-blocks Yang and promotes urination.","With Zhi Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations, and shortness of breath."]},{"herb":"GuiZhi","dosage":"6g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang and warms and facilitates the flow of Yang Qi in the chest.","With Fu Ling, for palpitations and dyspnea due to Heart Yang Deficiency."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ShengJiang","dosage":"9g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting, adjusts the Ying and Wei, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis and warms and dispels thin mucus in the Stomach with nausea, hiccup, Stomach pain, acid reflux or vomiting of clear fluid."]}],"actions":["Warms Yang","Transforms thin mucus","Unblocks Yang","Disperses pathogenic water","Harmonizes the Middle Jiao"],"syndromes":["Pathogenic water lodged in the epigastrium in patients with Spleen and Stomach Deficiency"],"manifestations":{"symptoms":["Epigastric palpitations","Cold extremities","No thirst","Fainting"],"tongue":"Normal","tongueCoat":"Slippery and white","pulse":"Wiry"},"conditions":[{"condition":"Palpitations","name":"Palpitations due to inappropriate sweating"},{"condition":"Oliguria","name":"Oliguria"},{"name":"Digestive disorders"},{"name":"Perspiration without thirst "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}