{"formula":"FuLingTangJiaJian","names":{"pinyin":"fu ling tang jia jian","hanzi":"茯苓汤加減","english":"modified poria decoction","commonEnglish":"Modified Poria Decoction","aka":[""]},"herbs":[{"herb":"FuLing","dosage":"3g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao, quiets the Heart, calms the Spirit and soothes the nerves.","With Zhu Ling, promotes urination.","With Zhi Ban Xia, Chen Pi and Jiang Zhi, for congested fluids in the Stomach causing nausea and vomiting.","With Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations, and shortness of breath."]},{"herb":"ZhiBanXia.htm","dosage":"3g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, stops vomiting and reduces Stagnation.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"ChenPi","dosage":"3g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Zhi Ban Xia, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi and a productive cough and a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, stops coughing, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"XiangFu","dosage":"3g","actions":["Spreads and regulates Liver Qi."]},{"herb":"YiZhiRen","dosage":"3g","actions":["Warms the Kidneys, astringes Jing and urine, warms the Spleen, increases the appetite and","stops diarrhea and salivation."]},{"herb":"RenShen","dosage":"3g","actions":["Tonifies Spleen, Stomach and Lung Qi, tonifies Heart Qi and calms the Spirit."]},{"herb":"WuMei","dosage":"1g","actions":["Astringes leakage of Lung Qi, stops leakage of sweat and stops coughs."]},{"herb":"ZhuLing","dosage":"2g","actions":["Promotes urination and leaches out Dampness."]},{"herb":"ShengJiang","dosage":"2g","actions":["Warms the Middle, stops vomiting, warms the Lungs, stops coughing and breaks up Phlegm.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold and a productive cough due to Phlegm-Dampness.","Whit Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccups."]}],"actions":["Promotes urination","Strengthens the Spleen","Harmonizes the Middle Jiao","Quiets the Heart","Calms the Spirit","Soothes the nerves","Warms the Kidneys","Astringes Jing and urine","Warms the Spleen and Lungs"],"syndromes":["Phlegm-Damp"],"manifestations":{"symptoms":["Dizziness","Vertigo","Mental cloudiness","Heavy head","Heavy sensation in the body","Cough with Excess sputum","Chest and epigastric distention","Suffocating sensation in the chest and epigastrium","Nausea","Profuse sputum","Vomiting","Anorexia","Fatigue","Borborygmus","Tinnitus","Mouth glutinous","No thirst","Likes to sleep","Maybe palpitations"],"tongue":"Thick","tongueCoat":"White and greasy or Sticky and white"},"conditions":[{"condition":"Forgetfulness","name":"Forgetfulness"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}