{"formula":"FuRenBuYinPian","names":{"pinyin":"fu ren bu yin pian","commonEnglish":"","aka":[""]},"herbs":[{"herb":"HeHuanPi","dosage":"12g","actions":["Calms the Spirit, relieves constraint, invigorates and harmonizes the Blood, stops pain, regulates Qi, dissipates swellings and reduces abscesses.","With Bai Shao, for anxiety, irritability, worry and insomnia."]},{"herb":"JiXueTeng","dosage":"12g","actions":["Invigorates and tonifies the Blood, invigorates the channels and relaxes the sinews.","With Dang Gui, Chuan Xiong and Bai Shao, for menstrual disorders."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"DanShen","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"NuZhenZi","dosage":"9g","actions":["Nourishes and tonifies Liver and Kidney Yin and clears Deficiency Heat."]},{"herb":"TuSiZi","dosage":"9g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine and benefits the marrow Tonifies the Kidneys and Liver"]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, stops uterine bleeding, promotes the movement of Blood and alleviates pain."]},{"herb":"BaiShao","dosage":"7g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"FuLing","dosage":"7g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao."]},{"herb":"ChiShao","dosage":"7g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat, cools the Blood and relieves pain.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation."]},{"herb":"ChuanXiong","dosage":"5g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]},{"herb":"HongHua","dosage":"5g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis."]}],"actions":["Invigorates the Blood","Removes Stasis","Nourishes Yin","Strengthens Yang"],"syndromes":["Yin and Yang Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Failure to conceive",""]},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula is used for mid-cycle support."],"modifications":[]}