{"formula":"FuZiNanXingYuJinTang","names":{"pinyin":"fu zi nan xing yu jin tang","hanzi":"附子南星郁金湯","english":"aconite, arisaema and curcuma decoction","commonEnglish":"Aconite, Arisaema and Curcuma Decoction","aka":[""]},"herbs":[{"herb":"ShanZhuYu","dosage":"12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and &#xA0;strengthens Kidney Yang.","With Huang Qi and Dang Shen, for spontaneous sweating due to Yang or Qi Deficiency."]},{"herb":"YuJin","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears Heat, cools the Blood, clears the Heart and Pericardium, opens the Orifices and alleviates pain.","With Zhi Ke, for Liver Qi Stagnation with a stifling sensation in the chest and fullness in the epigastrium and abdomen with Heat signs and stabbing pain in the chest, flanks and abdomen due to Blood Stagnation."]},{"herb":"ChuanXiong","dosage":"12g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"ChiShao","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood and relieves pain.","With Tao Ren, for Blood Stasis.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"TaoRen","dosage":"12g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"ZhiKe(Qiao)","dosage":"9g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"DanNanXing","dosage":"9g","actions":["Clears Heat, dissolves Phlegm, calms Wind and stops convulsions."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"RouGui","dosage":"6g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and Deficiency of Ming Men Fire with impotence or infertility.","With Yu Jin and Chuan Xiong, for hypochondriac pain due to Liver Qi Stagnation."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Bai Zhu, for Spleen Yang Deficiency with a Cold, painful abdomen, vomiting and watery diarrhea.","With Huang Qi, for Spontaneous sweat and chills due to Yang Deficiency."]}],"actions":["Warms the Kidneys","Tonifies the Spleen","Dispels Phlegm","Activates the Blood","Transforms Stasis"],"syndromes":["Spleen and Kidney Yang Deficiency with Phlegm-Stagnation"],"manifestations":{"symptoms":["Slow movement","A torpid, dull affect","Relatively scanty speech","Severe: aphasia","Difficulty thinking","Chaotic speech","Decreased memory","Numbness of the limbs","Loss of mental and physical sharpness and coordination"],"tongue":"Pale and dark maybe with Stasis maculae","tongueCoat":"White and slimy","pulse":"Slippery or Thready and choppy"},"conditions":[{"condition":"Alzheimer'sDisease","name":"Alzheimer's disease"},{"condition":"Forgetfulness","name":"Forgetfulness"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"dizziness and tinnitus","modifications":[{"herb":"SangJiSheng","modification":"+ 12g Hb. Taxilli"},{"herb":"GouQiZi","modification":"+ 9g Fr. Lycii"},{"herb":"TianMa","modification":"+ 9g Rz. Gastrodiae"}]}]}