{"formula":"GanAiQuanXieSan","names":{"pinyin":"gan ai quan xie san","hanzi":"肝癌全蝎散","english":"powder of scorpio for treating hepatic carcinoma","commonEnglish":"Powder of Scorpio for Treating Hepatic Carcinoma","aka":[""]},"herbs":[{"herb":"QuanXie","dosage":"10g","actions":["Attacks and relieves Fire toxins, dissipates nodules and rashes and inhibits the growth of cancer cells.","With Wu Gong, for toxic, swollen sores and scrofula."]},{"herb":"WuGong","dosage":"10g","actions":["Attacks and relieves Fire toxins, relieves abdominal masses,d dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"ShuiZhi","dosage":"10g","actions":["Breaks up and drives out Blood Stasis, reduces fixed masses and inhibits the growth of cancer cells."]},{"herb":"JiangCan","dosage":"10g","actions":["Transforms Phlegm, softens hardness, eliminates toxins and dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"QiangLang(Chong)","dosage":"10g","actions":["Relieves constipation, attacks toxins and disperses Blood Stagnation."]},{"herb":"GeJie","dosage":"10g","actions":["Tonifies Jing and Blood, controls and stabilizes Kidney Qi and stabilizes Ming Men Fire and inhibits the growth of cancer cells."]},{"herb":"WuLingZhi","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis,","alleviates pain, transforms Stasis, stops bleeding and eliminates toxins."]}],"actions":["Softens hard masses","Invigorates the Blood","Removes Blood Stasis","Clears Heat","Removes toxicity","Inhibits the growth of cancer cells"],"syndromes":["Liver Qi and Blood Stagnation"],"manifestations":{"symptoms":["Facial color dark and dull","Emaciation","Sides and ribs distended on both sides","Staggering pain in the right hypochondrium or bot hypochondria","Enlargement of the Liver and Spleen","A palpable, hard mass below the hypochondrium","Suffocating sensation in chest","Spider naevi or vascular nevus on the neck, face or chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Abdominal fullness and rigidity","A dim, lusterless complexion","Engorgement and varicose veins of the abdominal wall","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses"],"tongue":"Dark purple (maybe purple spots on edge of tongue)","pulse":"Wiry, choppy and slow or Wiry thready and choppy"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a fine powder. Take 3g twice daily.","Long time use does not damage Liver Qi."],"modifications":[]}