{"formula":"GanAiHuaYuHuoXieZhuYuTongSan","names":{"pinyin":"gan ai hua yu huo xie zhu tong san","hanzi":"肝癌化郁和絜住痛散","english":"powder for treating hepatic carcinoma, resolving stagnant liver qi, promoting blood circulation and arresting pain","commonEnglish":"Powder for Treating Hepatic Carcinoma, Resolving Stagnant Liver Qi, Promoting Blood Circulation and Arresting Pain","aka":[""]},"herbs":[{"herb":"SanLeng","dosage":"30g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With Yan Hu Suo, for pain due to Blood Stasis."]},{"herb":"EZhu","dosage":"30g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain and distention with hepatosplenomegaly, pain with immobile, palpable epigastric, sub costal and abdominal masses and abdominal distention, fullness and pain."]},{"herb":"DaiZheShi","dosage":"30g","actions":["Calms the Liver, anchors Floating Yang and clears Liver Fire."]},{"herb":"YanHuSuo","dosage":"30g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"SuMu","dosage":"30g","actions":["Invigorates Blood circulation, dispels Blood Stasis, reduces swellings, opens the channels and alleviates pain.","With E Zhu, strongly promotes the movement of Qi and Blood, breaks up Blood Stagnation and stops pain for abdominal pain from Qi Stagnation and Blood Stasis."]},{"herb":"WaLengZi","dosage":"30g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules.","With San Leng and E Zhu, for fixed abdominal masses."]},{"herb":"HongHua","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation, alleviates pain and inhibits the growth of cancer cells.","With San Leng and E Zhu, for abdominal masses and accumulations.","With Su Mu, promotes the movement of Blood and unblocks menstruation."]},{"herb":"XiangFu","dosage":"30g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"MuXiang","dosage":"30g","actions":["Promotes the movement of Qi and alleviates pain.","With Sha Ren, for distention, epigastric and abdominal pain, anorexia, nausea, vomiting, diarrhea, dysentery or tenesmus due to Qi Obstruction and/or Food Stagnation."]},{"herb":"ShaRen","dosage":"30g","actions":["Promotes the movement of Qi, aromatically transforms Dampness and warms the Middle.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen."]},{"herb":"MuTong","dosage":"30g","actions":["Promotes urination and unblocks painful urinary dysfunction."]},{"herb":"ShuiZhi","dosage":"30g","actions":["Breaks up and drives out Blood Stasis and reduces fixed masses.","With Da Huang, regulates Yin and Yang to quickly attack and break up Blood Stasis."]},{"herb":"DaHuang","dosage":"30g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis, eliminates Phlegm and inhibits the growth of cancer cells."]},{"herb":"DanShen","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood, reduces abscesses and inhibits the growth of cancer cells."]},{"herb":"ChuanLianZi","dosage":"30g","actions":["Dredges Liver Qi, releases Stagnation and stops pain.","With Yan Hu Suo, for intermittent epigastric and hypochondriac pain, hernia pain or menstrual pain with irritability due to Liver Stagnation with Heat.","With Yan Hu Suo an Xiang Fu, for hypochondriac and abdominal pain.","With Mu Xiang and Xiang Fu, for bloating.",""]}],"actions":["Invigorates the blood","Breaks up Stasis","Moves Qi","Resolves Phlegm","Inhibits the growth of cancer cells"],"syndromes":["Qi, Blood and Phlegm Stagnation"],"manifestations":{"symptoms":["Immobile masses below the hypochondrium or in the abdomen","Abdominal pain","Emaciation","Poor appetite","Alternating chills and fever","Amenorrhea","Hard abdominal masses that produce pain","Aggravated by pressure","Hypochondriac distention"],"tongue":"Purple with echymoses","pulse":"Choppy"},"conditions":[{"condition":"LiverCancer","name":"Nodular Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the above ingredients into a fine powder. Take 3-5g three times a day."],"modifications":[]}