{"formula":"GanAiTang","names":{"pinyin":"gan ai tang","hanzi":"肝癌汤","english":"liver cancer decoction","commonEnglish":"Liver Cancer Decoction","aka":[""]},"herbs":[{"herb":"BaYueZha","dosage":"30g","actions":["Dredges the Liver, regulates Qi, controls pain, expels Phlegm, disperses clumps, invigorates the Blood, removes toxins and inhibits the growth of cancer cells."]},{"herb":"MuDanPi","dosage":"30g","actions":["Clears Heat, cools invigorates and harmonizes the Blood, dispels Blood Stasis, clears Liver Fire, drains pus and reduces swelling."]},{"herb":"LingZhi","dosage":"30g","actions":["Tonifies Qi and nourishes Blood."]},{"herb":"BanZhiLian","dosage":"30g","actions":["Clears Heat, resolves Fire toxins, invigorates the Blood, reduces swellings, treats various types of cancer, promotes urination, reduces edema, mildly dispels Blood Stasis and stops bleeding.","With Bai Hua She She Cao and Ba Yue Zha, for cancers of the digestive tract."]},{"herb":"DongChongXiaCao","dosage":"3g","actions":["Tonifies the Kidneys, strengthens Yang, augments Jing and inhibits the growth of cancer cells."]},{"herb":"WangBuLiuXing","dosage":"9g","actions":["Promotes the movement of Blood, promotes lactation, invigorates the channels, reduces swelling and drains abscesses."]},{"herb":"WaLengZi","dosage":"9g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness, dissipates nodules, alleviates pain and inhibits the growth of cancer cells."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and inhibits the growth of cancer cells."]},{"herb":"BaiHuaSheSheCao","dosage":"9g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses, promotes urination and inhibits the growth of cancer cells.","With Ban Zhi Lian, for cancer."]},{"herb":"YanHuSuo","dosage":"30g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"ChuanLianZi","dosage":"30g","actions":["Dredges Liver Qi, releases Stagnation, stops pain and conducts Heat out from below.","With Yan Hu Suo, for intermittent epigastric and hypochondriac pain, hernia pain or menstrual pain with irritability due to Liver Stagnation with Heat."]},{"herb":"HuangShuiQie","dosage":"30g","actions":["Anchors Liver Yang, eliminates toxins, reduces inflammation, relieves pain, removes Heat, eliminates Dampness, disperses Stagnation and inhibits the growth of cancer cells."]}],"actions":["Dredges the Liver","Regulates Qi","Controls pain","Expels Phlegm","Disperses clumps","Invigorates the Blood","Removes toxins","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat with Qi, Blood and Phlegm Stagnation"],"manifestations":{"symptoms":["Tumor develops quickly","Fluid inside the breast with a lump inside it","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia","Noxious swellings","Abscesses","Flat abscesses","Red face","Chest pain","Ulceration of the tumor","Maybe a bloody secretion","Foul odor","Short urine"],"tongue":"Red or Reddish purple","tongueCoat":"White or Yellow and greasy or Thick, sticky, dry and yellow","pulse":"Wiry and rapid or Rolling and rapid or Wiry, overflowing and rapid or Flooding"},"conditions":[{"condition":"BreastCancer","name":"Chemo support for breast cancer with Liver metastasis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}