{"formula":"GanMaoDan","names":{"pinyin":"gan mao dan","hanzi":"感冒丹","english":"common cold pill","commonEnglish":"Common Cold Pill","aka":[""]},"herbs":[{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, Clears Liver Fire, relieves eye pain and reduces swelling from sores and abscesses."]},{"herb":"DanDouChi","dosage":"6-18g","actions":["Releases the Exterior.","With Zhi Zi, for Exterior Heat as it first enters the interior and insomnia and irritability due to Wind-Heat.","With Bo He, Lian Qiao and Jin Yin Hua,, for Wind-Heat."]},{"herb":"BaiMaoGen","dosage":"9-30g","actions":["Cools the Blood, stops bleeding and clears Heat from the Stomach and Lungs.","With Lu Gen, for warm febrile disease with thirst and irritability."]},{"herb":"LuGen","dosage":"15-30g","actions":["Clears Heat and irritability from the Lungs and Stomach and generates fluids.","With Zhi Zi, for Irritability."]},{"herb":"SangYe","dosage":"4.5-15g","actions":["Disperses and scatters Wind-Heat, calms the Liver and clears the eyes."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, eliminates irritability reduces swelling and activates the Blood."]},{"herb":"JinYinHua","dosage":"6-12g","actions":["Vents and disperses External Wind-Heat, clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","With Lian Qiao, Jing Jie and Bo He, for External Wind-Heat.","With Jin Yin Hua, for Initial stage Wind-Heat."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity and clears Blood Heat.","With"]},{"herb":"JingJie","dosage":"3-10g","actions":["Releases the Exterior, expels Wind and relieves itching.","With Bo He, releases the Exterior to induce sweating, disperses Wind in the head and alleviates itching."]},{"herb":"ZiWan","dosage":"3-10g","actions":["Relieves coughs and expels Phlegm.","With Jie Geng and Jing Jie, for productive cough in the aftermath of an Externally-contracted disease."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi."]},{"herb":"BoHe","dosage":"1.5-30g","actions":["Disperses Wind-Heat and cools and clears the head and eyes and benefits the throat.","With Jing Jie, Lian Qiao and Jin Yin Hua, for Wind-Heat."]}],"actions":["Releases the Exterior","Disperses Wind-Heat"],"syndromes":["Wind-Heat"],"manifestations":{"symptoms":["Cough","Fever","Headache","Nasal congestion","Slight chills","Sore throat","Swelling of the throat"],"tongue":"Red","tongueCoat":"White or Yellow","pulse":"Floating and rapid"},"conditions":[{"condition":"Conjunctivitis","name":"Conjunctivitis"},{"condition":"OtitisMedia","name":"Otitis media "},{"condition":"AcutePharyngitis","name":"Pharyngitis"},{"condition":"Rhinitis","name":"Rhinitis"},{"name":"Measles with Heat rash"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}