{"formula":"GaoTieFa","names":{"pinyin":"gao tie fa","hanzi":"膏贴沷","english":"cleansing paste (topical)","commonEnglish":"","aka":[""]},"herbs":[{"herb":"MuXiang","dosage":"10g","actions":["Promotes the movement of Qi, dispels Damp-Heat and alleviates pain."]},{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat and cools the Blood."]},{"herb":"SongXiang","dosage":"10g","actions":["Dries Dampness, dispels Wind, discharges pus, removes toxins, generates flesh and alleviates pain."]},{"herb":"XueJie","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, stops bleeding, protects the surface of ulcers, prevents decay, generates flesh and alleviates pain.","With Mo Yao and Ru Xiang, for pain, swelling or hemorrhage.","With Er Cha, Mo Yao and Ru Xiang, for bruising, swelling and pain.","With Ming Fan, stops bleeding without causing Stasis for sores that have perforated but fail to heal."]},{"herb":"RuXiang","dosage":"10g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling, generates flesh and alleviates pain."]},{"herb":"MoYao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, reduces swelling, generates flesh and promotes healing.","With Ru Xiang, topically for skin lesions and ulcerations swollen, painful sores and sores that are hard but not painful."]},{"herb":"ErCha","dosage":"10g","actions":["Drains Dampness and absorbs suppuration Stops bleeding and generates flesh.","With Xue Jie, Ru Xiang and Mo Yao, topically as a powder for non-healing oozing sores."]},{"herb":"MingFan","dosage":"10g","actions":["Purges Fire, relieves toxicity, dries Dampness, alleviates itching, restrains and inhibits sores, generates flesh and transforms putrefication.","With Xiong Huang, topically for Wind-Damp-Heat toxin in the muscles and skin with severe itching that results in a yellow exudate after scratching.","With Er Cha, topically for bleeding from trauma."]},{"herb":"XiongHuang","dosage":"0.6g","actions":["Relieves toxicity, dries Dampness, expels Phlegm and inhibits the growth of cancer cells.","With Ming Fan, for Wind-Damp sores and sores with redness, swelling, itching and pain."]}],"actions":["Purges Fire","Relieves toxicity","Dries Dampness","Moves Qi","Invigorates the Blood","Stops bleeding","Discharges pus","Generates flesh"],"syndromes":["Topically for Toxic Heat with Blood Stagnation"],"manifestations":{"symptoms":["Tumor develops quickly","Fluid inside the breast with a lump inside it","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia"],"tongue":"Red","tongueCoat":"White or Yellow and greasy or Thick, sticky, dry and yellow","pulse":"Wiry or Rolling and rapid or Wiry, overflowing and rapid"},"conditions":[{"condition":"BreastCancer","name":"Huge, infected mammary carcinoma "},{"condition":"BreastCancer","name":"Breast cancer "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}