{"formula":"GongNeiShengZhangChiHuanWan","names":{"pinyin":"gong nei sheng zhang chi huan wan","hanzi":"宫内生长迟丸","english":"intra","commonEnglish":"Intra-Uterine Growth Retardation Pills","aka":[""]},"herbs":[{"herb":"DaHuang","dosage":"180g","actions":["Invigorates the Blood, dispels Blood Stasis, drains Heat, purges accumulations, cools the Blood, reduces Fire toxicity and inhibits the growth of cancer cells.","With Mang Xiao, for abscesses, swellings and toxic sores.","With Sheng Di Huang, for Deficiency Fire."]},{"herb":"HuangQin","dosage":"150g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood, stops bleeding and inhibits the growth of cancer cells.","With Da Huang, for constipation."]},{"herb":"GanCao","dosage":"210g","actions":["Clears Heat, relieves Fire toxicity, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"TaoRen","dosage":"360g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines, unblocks the bowels and drains abscesses.","With Xing Ren, for Blood Stasis with pain in the chest, abdomen or throughout the body."]},{"herb":"XingRen","dosage":"360g","actions":["Moistens the Intestines, unblocks bowels and inhibits the growth of cancer cells."]},{"herb":"ShengDiHuang","dosage":"600g","actions":["Clears Heat, cools the Blood and nourishes Yin."]},{"herb":"GanQi","dosage":"60g","actions":["Breaks up Blood Stasis, opens the channels and purges hardness.","With Da Huang, Shui Zhi and Tao Ren, for amenorrhea due to Blood Stasis."]},{"herb":"MengChong","dosage":"70g","actions":["Breaks up Blood Stasis, reduces abdominal masses, unblocks the Blood vessels, stops pain and treats uterine fibroids.","With Shui Zhi, resolves severe Blood Stasis with mania and abdominal masses or severe Blood accumulation following trauma.","With Shui Zhi and Da Huang, for amenorrhea from Blood Stasis.","With Shui Zhi, Sheng Di Huang and Tao Ren, for irregular menstruation."]},{"herb":"MangXiao","dosage":"300g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat and reduces swelling.","With Da Huang and Gan Cao, for moderate constipation due to accumulation of Excess Heat."]},{"herb":"ShuiZhi","dosage":"70g","actions":["Breaks up and drives out Blood Stasis, reduces fixed masses and inhibits the growth of cancer cells.","With Tao Ren and Meng Chong, for abdominal pain and hardness with black tarry stools.","With Tao Ren, Meng Chong and Da Huang, for Blood Stasis in the lower abdomen with amenorrhea and masses.","With Mang Xiao and Da Huang, for fever, delirium, abdominal distention, urinary incontinence and, in severe cases, a dull dusky-yellow discoloration of the skin from Blood Stasis due to Invasion of Heat."]}],"actions":["Invigorates the Blood","Dispels Blood Stasis","Drains Heat","Reduces Fire toxicity","Cools the Blood","Stops bleeding","Purges accumulation","Softens hardness","Inhibits the growth of cancer cells"],"syndromes":["Blood Stagnation with Toxic Heat"],"manifestations":{"symptoms":["Acute lower abdominal pain","Incontinence of urine","Night fevers","Delirious speech","Irritability","Restlessness","Thirst","May be mania (severe)","Dysmenorrhea","Amenorrhea","Hard stool","Dark red complexion","Headache","Vertigo","Tinnitus","Insomnia","Palpitations","Constipation","Frequent urination","Emotional instability","Chills in the waist and feet","Tremors","Excruciating abdominal pain with cold","Black stool","May be chills and fever","Hemoptysis","Hematuria","Red eyes","Pain and distention of the head","Toothache","Irregular menstruation","Lochioschesis","Severe wheezing","Distention of the chest"],"tongue":"Red and dry","tongueCoat":"Yellow","pulse":"Deep and forceful or Choppy"},"conditions":[{"condition":"UterineMyoma","name":"Uterine myoma "},{"condition":"Amenorrhea","name":"Amenorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a powder and roll into pills with honey. Take 9g 3 times a day."],"modifications":[]}