{"formula":"GouTengXiFengYin","names":{"pinyin":"gou teng xi feng yin","hanzi":"钩藤熄風飲","english":"uncaria extinguish wind decoction","commonEnglish":"Uncaria Extinguish Wind Decoction","aka":[""]},"herbs":[{"herb":"GouTeng","dosage":"6-16g","actions":["Extinguishes Wind, alleviates spasms, drains Liver Heat and pacifies Liver Yang.","With Tian Ma, calms the Liver and extinguishes Wind.","With Quan Xie, for seizures, convulsions spasms, tics, hemiplegia due to Wind-Stroke, numbness and pain in the limbs, and stubborn migraines or trigeminal neuralgia from Liver Wind or Liver Yang Rising.","With Tian Ma and Quan Xie, for convulsions due to Liver Wind.","With Tian Ma and Ling Yang Jiao, for seizures associated with high fever.","With Tian Ma, Ling Yang Jiao and Quan Xie, for high fevers with convulsions or muscular tetany.","With Tian Ma, Ling Yang Jiao, Ren Shen and Quan Xie, for high fevers with convulsions or muscular tetany with concurrent Qi Deficiency"]},{"herb":"LingYangJiao","dosage":"1-5g","actions":["Drains Liver Heat, calms the Liver, extinguishes Wind, controls spasms and convulsions, calms the Liver, anchors Yang, drains Heat, clears Fire toxicity and improves vision."]},{"herb":"QuanXie","dosage":"2-5g","actions":["Extinguishes Wind and stops tremors and convulsions.","With Tian Ma, Ling Yang Jiao and Gou Teng , for febrile convulsions in children."]},{"herb":"TianMa","dosage":"3-10g","actions":["Extinguishes Wind, calms the Liver, stops spasms and tremors, subdues Rising Liver Yang and alleviates pain."]},{"herb":"RenShen","dosage":"1-9g","actions":["Tonifies Qi and calms the Spirit."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, relieves palpitations and anxiety."]}],"actions":["Clears Heat","Detoxifies","Pacifies the Liver","Subdues Wind"],"syndromes":["Liver Wind Stirring Internally: Liver Fire (Yang) Generates Wind"],"manifestations":{"symptoms":["Commonly seen in children","Both eyes affected","Deviation of the eyes and mouth","enlarged pupils","Anxiety","Rigidity","Dizziness and vertigo to the point of falling over","Headache with a drawing sensation","Numbness and tremor of limbs","Twitching and involuntary writhing of hands and feet","Dysphasia","Unsteady gait","With Wind-Stroke: Sudden loss of consciousness Tongue stiffness with aphasia Facial paralysis Hemiplegia","Maybe coma","Sometimes death"],"tongue":"Red","tongueCoat":"Little","pulse":"Strong and wiry"},"conditions":[{"condition":"OpticAtrophy","name":"Optic atrophy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}