{"formula":"GuaLouSan","names":{"pinyin":"gua lou san","hanzi":"栝楼散","english":"trichosanthis powder","commonEnglish":"Trichosanthis Powder","aka":[""]},"herbs":[{"herb":"GuaLou","dosage":"30g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi, reduces abscesses, dissipates nodules and eliminates pus.","With Ru Xiang, invigorates Qi and Blood to disperse swellings and clumps early-stage breast abscess with accumulation, Stagnation, distention and pain.","With Mo Yao and Ru Xiang, for Lung abscess marked by irritability, stifling sensation in the chest and coughing up of pus and Blood."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"RuXiang","dosage":"10g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling, generates flesh and alleviates pain.","With Mo Yao, for chronic, ulcerated and non-healing sores."]},{"herb":"MoYao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling, generates flesh, promotes healing and alleviates pain.","With Ru Xiang, for swollen, painful sores and sores that are hard but not painful."]},{"herb":"MuLi","dosage":"30g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"XiangFu","dosage":"10g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]}],"actions":["Spreads and regulates Liver Qi","Transforms Phlegm","Dissipates nodules","Invigorates the Blood","Breaks up Stasis","Alleviates pain","Inhibits the growth of cancer cells"],"syndromes":["Liver Qi Stagnation with Phlegm"],"manifestations":{"symptoms":["Anxiety","Easily angered","Breast full and painful","Dry mouth","Dry pharynx","Dizziness"],"tongue":"Dark","tongueCoat":"Whit or Light yellow","pulse":"Wiry"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"condition":"PuerperalFever","name":"Puerperal fever"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}