{"formula":"GuaLouBeiMuXieFeiTang","names":{"pinyin":"gua lou bei mu xie fei tang","hanzi":"栝楼贝母渫肺湯","english":"decoction of trichosanthis fruit and fritillary bulb for purging lung fire","commonEnglish":"Decoction of Trichosanthis Fruit and Fritillary Bulb for Purging Lung Fire","aka":[""]},"herbs":[{"herb":"GuaLou","dosage":"15g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi, unbinds the chest, reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"ChuanBeiMu","dosage":"9g","actions":["Clears Heat, transforms Phlegm, stops coughing, nourishes and moistens the Lungs, dissipates nodules and inhibits the growth of cancer cells.","With Xing Ren, for coughing and wheezing with copious sputum, wheezing and coughing from externally contracted Lung disorders, non-productive coughing from Lung Deficiency disorders and coughing of thick, yellow sputum due to Phlegm-Fire."]},{"herb":"RouCongRong","dosage":"12g","actions":["Tonifies the Kidneys, strengthens Yang and","benefits Jing and marrow."]},{"herb":"DaiZheShi","dosage":"30g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire, strongly descends rebellious Qi, cools the Blood and stops bleeding."]},{"herb":"XingRen","dosage":"3g","actions":["Stops coughing and calms wheezing and inhibits the growth of cancer cells.","With Mai Men Dong, for a dry cough due to Dryness and Heat injuring the Lungs."]},{"herb":"ShuiZhi","dosage":"10g","actions":["Breaks up and drives out Blood Stasis, reduces fixed masses and inhibits the growth of cancer cells.","With Hai Zao, for palpable, fixed masses of the throat as in esophageal carcinoma."]},{"herb":"SiGuaLuo","dosage":"15g","actions":["Resolves toxicity, reduces swelling, unblocks the channels and collaterals in the breast, dispels Wind and expels Phlegm."]},{"herb":"YuJin","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores, alleviates pain, clears Heat and cools the Blood.","With Zhi Ke, for stabbing pain in the chest, flanks and abdomen due to Blood Stagnation."]},{"herb":"MaiMenDong","dosage":"12g","actions":["Moistens the Lungs, nourishes Yin, stops coughing, clears the Heart and eliminates irritability.","With Nan Sha Shen, for a dry cough with little Phlegm and a parched throat due to Lung Dryness or Heat injuring the Lung Yin."]},{"herb":"HaiZao","dosage":"12g","actions":["Reduces Phlegm, softens areas of hardness and inhibits the growth of cancer cells.",""]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, relieves the diaphragm, dries Dampness, transforms Phlegm, descends Qi and treats Phlegm-Damp coughs.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"TingLiZi","dosage":"15g","actions":["Drains the Lungs, reduces Phlegm and calms wheezing."]},{"herb":"DaZao","dosage":"20g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit, moderates and harmonizes the harsh properties of other herbs and inhibits the growth of cancer cells.","With Ting Li Zi, for coughing, wheezing and chest fullness due to Phlegm accumulation."]},{"herb":"LuGen","dosage":"30g","actions":["Clears Heat and irritability from the Lungs and Stomach and generates fluids."]},{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and inhibits the growth of cancer cells."]},{"herb":"XuanShen","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, transforms Phlegm-Heat, softens hardness, dissipates nodules, drains Fire and relieves toxicity."]},{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Yin, moistens the Lungs, dispels Phlegm and stops coughing."]},{"herb":"SheTui(Pi)","dosage":"3g","actions":["Resolves toxins and inhibits the growth of cancer cells."]},{"herb":"QingPi","dosage":"6g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm."]},{"herb":"ZhiKe(Qiao)","dosage":"10g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings.","With Jie Geng, for regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"JieGeng","dosage":"9g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm and pus, benefits the throat and opens and raises Lung Qi, directing the effects of other herbs to the upper body."]},{"herb":"XieBai","dosage":"15g","actions":["Unblocks Yang Qi, disperses turbid Phlegm, alleviates pain, disperses hardenings, descends Qi, reduces Stagnation and inhibits the growth of cancer cells.","With Gua Lou, for chest Bi with profuse Phlegm."]}],"actions":["Clears Lung Heat","Transforms Phlegm","Dissipates nodules","Stops coughing","Inhibits the growth of cancer cells"],"syndromes":["Lung Heat"],"manifestations":{"symptoms":["High fever","No chills","Aversion to Heat","Cough","Asthma","Restlessness","Thirst","Dark yellow urine","Dyspnea","Chest pain","Shortness of breath","Thick yellow Phlegm"],"tongue":"Red","tongueCoat":"Thick and yellow, maybe dry and sticky","pulse":"Rapid, maybe slippery, maybe forceful"},"conditions":[{"condition":"LungCancer","name":"Lung cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe fever","modifications":[{"herb":"ShiGao","modification":"+ 30g Gypsum Fibrosum"},{"herb":"HuangQin","modification":"+ 15g Rx. Scutellariae"}]},{"purpose":"hemoptysis","modifications":[{"herb":"HuaRuiShi","modification":"+ Ophicalcitum"}]}]}