{"formula":"GuaShiTang","names":{"pinyin":"gua shi tang","hanzi":"栝石汤","english":"trichosanthis and dendrobium decoction","commonEnglish":"Trichosanthis and Dendrobium Decoction","aka":[""]},"herbs":[{"herb":"GuaLou","dosage":"9-30g","actions":["Clears Lung Heat, transforms Hot Phlegm and regulates Qi."]},{"herb":"ShiHu","dosage":"6-20g","actions":["Nourishes the Yin, clears Heat, generates fluids, enriches Kidney Yin, reduces Heat from Deficiency and augments Jing.","With Sheng Di Huang and Xuan Shen, for low grade fever, thirst, blurred vision and muscular aches and pains from injured fluids due to Heat, as in late stage febrile disease."]},{"herb":"XuanShen","dosage":"7-30g","actions":["Clears Heat, cools the Blood and nourishes Yin.","With Sheng Di Huang, for Kidney Yin Deficiency with Fire Blazing.","With Sheng Di Huang and Mai Men Dong, for constipation due to Dryness and sore, dry throat due to Deficiency Fire."]},{"herb":"MaiMenDong","dosage":"6-15g","actions":["Moistens the Lungs, nourishes the Yin, nourishes Stomach Yin and generates fluids.","With Sheng Di Huang and Xuan Shen, for thirst, constipation, irritability and low-grade fever due to Stomach Yin Deficiency."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat cools the Blood, nourishes Yin and generates fluids.","With Niu Xi, powerfully clears Deficiency Fire Blazing Upward."]},{"herb":"QuMai","dosage":"4-15g","actions":["Drains Damp-Heat from the Urinary Bladder, breaks up Blood Stasis, invigorates Blood circulation and regulate menstruation."]},{"herb":"CheQianZi","dosage":"4-15g","actions":["Promotes urination, clears Damp-Heat and clears Liver Heat.","With Niu Xi, for Kidney Deficiency edema."]},{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis,","regulates menstruation, reduces masses,promotes urination and reduces swelling and edema."]},{"herb":"MaWeiLian","dosage":"2-15g","actions":["Clears Heat and dries Dampness and removes toxicity."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes the Liver and Kidney Yin, descends Blood and Fire and clears Damp-Heat in the Lower Jiao."]}],"actions":["Nourishes Yin","Clears Heat","Generates fluids","Cools the Blood","Drains Damp-Heat","Invigorates the Blood","Breaks up Blood Stasis"],"syndromes":["Yin and Blood Deficiency"],"manifestations":{"symptoms":["Scanty menstruation which slowly becomes smaller and disappears","Soreness of the lower back","Abdominal pain","Emaciation","Achy and uncomfortable flesh and bones of the hands and feet","Anxiety","Dizziness","Light headedness","Tidal fever","General disquietude","Gradually worsening afternoon fevers"],"tongue":"Red","tongueCoat":"Scanty","pulse":"Thready and rapid"},"conditions":[{"condition":"Amenorrhea","name":"Amenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}