{"formula":"GuBenHuaXueTangIHao","names":{"pinyin":"gu ben hua xue tang yi hao","hanzi":"股本化血汤一号","english":"stabilize the root and transform the blood #1","commonEnglish":"Stabilize the Root and Transform the Blood Decoction #1","aka":[""]},"herbs":[{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation such as dysmenorrhea, amenorrhea, swollen painful sores and chest and abdominal pain."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver, calms Liver Yang and Liver Wind and alleviates pain."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"DangShen","dosage":"6-15g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Huang Qi, for Lung and Spleen Qi Deficiencies with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, Strengthens the Spleen and generates Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing.","With Dang Shen, for Spleen and Kidney Deficiencies with fatigue, weakness, anorexia, and watery stools and Lung and Spleen Deficiencies with cough with thin watery sputum, anorexia fatigue, and weight loss."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies Kidneys and strengthens Yang.","With Shan Yao, enhances its functions."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin and tonifies the Kidneys and Liver."]}],"actions":["Invigorates the Blood","Tonifies Yang","Nourishes Yin"],"syndromes":["Yin and Yang Deficiencies with Blood Stagnation","Blood Deficiency with Blood Stagnation","Blood and Yin Deficiencies with Blood Stagnation"],"manifestations":{"symptoms":["Palpitations","Shortness of breath","Excessive perspiration (daytime)","Above symptoms worse after exertion or when tired","Cold limbs","Maybe chills","Cyanosis","Suffocating sensation in chest","Depression","Facial pallor","Easily startled","Insomnia","Much dreaming","Stabbing pain in the anterior region over Heart","Suffocating sensation in chest","Poor memory","Low grade fever","Maybe drawing pain down internal aspect of arm (especially left arm)","Pain (in chest and/or arm) tends to be severe and intermittent","Night sweats","Five sole heat","Restlessness","Dry mouth","Thirst","Dry throat","Malar flush"],"tongue":"Pale and swollen or Red and dry or Dark red with purple spots or Purple body","tongueCoat":"White or Little or None","pulse":"Thready and weak or Knotted or Intermittent or Thready and rapid or Minute (scarcely perceptible) and thready"},"conditions":[{"condition":"CorPulmonare","name":"Cor Pulmonare"},{"condition":"Palpitations","name":"Palpitations"},{"condition":"CoronaryHeartDisease","name":"Coronary Heart disease "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}