{"formula":"GuiFuDuJinZanYuDan","names":{"pinyin":"gui fu du jin zan yu dan","hanzi":"桂附杜金赞育丹","english":"cinnamon, aconite, eucommia and rose hip special pill to aid infertility","commonEnglish":"Cinnamon, Aconite, Eucommia and Rose Hip Special Pill to Aid Infertility","aka":[""]},"herbs":[{"herb":"RouGui","dosage":"60g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms and unblocks the channels and vessels and alleviates pain.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and deficiency of Ming Men Fire with impotence or infertility.","With Zhi Fu Zi, Shan Zhu Yu and Shu Di Huang, for Kidney Yang Deficiency."]},{"herb":"ZhiFuZi","dosage":"60g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Rou Gui and Shu Di Huang, for Kidney Yang Deficiency with waning of Ming Men Fire with aversion to Cold, weak and sore back and legs, impotence and urinary frequency.","With Bai Zhu, for Spleen Yang Deficiency."]},{"herb":"DuZhong","dosage":"125g","actions":["Tonifies Kidney Yang, and aids the smooth flow of Qi and Blood.","With Gou Qi Zi, for low back pain.","With Zhi Fu Zi, Rou Gui and Yin Yang Huo, for cold legs and intolerance of Cold."]},{"herb":"JinYingZi","dosage":"125g","actions":["Stabilizes Kidneys, astringes urine and retains essence.","With Qian Shi, tonifies Kidney Qi and strengthens Jing to treat cloudy urine, urinary frequency, vaginal discharge or spermatorrhea."]},{"herb":"ShuDiHuang","dosage":"125g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Zhi Fu Zi and Rou Gui, for Kidney Yang Deficiency."]},{"herb":"YinYangHuo","dosage":"250g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido."]},{"herb":"BaiZhu","dosage":"250g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"GouQiZi","dosage":"180g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Shu Di Huang Zhi Fu Zi Shan Zhu Yu and Rou Gui, for Kidney Yang Deficiency."]},{"herb":"DangGui","dosage":"180g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops cough and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShanZhuYu","dosage":"125g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Jin Ying Zi, for spermatorrhea or premature ejaculation.","With Shu Di Huang,nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Dang Gui and Shu Di Huang, for night sweats due to Yin Deficiency."]},{"herb":"QianShi","dosage":"125g","actions":["Stabilizes the Kidneys, astringes Jing, expels Dampness and stops discharge."]},{"herb":"XianMao","dosage":"125g","actions":["Tonifies the Kidneys, strengthens Yang, expels Cold and eliminates Dampness.","With Du Zhong, for impotence, spermatorrhea and weakness and pain in the lower back and legs.","With Yin Yang Huo, for chills and impotence with Cold sperm, cold extremities and infertility.","With Jin Ying Zi, for polyuria.","With Yin Yang Huo and Ba Ji Tian, for impotence."]},{"herb":"SheChuangZi","dosage":"125g","actions":["Warms and tonifies the Kidneys and strengthens Yang.","With Rou Cong Rong, Rou Gui and Ba Ji Tian, for impotence or infertility due to waning of the Ming Men Fire."]},{"herb":"JiuCaiZi","dosage":"125g","actions":["Supplements the Liver, warms the Kidneys, fortifies Yang and astringes Jing."]},{"herb":"RouCongRong","dosage":"125g","actions":["Tonifies the Kidneys, strengthens the Yang, benefits Jing and marrow and warms the Womb.","With Du Zhong and Ba Ji Tian, for Deficient Kidney induced pain and weakness in the lower back with a feeling of weakness in the sinews and bones.","With Yin Yang Huo, for decreased sexual desire."]},{"herb":"BaJiTian","dosage":"125g","actions":["Tonifies the Kidneys and strengthens Yang.","With Yin Yang Huo, Zhi Fu Zi and Rou Gui, for impotence or infertility associated with waning of Ming Men Fire.","With Rou Cong Rong, tonifies Yang without injuring Yin."]}],"actions":["Warms Yang","Consolidates Jing","Supplements the Kidneys","Tonifies Qi"],"syndromes":["Kidney Yang Deficiency with Kidney Qi not Consolidated"],"manifestations":{"symptoms":["Premature ejaculation","Shortness of breath","Heart palpitations","Spontaneous sweat","A white face","Clear, frequent urination","Exhausted spirit","A feeble voice","Decreased sexual desire","Nocturnal emission","Lack of strength","Aversion to Cold","Cold extremities","Cold pain in the low back"],"tongue":"Pale","tongueCoat":"White","pulse":"Weak"},"conditions":[{"name":"Premature ejaculation "},{"condition":"Palpitations","name":"Heart palpitations "},{"name":"Male infertility"},{"condition":"LowBackPain","name":"Low back pain"},{"condition":"Polyuria","name":"Polyuria"},{"condition":"Impotence","name":"Impotence"},{"condition":"Infertility","name":"Infertility"},{"condition":"Spermatorrhea","name":"Nocturnal emissions"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a fine powder and make into pills with honey. Each pill should weigh 6g. Take 1 pill 2-3 times per day."],"modifications":[]}