{"formula":"GuiLingXiaoLiuWan","names":{"pinyin":"gui ling xiao liu wan","hanzi":"cinnamon and poria mass reducing pill","commonEnglish":"Cinnamon and Poria Mass Reducing Pill","aka":["&#xA0;"]},"herbs":[{"herb":"GuiZhi","dosage":"2-12g","actions":["Unblocks Yang, transforms Qi, warms the Middle and directs Turbid Yin downward, warms the channels, collaterals and Blood through the vessels to relieve pain and warms and facilitates the flow of Yang Qi in the chest.","With Bai Shao, warms and tonifies the Middle Jiao.","With Fu Ling, unblocks the Yang and facilitates the removal of congested fluids associated with Yang Deficiency edema.","With Fu Ling and Bai Shao, for Heart and Spleen Yang Deficiency with palpitations, edema and shortness of breath.","With Dan Shen, for palpitations and chest pain due to Heart Yang Deficiency and subsequent painful obstruction due to Blood Stasis blocking the channels.","With Tao Ren and Mu Dan Pi, for gynecological discomfort due to Blood Stasis and lower abdominal masses.","With Tao Ren, Mu Dan Pi and Fu Ling, for amenorrhea and abdominal pain due to Cold Invasion and Blood Stasis."]},{"herb":"FuLing","dosage":"2-15g","actions":["Promotes urination, resolves Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Gui Zhi, warms and transforms fluids, unblocks Yang and promotes urination."]},{"herb":"ChiShao","dosage":"2-12g","actions":["Clears Heat, cools the Blood, activates Blood, dispels Blood Stasis and eliminates pain.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding, and thick purple clots.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation.","With Mu Dan Pi, for Blood Stasis disorders (amenorrhea, menstrual pain, traumatic injury)."]},{"herb":"BaiShao","dosage":"(2-12g)","actions":["(Nourishes Blood, regulates menstruation, benefits Yin, astringes weak Ying Qi, softens the Liver and relieves pain.)","With Gui Zhi, harmonizes the Ying and Wei and warms and tonifies the Middle Jiao.)"]},{"herb":"MuDanPi","dosage":"2-12g","actions":["Activates Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Tao Ren and Gui Zhi, for amenorrhea and abdominal pain due to Blood Stasis.","With Chi Shao, for irregular menstruation due to Heat and obstruction from Blood Deficiency.","With Tao Ren, Gui Zhi, Fu Ling and Chi Shao, for amenorrhea, dysmenorrhea with severe pain, Heat, masses, lumps and tumors due to Blood Stasis."]},{"herb":"TaoRen","dosage":"2-12g","actions":["Dispels Blood Stasis and invigorates Blood circulation."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations, regulates menstruation and alleviates pain."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis, reduces swelling, expels pus and regulates the menses.","With Huang Qi, for Qi and Blood Deficiency."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins."]},{"herb":"ShanZha","dosage":"8-16g","actions":["Transforms Blood Stasis, invigorates Blood circulation and transforms accumulations."]}],"actions":["Invigorates Blood","Transforms Blood Stasis","Softens lumps","Reduces fixed abdominal pain"],"syndromes":["Tender masses in the lower abdomen due to Phlegm and Blood Stagnation"],"manifestations":{"symptoms":["Mild, persistent uterine bleeding of purple and black blood during pregnancy","Abdominal pain that is worse with pressure","Abdominal spasms and tension","Immobile masses in the lower abdomen with pain and tenderness","Amenorrhea with distention and pain","Dysmenorrhea","Headache","Sinus congestion","Constipation","Excess weight in the pelvis","Lower back ache","Irregular menstruation","Nervousness","Fatigue","Fetal instability","Skin eruptions","Scanty menstrual flow","Scaly, dry skin","Retention of lochia","Headache","Shoulder stiffness","Vertigo","Cold low body and feet","Flushed face","Protruding abdomen"],"tongue":"Dark purple or with echymoses or petechiae or pale with purplish spots","tongueCoat":"White","pulse":"Choppy or Tense, deep and slow"},"conditions":[{"condition":"Dysmenorrhea","name":"Uterine fibroids"},{"condition":"Amenorrhea","name":"Amenorrhea"},{"condition":"UterineMyoma","name":"Uterine myoma"}],"contra":{"contraindications":["Use with extreme caution during pregnancy or postpartum.","Use only with confirmed diagnosis of Blood Stasis.","This formula is not intended for serious conditions of Blood Stagnation or Excess Heat in the Blood."],"interactions":[""]},"notes":[""],"modifications":[]}