{"formula":"GuiShaoLiuJunZiTang","names":{"pinyin":"gui shao liu jun zi tang","hanzi":"归芍六君子湯","english":"six gentlemen decoction with dang gui and peony","commonEnglish":"Six Gentlemen Decoction with Dang Gui and Peony","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"3-9g","actions":["Tonifies the Middle Jiao and augments Qi.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Bai Zhu, Zhi Gan Cao, Fu Ling and Bai Shao, for Qi and Blood Deficiency."]},{"herb":"BaiZhu","dosage":"4.5-9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Dang Shen and Gan Jiang, for Deficiency Cold of the Middle Jiao with abdominal pain, distention, vomiting and diarrhea.","With Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"FuLing","dosage":"6-9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Dang Gui, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Dang Shen and Fu Ling, strengthens the Spleen and augments Qi."]},{"herb":"ChenPi","dosage":"3-6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Zhi Ban Xia and Fu Ling, for cough due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"4.5-9g","actions":["Dries Dampness and transforms Phlegm.","With Chen Pi, for a productive cough and a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"GanJiang","dosage":"(3-6g)","actions":["(Warms the Middle and expels Cold.)","(With Bai Zhu, for diarrhea due to Spleen Deficiency.)"]},{"herb":"DaZao","dosage":"(3-6g)","actions":["(Tonifies the Spleen and Stomach, augments Qi and moderates and harmonizes the harsh properties of other herbs.)","(With Dang Shen and Bai Zhu, for weakness and lassitude due to Spleen and Stomach Deficiency.)","(With Zhi Ban Xia, for vomiting of saliva or dry heaves due to Cold-induced congested fluids.)","(With Zhi Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.)","(With Fu Ling, Bai Zhu and Zhi Gan Cao, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back.)"]},{"herb":"DangGui","dosage":"3-9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Chen Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with cough, wheezing, nausea marked by profuse, salty sputum.","With Chen Pi, Zhi Ban Xia and Fu Ling, for coughing attacks at night.","With Bai Shao, Regulates and harmonizes Qi and Blood for Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"3-9g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Zhi Gan Cao, for abdominal pain due to disharmony between the Liver and Stomach."]}],"actions":["Tonifies Qi","Strengthens the Spleen and Stomach","Transforms Phlegm","Dries Dampness","Circulates Qi","Harmonizes the Middle Jiao","Nourishes the Blood"],"syndromes":["Delayed menstruation due to Phlegm-Damp Retention"],"manifestations":{"symptoms":["Retarded menstrual flow (may vary greatly)","Menstrual discharge is scant with a pale color","Continuous leukorrhea","Epigastric distention","Listlessness","Heaviness of the Limbs","Chest stuffiness","Facial edema","Vertigo"],"tongue":"Normal","tongueCoat":"Sticky and white","pulse":"Slippery and wiry"},"conditions":[{"condition":"LateMenstruation","name":"Late menstruation"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}