{"formula":"GuiZhiJiaZhuFuTang","names":{"pinyin":"gui zhi jia zhu fu tang","hanzi":"桂枝加术附汤","english":"cinnamon, atractylodes and aconite combination","commonEnglish":"Cinnamon, Atractylodes and Aconite Combination","aka":[""]},"herbs":[{"herb":"GuiZhi","dosage":"4g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer and warms the channels and collaterals to relieve pain.","with Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei (Tai Yang Zhong Feng), with spontaneous sweating, fever and chills. With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi and backache due to Wind-Cold Damp Bi."]},{"herb":"BaiShao","dosage":"4g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei and alleviates pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews."]},{"herb":"DaZao","dosage":"4g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ShengJiang","dosage":"4g","actions":["Releases the Exterior, induces perspiration and disperses Cold.","With Da Zao, for External Wind-Cold.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis.","With Gui Zhi and Da Zao, harmonizes the Ying and Wei to drive out pathogens."]},{"herb":"GanCao","dosage":"2g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]},{"herb":"CangZhu","dosage":"4g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and Clears Dampness from the Lower Jiao.","With Da Zao, for chronic accumulation of Dampness in the Spleen."]},{"herb":"ZhiFuZi","dosage":"1g","actions":["Disperses Cold and Dampness, warms the channels and stops pain."]}],"actions":["Expels Wind and Dampness","Invigorates the Blood","Promotes urination"],"syndromes":["Wind-Dampness"],"manifestations":{"symptoms":["Joint pain","Edema"],"tongue":"Darkish","tongueCoat":"Yellow and greasy","pulse":"Wiry"},"conditions":[{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"Arthralgia","name":"Gouty arthralgia"},{"name":"Rheumatic arthritis"},{"condition":"Edema","name":"Edema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}