{"formula":"GuiZhiErYueBiYiTang","names":{"pinyin":"gui zhi er yue bi yi tang","hanzi":"桂枝二越婢一汤","english":"two parts cinnamon twig one part maidservant from yue decoction","commonEnglish":"Two Parts Cinnamon Twig One Part Maidservant from Yue Decoction","aka":["Cinnamon Ma Huang and Gypsum Combination."]},"herbs":[{"herb":"GuiZhi","dosage":"3g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei and releases the muscle layer. &#xA0;","With Bai Shao, harmonizes the Ying and Wei."]},{"herb":"BaiShao","dosage":"3g","actions":["Astringes Yin and adjusts the Ying and Wei.","With Gui Zhi, Sheng Jiang and Da Zao, for Wind-Cold with Deficiency and perspiration."]},{"herb":"MaHuang","dosage":"3g","actions":["Induces sweating, releases the Exterior, disseminates and facilitates Lung Qi, calms wheezing, stops coughing, promotes urination, reduces edema and warms and disperses Cold pathogens.","With Gui Zhi, for Wind-Cold Excess conditions with fever and chills but no sweat.","With Shi Gao for cough with nasal flaring due to Wind-Heat Obstructing the Lungs."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, stops cough and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, harmonizes the other herbs and regulates the Spleen and Stomach.","With Da Zao, tonifies the Middle Jiao."]},{"herb":"ShengJiang","dosage":"3g","actions":["Releases the Exterior, induces perspiration and disperses Cold, warms the Lungs, stops cough, treats nausea and vomiting and strengthens the spreading and mobilizing actions of the other herbs.","With Da Zao, treats External Wind-Cold, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, protects the Stomach Qi and reduces irritation of the gastrointestinal tract by other herbs and adjusts the Ying and Wei for treatment of Tai Yang Zhong Feng.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis and warms and dispels thin mucus in the Stomach with nausea, hiccup, Stomach pain, acid reflux or vomiting of clear fluid.","With Gui Zhi and Da Zao, harmonizes the Ying and Wei to drive out pathogens.","With Ma Huang, strongly creates sweating to treat all externally contracted Wind-Cold disorders, especially those in which Wind-Cold has constrained Lung Qi with cough and wheezing and the failure of Lung Qi to descend causing nausea and vomiting."]},{"herb":"ShiGao","dosage":"3g","actions":["Clears Heat, drains Fire, clears Excess Heat from the Lungs, clears Blazing Stomach Fire, nourishes Body Fluids, stops thirst and relieves the muscles.","With Ma Huang, for cough with nasal flaring due to Wind-Heat Obstructing the Lungs.","With Sheng Jiang, decreases muscular swelling.","With Ma Huang and Gui Zhi, for Wind-Cold with Interior Heat."]},{"herb":"DaZao","dosage":"4pc","actions":["Moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Induces sweating","Clears Interior Heat"],"syndromes":["Tai Yang Stage with mild Interior Heat"],"manifestations":{"symptoms":["Alternating chills and fever","Chills severe","Fever of longer duration than chills","Thirst","Slight irritability"],"tongue":"Pink","tongueCoat":"White","pulse":"Floating, big and forceful"},"conditions":[{"condition":"CommonCold","name":"Common cold"},{"condition":"Insomnia","name":"Influenza"},{"condition":"Pneumonia","name":"Pneumonia"},{"name":"Malaria-like symptoms"},{"condition":"Bronchitis","name":"Bronchitis"},{"condition":"UpperRespiratoryTractInfection","name":"Upper respiratory tract infection"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}