{"formula":"GuiZhiJiaShaoYaoShengJiangGeYiLiangRenShenSanLiangXinJiaTang,html","names":{"pinyin":"gui zhi jia shao yao sheng jiang ge yi liang ren shen san liang xin jia tang","hanzi":"桂枝加芍藥生姜各一量人參三量信夹汤","english":"cinnamon, peony, ginger and ginseng combination","commonEnglish":"Cinnamon, Peony, Ginger and Ginseng Combination","aka":[""]},"herbs":[{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei and releases the muscle layer."]},{"herb":"BaiShao","dosage":"12-30g","actions":["Nourishes the Blood, astringes Yin and adjusts the Ying and Wei.","With Gui Zhi, harmonizes the Ying and Wei in Tai Yang Zhong Feng."]},{"herb":"ShengJiang","dosage":"12-30g","actions":["Releases the Exterior, induces perspiration, disperses Cold and adjusts the Ying and Wei - normalizes the flow of Qi at the center.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis.","With Gui Zhi and Da Zao, harmonizes the Ying and Wei to drive out pathogens"]},{"herb":"DaZao","dosage":"12pcs","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, adjusts the Ying and Wei for treatment of Tai Yang Zhong Feng."]},{"herb":"RenShen","dosage":"9-95g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Releases Wind-Cold from the muscle layer","Regulates the Ying and Wei","Tonifies Qi"],"syndromes":["Tai Yang Shang Han complication with generalized aching and a sinking slow pulse after administration of Ma Huang Tang"],"manifestations":{"symptoms":["Generalized aching"],"tongue":"Normal","tongueCoat":"White and moist","pulse":"Sinking and slow"},"conditions":[{"condition":"CommonCold","name":"Common cold"},{"condition":"UpperRespiratoryTractInfection","name":"Upper respiratory tract infection"},{"condition":"Influenza","name":"Influenza"},{"condition":"AllergicRhinitis","name":"Allergic rhinitis"}],"contra":{"contraindications":["Contraindicated for those with Exterior Cold with Interior Heat.","Use caution during the summer or spells of hot weather."],"interactions":[""]},"notes":[""],"modifications":[]}