{"formula":"GuiZhiQuGuiJiaFuLingBaiZhuTang","names":{"pinyin":"gui zhi qu gui jia fu ling bai zhu tang","hanzi":"桂枝去桂加茯苓白术汤","english":"cinnamon twig minus cinnamon plus poria and atractylodes macrocephala decoction","commonEnglish":"Cinnamon Twig Minus Cinnamon plus Poria and Atractylodes Macrocephala Decoction","aka":[""]},"herbs":[{"herb":"BaiShao","dosage":"4-9g","actions":["Astringes Yin and adjusts the Ying and Wei."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Fu Ling and Sheng Jiang, for edema with Kidney Yang Deficiency."]},{"herb":"ShengJiang","dosage":"3-9g","actions":["Helps release the exterior, treats nausea and vomiting. strengthens the spreading and mobilizing actions of the other herbs and adjusts the Ying and Wei.","With Zhi Gan Cao, harmonizes and regulates the Spleen and Stomach.","With Da Zao, regulates disharmony between the Ying and Wei. and benefits the Middle Qi."]},{"herb":"DaZao","dosage":"3-12g","actions":["Helps Bai Shao regulate the Ying and Wei.","With Gan Cao, tonifies and harmonizes the Middle Jiao.","With Sheng Jiang, adjusts the Ying and Wei for treatment of Tai Yang Zhong Feng."]},{"herb":"GanCao","dosage":"2-6","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, stops cough, clears Heat and moderates and harmonizes the harsh properties of the other herbs."]}],"actions":["Promotes urination","Releases the Exterior","Tonifies the Spleen"],"syndromes":["Wind-Cold is still present after sweating or purging treatment, and generates fluid accumulation in the Middle Jiao."],"manifestations":{"symptoms":["Chills","Fever","Fullness of the epigastrium","Headache","No sweating","Oliguria","Pain of the epigastrium","Painful neck","Stiffness of the neck","Dysuria"],"tongue":"Normal","tongueCoat":"White and slippery","pulse":"Floating"},"conditions":[{"condition":"CommonCold","name":"Common cold"},{"condition":"Insomnia","name":"Influenza"},{"condition":"Pneumonia","name":"Pneumonia"},{"condition":"UpperRespiratoryTractInfection","name":"Upper respiratory tract infection"},{"condition":"Fever","name":"Fever"},{"condition":"Headache","name":"Headache "},{"condition":"Bronchitis","name":"Bronchitis"}],"contra":{"contraindications":["Do not use long-term."],"interactions":[""]},"notes":["As soon as the patient shows normal urination, stop the medication."],"modifications":[]}