{"formula":"HanHuaDing","names":{"pinyin":"han hua ding","hanzi":"含化钉","english":"lozenge for perilingual use","commonEnglish":"Lozenge for Perilingual Use","aka":[""]},"herbs":[{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi and alleviates pain."]},{"herb":"EZhu","dosage":"12g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With Mu Xiang, for Food Stagnation with abdominal distention, fullness, and pain."]},{"herb":"WuLingZhi","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, eliminates toxins and alleviates pain."]},{"herb":"BoHe","dosage":"3g","actions":["Disperses Wind-Heat, relieves Stagnation of Liver Qi and benefits the throat."]},{"herb":"PengSha","dosage":"6g","actions":["Clears Heat, relieves toxicity, prevents putrefication, reduces swellings, dries Dampness, dissolves Phlegm and transforms stones."]},{"herb":"ErCha","dosage":"6g","actions":["Drains Dampness, absorbs suppuration, clears Heat, clears the Lungs and transforms Phlegm.","With Peng Sha, topically for oral ulcers."]},{"herb":"MangXiao","dosage":"3g","actions":["Clears Heat, drains Fire, reduces swelling and treats painful, ulcerated, swollen mouth or throat topically.","With Peng Sha, for topically for redness and swelling of the throat and ulcerations of the mouth."]},{"herb":"DanZhuYe","dosage":"3g","actions":["Clears Heat, clears Damp-Heat and eliminates irritability."]},{"herb":"WuMei","dosage":"36g","actions":["Treat corns and warts topically and alleviates pain."]},{"herb":"DaHuang","dosage":"3g","actions":["Drains Heat, purges accumulations, drains Fire, invigorates the Blood, dispels Blood Stasis and eliminates Phlegm.","With Xuan Ming Fen, for abscess, swellings and toxic sores.","With Gan Cao, for vomiting liquid vomit immediately after eating."]},{"herb":"ChenXiang","dosage":"6g","actions":["Promotes movement of Qi, descends Qi and alleviates pain.","With Mu Xiang, relieves pain."]},{"herb":"JiXingZi","dosage":"6g","actions":["Disperses Blood Stagnation, regulates Qi, softens hardness, disperses tumors and removes toxins."]},{"herb":"BingPian","dosage":"4.5g","actions":["Clears Heat, drains Fire, resolves toxicity, dissipates nodules and alleviates pain."]},{"herb":"ZhongRuShi","dosage":"3g","actions":["Warms Lung Qi, resolves Phlegm, tonifies the Kidneys, tonifies Yang and grasps Qi."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, stops cough, clears Heat, relieves Fire toxicity,","alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"YiTang","dosage":"60g","actions":["Coats foreign objects and treats obstruction of the throat by fish bones or other objects."]}],"actions":["Promotes the movement of Qi","Resolves Phlegm","Dissolves accumulations","Dissipates nodules","Invigorates Blood circulation","Dispels Blood Stasis,","Clears Heat","Drains Fire","Resolves toxicity","Alleviates pain"],"syndromes":["Qi and Phlegm Stagnation"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Poor general condition","Emaciation","Chest distention","Frequent epigastric and abdominal distention and fullness which is worse after eating","Vomiting of partially digested food about twelve hours after eating","Vomiting relieves the abdominal discomfort","The vomitus may have thick or thin frothy mucus","Lassitude","Maybe epigastric masses and/or splash on palpation","Copious salivation","Stuffiness in the chest","General weakness","Acid regurgitation","Nausea"],"tongue":"Normal or Bluish and dark or Dry and rigid","tongueCoat":"Thin and white or Whitish or greasy and white or Yellow and greasy or Yellow- curdy","pulse":"Slippery or Wiry or Wiry and large or Wiry and slippery or Weak or Moderate, thready and forceless"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients except the sugars, (Bai Tang, Hong Tang and Yi Tang) into a fine powder. Decoct with the sugars and form into sweet lozenges. 9g are to be taken perilingually twice daily."],"modifications":[]}