{"formula":"HeXueTongJingTang","names":{"pinyin":"he xue tong jing tang","hanzi":"和血通经汤","english":"harmonize the blood and free the flow decoction","commonEnglish":"Harmonize the Blood and Free the Flow of the Channels [or Menses] Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"12-15g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow."]},{"herb":"SanLeng","dosage":"9g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain and regulates menstruation."]},{"herb":"EZhu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis regulates Qi and alleviates pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain.","With Su Mu, breaks up Blood Stasis."]},{"herb":"MuXiang","dosage":"6-9g","actions":["Promotes the movement of Qi and alleviates pain."]},{"herb":"RouGui","dosage":"3-9g","actions":["Warms the Kidneys, Spleen and Heart and strengthens the Yang and Ming Men Fire, disperses deep Cold, warms and unblocks the channels and vessels and alleviates pain."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With San Leng and E Zhu, for abdominal masses and accumulations.","With Su Mu, promotes the movement of Blood and unblocks menstruation."]},{"herb":"SuMu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, reduces swellings, opens the channels and alleviates pain."]},{"herb":"XueJie","dosage":"3-6g","actions":["Invigorates the Blood, dispels Blood Stasis and alleviates pain."]}],"actions":["Invigorates the Blood","Breaks up Stasis","Dispels Cold"],"syndromes":["Blood Stagnation due to Cold"],"manifestations":{"symptoms":["No period","Abdominal pain and distention which is worse with pressure","Leukorrhea","Lumbar soreness","Dark or pale green complexion","Headache","Stiff neck","Aversion to Cold"],"tongue":"Dark red with purple spots","tongueCoat":"Normal","pulse":"Deep and choppy or Deep, slow and tight"},"conditions":[{"condition":"Amenorrhea","name":"Amenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}