{"formula":"HongTengYiHaoFang","names":{"pinyin":"hong teng yi hao fang","hanzi":"紅藤一号方","english":"sargentodoxa formula #1 (retention enema)","commonEnglish":"Sargentodoxa Formula #1","aka":[""]},"herbs":[{"herb":"HongTeng","dosage":"9-30g","actions":["Clears Heat, resolves toxicity, reduces abscesses, stops pain, invigorates the Blood and disperses Stasis."]},{"herb":"ZiHuaDiDing","dosage":"9-30g","actions":["Clears Heat, relieves Fire toxicity, clears hot sores internally and externally."]},{"herb":"BaiJiangCao","dosage":"6-30g","actions":["Clears Heat, resolves toxicity, expels pus, eliminates Phlegm, reduces abscesses internally and topically, invigorates the Blood and dispels Blood Stasis.","With Pu Gong Ying. for gynecological disorders involving vaginal discharge, pain and abdominal distention due to Heat Stasis."]},{"herb":"PuGongYing","dosage":"9-30g","actions":["Reduces abscesses and dissipates nodules internally and topically, clears Heat, relieves Fire toxicity and clears Heat in the Blood."]},{"herb":"YaZhiCao","dosage":"9-30g","actions":["Cools Heat, drains Fire and slightly resolves toxicity and cools the Blood."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"WangBuLiuXing","dosage":"4-30g","actions":["Promotes the movement of Blood, invigorates the channels, reduces swelling and drains abscesses."]},{"herb":"RenDongTeng","dosage":"9-30g","actions":["Clears Heat, resolves toxicity, relieves abdominal pain due to inflammation, cools the Blood, dispels Wind-Dampness, unblocks the channels and clears Damp-Heat from the Lower Jiao.","With Hong Teng and Bai Jiang Cao, for abdominal pain due to inflammation."]}],"actions":["Clears Heat","Resolves toxicity","Regulates Qi","Opens the connecting vessels","Invigorates the Blood","Disperses Stasis"],"syndromes":["Blood Stagnation with Heat"],"manifestations":{"symptoms":["Lower abdominal distention and pain (usually on right)","Pain increases on pressure with rebound tenderness","Guarding of the abdominal musculature","Groin pain resembling urinary dysfunction without urinary difficulty","Groin pain relieved by flexing hip and knee","Groin pain intensified by extending hip","Perspiration","Irregular or intermittent fever followed by chills and perspiration","May be mass in lower right quadrant of abdomen","Aversion to Cold","Hard lumps"],"tongue":"Pink","tongueCoat":"Thin, white or yellow and greasy","pulse":"Slippery and rapid or Tight or Wiry and tight or Tight and rapid"},"conditions":[{"condition":"FallopianTubeBlockage","name":"Fallopian tube blockage"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}