{"formula":"HongTengErHaoFang","names":{"pinyin":"hong teng er hao fang","hanzi":"紅藤二号方","english":"sargentodoxa formula #2 (retention enema)","commonEnglish":"Sargentodoxa Formula #2","aka":[""]},"herbs":[{"herb":"HongTeng","dosage":"9-30g","actions":["Clears Heat, resolves toxicity, reduces abscesses, stops pain, invigorates the Blood and disperses Stasis."]},{"herb":"HuZhang","dosage":"8-30g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the channels, stops pain, discharges toxins and disperses swelling."]},{"herb":"BaiJiangCao","dosage":"6-30g","actions":["Clears Heat, resolves toxicity, expels pus, eliminates Phlegm, reduces abscesses internally and topically, invigorates the Blood and dispels Blood Stasis.","With Wu Ling Zhi and Xiang Fu, for Blood Stasis."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood and reduces abscesses.","With Dang Gui, for irregular menstruation and retained lochia from Blood Stasis"]},{"herb":"LuLuTong","dosage":"3-10g","actions":["Promotes the movement of Qi, invigorates the Blood and unblocks the channels.","With Xiang Fu, for irregular, scanty periods."]},{"herb":"TuBieChong","dosage":"3-12g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation and disperses lumps and masses.","With Pu Huang and Wu Ling Zhi, for amenorrhea, pain and fixed, palpable masses."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and regulates menstruation."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"WuLingZhi","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, stops bleeding and alleviates pain."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Stops bleeding by astringing, invigorates the Blood and dispels Blood Stasis.","With Wu Ling Zhi, for Blood Stasis causing menstrual irregularity, dysmenorrhea and lochiostasis with chest and abdominal pain."]},{"herb":"ZaoJiaoCi","dosage":"3-10g","actions":["Draws out toxicity, discharges pus, invigorates the Blood and reduces swelling."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh, expels toxins, relieves numbness and pain.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesia."]}],"actions":["Invigorates the Blood","Transforms Stasis","Softens the hard","Scatters nodulation"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe","Pain is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Blue, dark or purplish discoloration of skin in small or large areas","Dry skin","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"FallopianTubeBlockage","name":"Fallopian tube blockage"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}