{"formula":"HouJianFang","names":{"pinyin":"hou jian fang","hanzi":"喉建方","english":"larynx decoction","commonEnglish":"Larynx Decoction","aka":[""]},"herbs":[{"herb":"NiuBangZi","dosage":"3-12g","actions":["Disperses Wind-Heat and benefits the throat.","With Sheng Gan Cao, strongly clears throat and Lungs to treat Wind-Heat attacks the Lungs or Fire toxin flaring upwards.","With Jie Geng and Bo He, for throat inflammation and productive cough due to Wind-Heat.","With Xuan Shen and Jie Geng, for pain and swelling of the throat."]},{"herb":"QianHu","dosage":"3-10g","actions":["Expels Phlegm, descends Qi and expels Wind-Heat.","With Jie Geng, Niu Bang Zi and Bo He, for headache, fever, nasal congestion, rhinitis, and cough due to external Wind-Heat."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses and dissipates clumps.","With Niu Bang Zi and Bo He, for Wei Stage Heat."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire and eliminates irritability.","With Lian Qiao, for Heat entering the Pericardium."]},{"herb":"TianHuaFen","dosage":"8-16g","actions":["Clears and drains Lung Heat, transforms Phlegm and moistens Lung Dryness."]},{"herb":"XuanShen","dosage":"7-30g","actions":["Transforms Phlegm-Heat and nourishes Yin.","With Jie Geng and Sheng Gan Cao, for sore throat with Dryness and pain."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Sheng Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity, and expels pus for productive cough with hoarseness, pain and swelling of the throat due to Wind-Heat.","With Bo He, Niu Bang Zi and Chan Tui, for hoarseness and sore throat due to Wind-Heat."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Clears Heat, relieves Fire toxicity, moistens the Lungs, resolves Phlegm, stops cough and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"BoHe","dosage":"3-6g","actions":["Disperses Wind-Heat and cools and clears the head and eyes and benefits the throat.","With Chan Tui, powerfully expels Wind-Heat.","With Lian Qiao, Jie Geng and Mu He Die, for sore throat with loss of voice."]},{"herb":"ChanTui","dosage":"3-10g","actions":["Disperses Wind and clears Heat."]},{"herb":"MuHuDie","dosage":"1.5-10g","actions":["Moistens the Lungs, relieves cough and clears the voice."]}],"actions":["Disperses Wind-Heat","Benefits the throat","Expels Phlegm","Moistens the Lungs","Relieves cough","Clears the voice"],"syndromes":["Wind Heat Invades the Lungs"],"manifestations":{"symptoms":["At the beginning, the patient has a low and raspy voice","The vocal cords are swollen and red","There is a sore throat accompanied by a dry, tickling cough with yellow sticky Phlegm that is difficult to expectorate.","Fever","Aversion to draft","Headache","Sweating","Dry mouth and nose","Possible nasal congestion"],"tongue":"Slightly red rim","tongueCoat":"Thin and yellow","pulse":"Floating and rapid"},"conditions":[{"condition":"AcuteLaryngitis","name":"Acute laryngitis due to Wind-Heat Invading the Lungs "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}