{"formula":"HouPoQiWuTang","names":{"pinyin":"hou po qi wu tang","hanzi":"厚朴七物湯","english":"seven","commonEnglish":"Seven-Substance Decoction with Magnolia Bark","aka":["Magnolia Seven Combination"]},"herbs":[{"herb":"HouPo","dosage":"15-24g","actions":["Promotes the movement of Qi in the Middle Jiao and resolves Food Stagnation.","With Da Huang and Zhi Shi, for relatively severe accumulation and Stagnation with abdominal distention and pain and constipation"]},{"herb":"ZhiShi","dosage":"9g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels and removes Stagnant Food.","With Hou Po, for distention, swelling and pain due to Food Stagnation and Qi Stagnation.","With Hou Po and Da Huang, for constipation, abdominal distention, pain and fullness from Heat clumping with the stool.","With Da Huang, for constipation and abdominal swelling due to Food Stagnation and Qi Stagnation."]},{"herb":"DaHuang","dosage":"9g","actions":["Drains Heat, purges accumulations, drains Fire, invigorates the Blood and dispels Blood Stasis.","With Gan Cao, for vomiting immediately after eating."]},{"herb":"GuiZhi","dosage":"6g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the Middle and directs Turbid Yin downward.","With Da Huang, for combined Interior/Exterior conditions with chills, headache, fever, sweating and abdominal fullness and pain."]},{"herb":"DaZao","dosage":"8-20g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ShengJiang","dosage":"12-15g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting and normalizes the flow of Qi at the center.","With Da Zao, expels External Wind-Cold and alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis and warms and dispels thin mucus in the Stomach with nausea, hiccup, Stomach pain and acid reflux or vomiting of clear fluid.","With Gui Zhi and Da Zao, harmonizes the Ying and Wei to drive out pathogens."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Expels Wind from the Exterior and muscle layer","Regulates Qi","Promotes defecation"],"syndromes":["Tai Yang- Yang Ming with Interior Excess"],"manifestations":{"symptoms":["Abdominal fullness","Fever","Tenesmus","Constipation","Vomiting"],"pulse":"Floating and rapid"},"conditions":[{"condition":"Gastroenteritis","name":"Gastroenteritis"},{"name":"Peritonitis"},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness "},{"condition":"NauseaVomiting","name":"Vomiting"},{"condition":"Constipation","name":"Habitual constipation"},{"name":"Tenesmus"},{"condition":"Fever","name":"Fever"},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"nausea","modifications":[{"herb":"ZhiBanXia","modification":"+ Rz. Pinelliae Preparatum"}]}]}