{"formula":"HuaChengKao","names":{"pinyin":"hua cheng kao","hanzi":"化頳薧","english":"oyster shell and prunella formula","commonEnglish":"Oyster Shell and Prunella Decoction","aka":[""]},"herbs":[{"herb":"MuLi","dosage":"30g","actions":["Softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"XiaKuCao","dosage":"12g","actions":["Clears Hot Phlegm, dissipates nodules and inhibits the growth of cancer cells.","With Xuan She, Mu Li and Kun Bu, for nodules due to Phlegm Fire.","With Zhe Bei Mu, cools and relieves toxicity to disperse and transform Phlegm and treat goiter, scrofula and swollen or inflamed lymph glands."]},{"herb":"HaiZao","dosage":"12g","actions":["Reduces Phlegm, softens areas of hardness and inhibits the growth of cancer cells."]},{"herb":"KunBu","dosage":"12g","actions":["Resolves Phlegm, softens Phlegm nodules and inhibits the growth of cancer cells.","With Hai Zao, for goiter and scrofula."]},{"herb":"LuFengFang","dosage":"9g","actions":["Relieves toxicity, alleviates pain, treats tumors and inhibits the growth of cancer cells."]},{"herb":"TianHuaFen","dosage":"9g","actions":["Drains Heat, generates Fluids, transforms Phlegm, relieves toxicity, expels pus, reduces swelling and inhibits the growth of cancer cells.","With Mu Li, for goiter from clumping of Phlegm-Heat."]},{"herb":"XuanShen","dosage":"6g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, drains Fire and relieves toxicity."]},{"herb":"ZheBeiMu","dosage":"6g","actions":["Clears Heat, transforms Phlegm, dissipates nodules and inhibits the growth of cancer cells.","With Xuan Shen and Mu Li, for nodules without abscess.","With Xuan Shen, Xia Ku Cao and Mu Li, for scrofula due to Phlegm-Fire with swelling and pain at multiple sites."]},{"herb":"WuGong","dosage":"6g","actions":["Attacks and relieves Fire toxins, relieves abdominal masses, dissipates nodules, unblocks collaterals, stops pain and inhibits the growth of cancer cells."]}],"actions":["Drains Fire","Relives toxicity","Resolves hot Phlegm","Softens hardness","Dissipates nodules","Inhibits the growth of cancer cells"],"syndromes":["Phlegm-Heat"],"manifestations":{"symptoms":["Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}