{"formula":"HuangJingDangShenShengYaTang","names":{"pinyin":"huang jing dang shen sheng ya tang","hanzi":"黄精党参升压痰","english":"polygonatum and codonopsis raise the blood pressure decoction","commonEnglish":"Polygonatum and Codonopsis Raise the Blood Pressure Decoction","aka":[""]},"herbs":[{"herb":"GeGen","dosage":"18g","actions":["Raises Spleen Yang and stops diarrhea."]},{"herb":"ChuanXiong","dosage":"18g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"HuangJing","dosage":"12g","actions":["Tonifies Spleen Qi, nurtures Stomach Yin, tonifies the Kidneys and strengthens Jing.","With Dang Shen and Fu Ling, for Spleen and Stomach Qi Deficiency."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao, augments Qi, tonifies the Lungs, nourishes the Blood and promotes the generation of Body Fluids.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm and harmonizes the Stomach."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Zhi Ban Xia, treats Phlegm, thin mucus and turbid Dampness."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi and promotes Blood flow."]},{"herb":"ShanZha","dosage":"9g","actions":["Reduces and guides out Food Stagnation, transforms accumulations, transforms Blood Stasis, invigorates Blood circulation and treats hypertension, elevated serum cholesterol, and coronary artery disease."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and cools the Blood."]},{"herb":"JueMingZi","dosage":"9g","actions":["Calms the Liver, anchors Liver Yang and reduces Blood pressure and serum cholesterol."]}],"actions":["Transforms Phlegm","Descends turbidity","Tonifies Qi","Invigorates the Blood"],"syndromes":["Qi Deficiency with Blood Stasis and Phlegm Turbidity"],"manifestations":{"symptoms":["Either low Blood pressure or","Blood pressure that is sometimes low and sometimes high","Relatively high Blood lipids","Dizziness","Headache","Chest oppression","Piercing pain","Heart flutter","Shortness of breath","Lassitude","Lack of strength"],"tongue":"Dark with possible static spots or macules","tongueCoat":"White","pulse":"Wiry, moderate and choppy"},"conditions":[{"condition":"Hypotension","name":"Hypotension"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"marked fatigue","modifications":[{"herb":"HuangQi","modification":"+ 18g Rx. Astragali"},{"herb":"JiXueTeng","modification":"+ 18g Caulis Spatholobi"},{"herb":"DangGui","modification":"+ 9g Rx. Angelicae Sinensis"}]}]}