{"formula":"HuangLongTang","names":{"pinyin":"huang long tang","hanzi":"黃龙汤","english":"yellow dragon decoction","commonEnglish":"Yellow Dragon Decoction","aka":[""]},"herbs":[{"herb":"DaHuang","dosage":"9-12g","actions":["Drains Heat, purges accumulations, clears Heat, transforms Dampness, promotes urination,invigorates the Blood and dispels Blood Stasis.","With Zhi Shi, Mang Xiao and Hou Po, for unremitting high fever, delirious speech and constipation.","With Dang Gui, for Blood Stasis.","With Mang Xiao, eliminates obstruction in the Intestines for severe constipation with passage of liquid but no solid stool.","With Ren Shen and Dang Gui, for Yang Ming Stage with Qi and Blood Deficiency."]},{"herb":"MangXiao","dosage":"6-9g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat and drains Fire.","Wit Da Huang, for constipation due to Heat in the Stomach and Intestines.","With Da Huang and Gan Cao, for moderate constipation due to accumulation of Excess Heat."]},{"herb":"HouPo","dosage":"9-12g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Rebellious Qi and reduces Phlegm.","With Zhi Shi, for abdominal or chest distention, focal epigastric distention, wheezing, shortness of breath, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem.","With Zhi Shi and Da Huang, for relatively severe accumulation and Stagnation with abdominal distention and pain and constipation.","With Ren Shen and Gan Cao, for distention and fullness due to Deficiency Cold."]},{"herb":"ZhiShi","dosage":"9g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Da Huang, for constipation and abdominal swelling due to Food Stagnation and Qi Stagnation."]},{"herb":"RenShen","dosage":"6g","actions":["Tonifies Spleen and Stomach Qi and tonifies Qi in Deficiency patients with Exterior conditions."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, regulates the menses moistens the Intestines and unblocks the bowels.","With Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"JieGeng","dosage":"3-6g","actions":["Expels Phlegm."]},{"herb":"ShengJiang","dosage":"9g","actions":["Normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Da Zao, protects the Stomach Qi and reduces irritation of the gastrointestinal tract by other herbs."]},{"herb":"DaZao","dosage":"3g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, alleviates epigastric pain, nausea and vomiting by strengthening the Spleen."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Heat","Promotes defecation","Tonifies Qi and Blood"],"syndromes":["Interior Excess Heat with Qi and Blood Deficiency","Yang Ming Fu with Qi and Blood Deficiency","Qi Stage: Intestinal Dry Heat with Qi and Blood Deficiency"],"manifestations":{"symptoms":["Constipation characterized by only clear, watery fluids upon defecation or","Green, watery foul-smelling diarrhea","Altered consciousness","Delirium","Severe cases: Carphology Hallucinations Grabbing the air Loss of consciousness with frigid, contracted extremities","Epigastric and abdominal hardness and pain","Abdominal pain that is worse with pressure","Thirst","Fever","A dry mouth and tongue","Shortness of breath","Low energy","A weak voice"],"tongue":"Variable","tongueCoat":"Dry and yellow or Dry and black","pulse":"Deficient"},"conditions":[{"condition":"Constipation","name":"Constipation"},{"name":"Intestinal obstruction"},{"name":"Typhoid fever"},{"name":"Para-typhoid "},{"condition":"Dysentery","name":"Chronic bacterial dysentery "},{"condition":"Hemorrhoids","name":"Hemorrhoids"},{"condition":"Diarrhea","name":"False diarrhea"},{"name":"Pelvic inflammatory disease"},{"name":"Salpingitis"},{"condition":"Gastroenteritis","name":"Gastroenteritis"},{"name":"Post-operative recovery of gastrointestinal function "},{"name":"Meningitis"},{"name":"Encephalitis"},{"condition":"IntestinalTuberculosis","name":"Intestinal tuberculosis"},{"condition":"AbdominalPain","name":"Abdominal pain "},{"condition":"Crohn'sDisease","name":"Crohn's disease"},{"name":"Mesenteric lymphadenitis"},{"name":"Trichomonas"}],"contra":{"contraindications":["Contraindicated for those with only Deficiency and no Excess."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"constipation in elderly patients with weakness and Deficiency","modifications":[{"herb":"ShengDiHuang","modification":"+ Rx. Rehmanniae"},{"herb":"MangXiao","modification":"+ Less Natrii Sulfas"},{"herb":"RenShen","modification":"+ More Rx. Ginseng"},{"herb":"DangGui","modification":"+ More Rx. Angelicae Sinensis"}]},{"purpose":"dry mouth and lips due to Excess Heat","modifications":[{"herb":"XuanShen","modification":"+ Rx. Scrophulariae"},{"herb":"MaiMenDong","modification":"+ Rx. Ophiopogonis"}]},{"purpose":"post-operative recovery","modifications":[{"herb":"RenShen","modification":"- Rx. Ginseng"},{"herb":"GanCao","modification":"- Rx. Glycyrrhizae"},{"herb":"DangShen","modification":"+ Rx. Codonopsis"},{"herb":"MaiMenDong","modification":"+ Rx. Ophiopogonis"}]}]}