{"formula":"HuangQiYiYiRenFuZiTang","names":{"pinyin":"huang qi yi yi ren fu zi tang","hanzi":"黄芪薏苡仁附子汤","english":"astragalus, coix and aconite decoction","commonEnglish":"Astragalus, Coix and Aconite Decoction","aka":[""]},"herbs":[{"herb":"YiYiRen","dosage":"20g","actions":["Strengthens the Spleen and resolves Dampness.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema.","With Fu Ling and Bai Zhu, for Spleen Deficient diarrhea."]},{"herb":"HuangQi","dosage":"20g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, promotes urination and reduces edema.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Zhu Fu Zi, for spontaneous sweat and chills due to Yang Deficiency.",""]},{"herb":"DangShen","dosage":"15g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"FuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Dang Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"ZhiFuZi","dosage":"9g","actions":["Restores Devastated Yang and, warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang and disperses Cold.","With Gan Jiang and Gan Cao, strengthens its actions of fortifying Qi and benefiting the Yang for Cold extremities and diarrhea with undigested food due to Collapse of the Spleen and Kidney Yang.","With Bai Zhu and Fu Ling, for Kidney and Spleen Yang Deficiency with retention of pathogenic water with abdominal pain, which is worse with Cold, urinary difficulty, and deep aching and heaviness in the extremities.","With Bai Zhu and Gan Jiang, for internal ascendance of Yin Cold leading to lack of arousal of Spleen Yang with abdominal pain and Cold with watery diarrhea.","With Dang Shen, Bai Zhu and Gan Jiang, for Spleen Yang Deficiency."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Dang Shen and Gan Jiang, for Deficiency Cold of the Middle Jiao with abdominal pain, distention, vomiting and diarrhea.","With Fu Ling and Yi Yi Ren, for Spleen and Stomach Deficiency with Dampness.","With Zhi Fu Zi and Fu Ling, for Edema due to Spleen and Kidney Yang Deficiency.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat.",""]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness and transforms Phlegm.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","with Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"DaFuPi","dosage":"9g","actions":["Descends Qi, eases the Middle, promotes urination and reduces edema.","With Bai Zhu, for Spleen Qi Deficiency with Dampness accumulating in the skin and floating edema."]},{"herb":"GanJiang","dosage":"6g","actions":["Warms the Middle, expels Cold, rescues Devastated Yang and expels Interior Cold.","With Bai Zhu, for diarrhea due to Spleen Deficiency.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Fu Ling, Bai Zhu and Gan Cao, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back.",""]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Fu Ling and Bai Zhu, for Spleen and Stomach Qi Deficiency.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Dang Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi."]},{"herb":"DaZao","dosage":"12g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Dang Shen and Bai Zhu, for Weakness and lassitude due to Spleen and Stomach Deficiency."]}],"actions":["Warms and Reinforces the Spleen and Kidneys"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["A somber, white facial complexion","Whole body edema","Dizziness","Aversion to Cold","A preference for warmth","Body cold","Limbs icy","Fatigue","Weak limbs","Palpitations","Sweats easily","Reduced appetite","Low back, knees and abdomen feel cold and painful","Scanty stools but profuse urine","Lower abdomen feels cold and painful","Loose stools containing undigested food","“Cock-crow” diarrhea (occurs at about 5 am)","Dysuria","Reduced libido","Impotence","Lusterless hair","Soft bones","Severe: Abdominal ascites"],"tongue":"Pale, moist and swollen","tongueCoat":"Thin and white or White and greasy","pulse":"Deep and soft or Deep, thready, weak and maybe slow"},"conditions":[{"condition":"Cushing'sSyndrome","name":"Cushing's syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"reduced libido and impotence","modifications":[{"herb":"YinYangHuo","modification":"+ 9g Hb. Epimedii"},{"herb":"XianMao","modification":"+ 9g Rz. Curculiginis"}]},{"purpose":"low back pain","modifications":[{"herb":"DuZhong","modification":"+ 9g Cx. Eucommiae"},{"herb":"XuDuan","modification":"+ 9g Rx. Dipsaci"}]}]}