{"formula":"HuangQiDanShenTangJiaJian","names":{"pinyin":"huang qi dan shen tang jia jian","hanzi":"黄芪丹参汤加減","english":"modified astragalus and salvia decoction","commonEnglish":"Modified Astragalus and Salvia Decoction","aka":[""]},"herbs":[{"herb":"DanShen","dosage":"15g","actions":["Invigorates, cools and nourishes the Blood,dispels Blood Stasis, clears Heat, soothes irritability, reduces abscesses and calms the Spirit."]},{"herb":"ZeLan","dosage":"15g","actions":["Invigorates the Blood and dispels Blood Stasis."]},{"herb":"HongTeng","dosage":"15g","actions":["Clears Heat, resolves toxicity, reduces abscesses, Invigorates the Blood, disperses Stasis and stops pain."]},{"herb":"HuangQi","dosage":"10g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins."]},{"herb":"XiangFu","dosage":"10g","actions":["Spreads and regulates Liver Qi."]},{"herb":"QingPi","dosage":"10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With San Leng and /e Zhu, for masses where prolonged Qi Stagnation has led to Blood Stagnation."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, and dries Dampness."]},{"herb":"ChiShao","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain."]},{"herb":"SanLeng","dosage":"6g","actions":["Forcefully breaks up Blood Stasis, regulates Qi and alleviates pain."]},{"herb":"EZhu","dosage":"6g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With Qing Pi, for Stagnant Qi with chest and abdominal fullness and pain.","With San Leng, for Qi and Blood Stagnation."]},{"herb":"LingXiaoHua","dosage":"6g","actions":["Dispels Blood Stagnation, unblocks the channels and vessels, Cools the Blood and disperses Wind."]},{"herb":"SiGuaLou","dosage":"6g","actions":["Resolves toxicity, reduces swelling, unblocks the channels and collaterals and dispels Wind."]},{"herb":"JiangCan","dosage":"6g","actions":["Dispels Wind, disperses Wind-Heat, stops itching and pain, transforms Phlegm, softens hardness, eliminates toxins and dissipates nodules."]}],"actions":["Invigorates the Blood","Breaks up Stagnation","Dissipates lumps"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["The disease is of relatively long duration","Small coin sized dark or hyperpigmented lesions located on the scalp, body, extremities, and other areas","Some resemble oyster shells","There is a thick hard, adherent covered scale","Removing the scale reveals a light pink shining membrane","Beneath the membrane are petechiae","Longstanding lesions may overlap","Lesions may be painful or fissured","Old lesions tend to remain fixed in size and position and new lesions seldom appear","Chronic patients may see it in any season","The lesions heal without scarring","There may be nail involvement with stippling or pitting of the nail plate","The lesions take a long time to heal","The lesions are dark red, dull red or neutral","Itching of varying intensity or absence of itching,","There may be joint malfunction","A dry mouth with no desire for drinks"],"tongue":"Purple or with purple spots","tongueCoat":"Thin white or Thin yellow","pulse":"Choppy or Thin and slow or Weak and choppy or Wiry and choppy or Deep and choppy"},"conditions":[{"condition":"Psoriasis","name":"Psoriasis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}