{"formula":"HuangLianShangQingWan","names":{"pinyin":"huang lian shang qing wan","hanzi":"黃連上清丸","english":"coptis pill to clear the upper (burner)","commonEnglish":"Coptis Pill to Clear the Upper Burner","aka":["Coptis, Phellodendron and Mentha Combination"]},"herbs":[{"herb":"HuangLian","dosage":"240g","actions":["Clears Heat, drains Dampness, drains Fire, resolves toxicity, clears Heat, stops bleeding and drains Stomach Fire.","With Huang Qin and Da Huang, for hematemesis and rectal bleeding due to Blood Heat.","With Huang Qin, Da Huang and Lian Qiao, for abscesses, lesions, carbuncles, furuncles, burns, swelling and inflammation due to toxic Heat."]},{"herb":"HuangQin","dosage":"240g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and stops bleeding.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos.","With Huang Lian and Zhi Zi, for acute febrile disease.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs and treats sores due to Heat toxin.","With Huang Lian, Huang Bai and Zhi Zi, for lesions and sores with redness, swelling and pain."]},{"herb":"HuangBai","dosage":"240g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire, relieves Fire toxicity and drains Kidney Fire.","With Zhi Zi, for Lower Jiao Damp-Heat leading to hot, painful urinary dysfunction.","With Huang Lian and Lian Qiao, for skin abscesses and lesions."]},{"herb":"ZhiZi","dosage":"240g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, relieves toxicity, reduces swelling and and cools activates the Blood.","With Lian Qiao, for Heat remaining in the Heart channel with sores in the mouth or on the tongue and dark, scanty urine or urinary discomfort.","With Huang Lian, Lian Qiao and Da Huang, for irritability and restlessness with high fever due to Toxic Heat and carbuncles and furuncles with or without abscesses and ulcerations.","With Huang Lian, Huang Qin and Lian Qiao, for boils and carbuncles.","With Da Huang, for constipation."]},{"herb":"DaHuang","dosage":"360g","actions":["Drains Heat, purges accumulations, drains Fire, transforms Dampness, promotes urination, drains Heat from the Blood, invigorates the Blood, dispels Blood Stasis and reduces Fire toxicity.","With Huang Lian, for a feeling of fullness and distention due to Heat accumulation.","With Zhi Zi, Huang Qin and Lian Qiao, for strong pathogenic Heat in the Upper and Middle Jiaos and upward Flaring of Heat attacking the head."]},{"herb":"LianQiao","dosage":"180g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps, clears Blood Heat and promotes urination."]},{"herb":"JiangHuang","dosage":"180g","actions":["Invigorates the Blood, eliminates Blood Stasis, promotes the movement of Qi, opens the channels and collaterals to alleviate pain, expels Wind and reduces swelling."]},{"herb":"XuanShen","dosage":"120g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity."]},{"herb":"BoHe","dosage":"120g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat and expels turbid filth."]},{"herb":"DangGui","dosage":"120g","actions":["Invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"GeGen","dosage":"60g","actions":["Discharges Exterior conditions, releases the muscles, especially of the neck and upper back, relieves Heat, vents measles and generates fluids.","With Zhi Zi, for irritability."]},{"herb":"ChuanXiong","dosage":"60g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"JieGeng","dosage":"60g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body."]},{"herb":"TianHuaFen","dosage":"60g","actions":["Drains Heat, generates Fluids, clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus and reduces swelling."]}],"actions":["Clears Heat","Resolves toxicity","Drains Fire","Unblocks the bowels","Expels Wind"],"syndromes":["Toxic Heat","Heat Accumulation in all three Jiaos"],"manifestations":{"symptoms":["Acute red eyes","Sore throat","Mouth or tongue sores","Dark, rough urination","Reddish urine","Restlessness and Heat in the Heart and diaphragm","Constipation","Gum bleeding","Pimples","Burning urination","Dizziness"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Slippery and rapid"},"conditions":[{"condition":"Conjunctivitis","name":"Conjunctivitis"},{"name":"Toxic swellings in the upper body"},{"condition":"Stye","name":"Sties "},{"condition":"UrinaryTractInfection","name":"Urinary tract infection "},{"condition":"Gingivitis","name":"Gingivitis"},{"condition":"Headache","name":"Headache"},{"condition":"Urticaria","name":"Urticaria"},{"condition":"YeastInfection","name":"Candidiasis"},{"condition":"OtitisMedia","name":"Otitis media"},{"name":"Otitis externa "},{"condition":"Pneumonia","name":"Pneumonia"},{"name":"Febrile disorders "},{"name":"Aphthae"},{"condition":"MigraineHeadache","name":"Migraine"},{"condition":"Constipation","name":"Constipation"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind into honey pills. Take 9g with green tea."],"modifications":[{"purpose":"a dry mouth and throat","modifications":[{"herb":"MaiMenDong","modification":"+ Rx. Ophiopogonis"},{"herb":"WuWeiZi","modification":"+ Fr. Schisandrae"}]},{"purpose":"thirst and fever","modifications":[{"herb":"ShiGao","modification":"+ Gypsum Fibrosum"},{"herb":"ZhiMu","modification":"+ Rz. Anemarrhenae"}]},{"purpose":"jaundice and fever","modifications":[{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"},{"herb":"YinChen(Hao)","modification":"+ Hb Artemisiae Scopariae"}]},{"purpose":"tenesmus and hemafecia","modifications":[{"herb":"MuXiang","modification":"+ Rx. Aucklandiae"},{"herb":"BingLang","modification":"+ Sm. Arecae"}]},{"purpose":"frequent urination and oliguria","modifications":[{"herb":"CheQianZi","modification":"+ Sm. Plantaginis"},{"herb":"MuTong","modification":"+ Caulis Akebiae"}]}]}