{"formula":"HuangBingJiangFanWanJiaJian","names":{"pinyin":"huang bing jiang fan wan jia jian","hanzi":"黄病绛礬囊加減","english":"modified yellow disease crimson alumen pills","commonEnglish":"Modified Yellow Disease Crimson Alumen Pills","aka":[""]},"herbs":[{"herb":"MingFan","dosage":"1g","actions":["Relieves toxicity, purges Fire, dries Dampness, kills parasites and alleviates itching.","With He Shi and Bing Lang, for intestinal parasites."]},{"herb":"HouPo","dosage":"9g","actions":["Promotes the movement of Qi in the Middle Jiao, dries Dampness and resolves Stagnation.","With Cang Zhu, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat."]},{"herb":"CangZhu","dosage":"6g","actions":["Strongly dries Dampness and tonifies the Spleen.","With Hou Po, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Hou Po and Cang Zhu, for epigastric and abdominal fullness and distention, acid regurgitation, fatigue, loose stool and other symptoms associated with Damp-Cold Stagnating in the Spleen and Stomach."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates spasms and alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"BingLang","dosage":"9g","actions":["Kills parasites, regulates Qi, reduces accumulations, drains downward, unblocks the bowels and treats malarial disorders."]},{"herb":"BaiBu","dosage":"9g","actions":["Expel parasites."]},{"herb":"HeShi","dosage":"9g","actions":["Kills parasites and alleviates pain."]},{"herb":"LeiWan","dosage":"6g","actions":["Kills Parasites."]},{"herb":"FeiZi","dosage":"12g","actions":["Kills parasites and reduces accumulations"]}],"actions":["Kills parasites","Eliminates jaundice"],"syndromes":["Jaundice due to hookworms"],"manifestations":{"symptoms":["Yellowing and swelling of the face","Jaundice of the whole body","White lines and itchy, red papules on the skin","Increased appetite","Abdominal distention after eating","A predilection for eating strange things (uncooked cereals, tea, charcoal)","Weak limbs"],"tongue":"Pale","tongueCoat":"White","pulse":"Soft"},"conditions":[{"condition":"Jaundice","name":"Jaundice"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}