{"formula":"HuaYanTang","names":{"pinyin":"hua yan tang","hanzi":"花岩汤","english":"transform hardness decoction","commonEnglish":"Transform Hardness Decoction","aka":["Brassica and Madder Combination"]},"herbs":[{"herb":"RenShen","dosage":"30g","actions":["Tonifies Qi and inhibits the growth of cancer cells.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu and Fu Ling, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue."]},{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, promotes the discharge of pus, generates flesh, expels toxins and inhibits the growth of cancer cells.","With Ren Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"RenDongTeng","dosage":"30g","actions":["Clears Heat, resolves toxicity, cools the Blood and treats abscesses and sores."]},{"herb":"BaiZhu","dosage":"60g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and inhibits the growth of cancer cells."]},{"herb":"QianCaoGen","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the channels and vessels, cools the Liver, transforms Phlegm and inhibits the growth of cancer cells."]},{"herb":"BaiJieZi","dosage":"6g","actions":["Warms the Lungs, regulates Qi, expels Phlegm, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and inhibits the growth of cancer cells.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]}],"actions":["Clears Heat","Resolves toxicity","Strengthens the Spleen","Tonifies Qi","Resolves Dampness","Transforms Phlegm","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat with Phlegm Accumulation due to Spleen Damp"],"manifestations":{"symptoms":["Tumor has existed for a long time","Tumor has ulcerated","Cauliflower like","Pale or yellow face","Weakness","Dizziness","Shortness of breath","Fluid inside the breast with a lump inside it","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia"],"tongue":"Red or Pale","tongueCoat":"White or Yellow and greasy or Thick and greasy","pulse":"Deep, slippery and rapid"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}