{"formula":"HuaYuChuBiTang","names":{"pinyin":"hua yu chu bi tang","hanzi":"化瘀除痺汤","english":"transform stasis and remove painful obstruction decoction","commonEnglish":"Transform Stasis and Remove Painful Obstruction Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"12g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"HongHua","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"LiuJiNu","dosage":"12g","actions":["Dispels Blood Stasis and alleviates pain."]},{"herb":"JiangHuang","dosage":"12g","actions":["Invigorates the Blood, eliminates Blood Stasis, promotes the movement of Qi, expels Wind and opens the channels and collaterals to alleviate pain."]},{"herb":"QiangHuo","dosage":"12g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for Headache and generalized body aches and pains associated With the common cold or painful obstruction.","With Bai Zhi, for headaches."]},{"herb":"BaiZhi","dosage":"12g","actions":["Expels Wind, eliminates Dampness, dispels Cold and alleviates pain.","With Chuan Xiong, for headaches.","With Qiang Huo, for Wind-Cold Dampness causing fever, chills and headaches."]},{"herb":"WeiLingXian","dosage":"15g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain. (especially in the upper joints)",""]},{"herb":"SangZhi","dosage":"12g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, benefits the joints, stops spasms, promotes diuresis and reduces edema."]},{"herb":"DanNanXing","dosage":"12g","actions":["Clears Heat, dissolves Phlegm, calms Wind and stops convulsions."]},{"herb":"BaiJieZi","dosage":"12g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"LuLuTong","dosage":"12g","actions":["Promotes the movement of Qi and invigorates the Blood, opens the Middle Jiao and unblocks the channels Expels Wind and promotes water metabolism"]}],"actions":["Invigorates the Blood","Transforms Stasis","Unblocks the Channels","Alleviates pain"],"syndromes":["Advanced Qi and Blood Stagnation with severe pain"],"manifestations":{"symptoms":["Head, neck, shoulder, upper back and upper arm aching and pain","Severe lancinating pain","Fixed pain","Pain worse at night and better during the day","Pain worse with pressure","The muscles of the arms are withered","Numbness of the fingertips","Maybe numbness which is worse at night","Spasms and tension","Cramping of the four limbs","Vexation","Agitation","A dry mouth","The fingernails are cyanosed, sunken, concave and lack luster","Dry, itchy skin","The arm may be contracted"],"tongue":"Dark purple or Static maculae or Spots","tongueCoat":"White","pulse":"Wiry and choppy"},"conditions":[{"condition":"CervicalSpondylosis","name":"Cervical spondylosis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}