{"formula":"HuiChunDan","names":{"pinyin":"hui chun dan","hanzi":"回春丹","english":"special pill to restore life","commonEnglish":"Special Pill to Restore Life","aka":["&#xA0;"]},"herbs":[{"herb":"NiuHuang","dosage":"12g","actions":["Clears the Heart, opens the Orifices aromatically, awakens the Spirit, vaporizes Phlegm, clears the Liver, relieves Fire toxicity, extinguishes Wind and stops tremors.","With Jiang Can, Tian Zhu Huang and Dan Nan Xing, for convulsions due to Phlegm-Heat.","With Quan Xie and Tian Zhu Huang, for convulsions and impaired consciousness in children due to extreme Heat.","With She Xiang, Gou Teng, Tian Zhu Huang and Quan Xie, for Liver Wind."]},{"herb":"TianZhuHuang","dosage":"37.5g","actions":["Clears and transforms Phlegm-Heat, clears Heat, cools the Heart and settles convulsions and tremors.","With Dan Nan Xing, for febrile convulsions in children with wheezing caused by Phlegm-Heat Blocking the Lungs.","With Jiang Can, for convulsions, delirium and loss of consciousness accompanied by cough and respiratory difficulty due to Wind, Heat and Phlegm, especially for childhood convulsions.",""]},{"herb":"ChuanBeiMu","dosage":"37.5g","actions":["Clears Heat, transforms Phlegm stops coughing and nourishes and moistens the Lungs."]},{"herb":"DanNanXing","dosage":"60g","actions":["Clears Heat, dissolves Phlegm, calms Wind and stops convulsions."]},{"herb":"SheXiang","dosage":"12g","actions":["Strongly opens the Orifices and Luo vessels, revives the Spirit and unblocks closed disorders.","With Niu Huang, Gou Teng and Dan Nan Xing, for loss of consciousness and convulsions secondary to fevers in children.","With Niu Huang, for coma due to Heat.","With Tian Zhu Huang and Zhu Sha, infantile convulsions."]},{"herb":"GouTeng","dosage":"24g","actions":["Extinguishes Wind, alleviates spasms, drains Liver Heat and pacifies Liver Yang."]},{"herb":"QuanXie","dosage":"37.5g","actions":["Extinguishes Wind and stops tremors and convulsions.","With Jiang Can, Tian Ma and Gou Teng, for facial paralysis due to Wind Stroke.","With Gou Teng, for seizures, convulsions spasms, tics, hemiplegia due to Wind-Stroke, numbness and pain in the limbs, and stubborn migraines or trigeminal neuralgia from Liver Wind or Liver Yang Rising.","With Jiang Can, for Wind-Dampness."]},{"herb":"TianMa","dosage":"37.5g","actions":["Extinguishes Wind, calms the Liver and stops spasms and tremors.","With Gou Teng, calms the Liver and extinguishes Wind.","With Gou Teng and Quan Xie, for acute infantile or childhood convulsions.",""]},{"herb":"JiangCan","dosage":"37.5g","actions":["Extinguishes Wind and stops spasms and convulsions.","With Tian Ma, Quan Xie and Dan Nan Xing, for convulsions with Phlegm and Fire."]},{"herb":"ZhuSha","dosage":"0.3-1.8g","actions":["Sedates the Heart, calms the Spirit, expels Phlegm and sedates jitteriness and convulsions while stopping tremors.","With Niu Huang and She Xiang, for disturbed consciousness or convulsions from high fevers.","With Gou Teng and Quan Xie, for childhood convulsions."]},{"herb":"DaHuang","dosage":"60g","actions":["Drains Heat, purges accumulations, drains Fire, clears Heat and eliminates Phlegm."]},{"herb":"ChenPi","dosage":"37.5g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"37.5g","actions":["Dries Dampness, descends Rebellious Qi and transforms Phlegm.","With Chen Pi, for a productive cough and a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Tian Zhu Huang, expels Wind and controls palpitations and convulsions for children's febrile convulsions from Phlegm-Heat, seizures and Wind-Stroke with profuse Phlegm making speech difficult."]},{"herb":"BaiBianDou","dosage":"37.5g","actions":["Clears Summerheat, resolves Dampness and strengthens the Spleen."]},{"herb":"TanXiang","dosage":"37.5g","actions":["Promotes movement of Qi, harmonizes the Middle Jiao and alleviates pain."]},{"herb":"MuXiang","dosage":"37.5g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen."]},{"herb":"ZhiKe(Qiao)","dosage":"37.5g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"ChenXiang","dosage":"37.5g","actions":["Promotes movement of Qi, alleviates pain, descends Qi, warms the Kidneys and aids the Kidneys in grasping Qi.","With Mu Xiang, for Rebellious Middle Jiao Qi."]},{"herb":"GanCao","dosage":"26.25g","actions":["Moderates spasms, alleviates pain, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Opens the Sensory Orifices","Arrests spasms and convulsions","Clears Heat","Transforms Phlegm"],"syndromes":["Phlegm-Fire Entering the Pericardium","Childhood convulsions"],"manifestations":{"symptoms":["Fever","Impaired consciousness","Childhood convulsions","Irritability","Restlessness","Wheezing","Nausea","Night crying","Vomiting milk","Diarrhea","Abdominal pain","Excessive secretion of mucus and saliva","Sounds of mucus in the throat","Fidgeting","Delirium","Dyspnea","Coughing with sputum"]},"conditions":[{"name":"Acute encephalitis"},{"name":"Acute meningitis"},{"name":"Measles"},{"name":"Scarlet fever"},{"name":"Diphtheria"},{"name":"Septicemia"},{"condition":"Epilepsy","name":"Pediatric seizure disorder"},{"condition":"Pregnancy","name":"Postpartum convulsions"},{"condition":"Epilepsy","name":"Seizure disorder"},{"condition":"Gastroenteritis","name":"Severe, acute gastroenteritis"},{"condition":"Epilepsy","name":"Epilepsy"},{"condition":"Pneumonia","name":"Pneumonia"},{"name":"Eclampsia"},{"condition":"Epilepsy","name":"Puerperal convulsions"},{"condition":"Dyspnea","name":"Dyspnea"}],"contra":{"contraindications":["Contraindicated during pregnancy.","Contraindicated for chronic childhood convulsions due to Spleen and Kidney Yang Deficiency."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"a stronger Heat-clearing, Liver pacifying effect","modifications":[{"herb":"ChaiHu","modification":"+ Rx. Bupleuri"},{"herb":"BoHe","modification":"+ Hb. Menthae"}]},{"purpose":"Shao Yang Pathogenic Heat","modifications":[{"herb":"HuangQin","modification":"+ Rx. Scutellariae"}]},{"purpose":"dysenteric diarrhea with pus","modifications":[{"herb":"ShanZha","modification":"+ Fr. Crataegi"}]},{"purpose":"bloody dysenteric diarrhea","modifications":[{"herb":"ShanZha","modification":"+ Fr. Crataegi"},{"herb":"DiYu","modification":"+ Rx. Sanguisorbae"}]},{"purpose":"watery diarrhea","modifications":[{"herb":"FuLing","modification":"+ Poria"},{"herb":"CheQianZi","modification":"+ Sm. Plantaginis"}]}]}