{"formula":"HuiYangJiuJiTang","names":{"pinyin":"hui yang jiu ji tang","hanzi":"回阳救急汤","english":"restore and revive the yang decoction","commonEnglish":"Restore and Revive the Yang Decoction","aka":[""]},"herbs":[{"herb":"ZhiFuZi","dosage":"9g","actions":["Restores Devastated Yang, rescues from rebellion, warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang and disperses Cold.","With Gan Jiang and Zhi Gan Cao, for cold extremities and diarrhea with undigested food due to Collapse of the Spleen and Kidney Yang.","With Ren Shen, for severe Deficiency of Source Qi and Collapse of Yang with cold extremities, sweating, weak breathing, dizziness and an extremely pale complexion.","With Bai Zhu and Gan Jiang, for Internal ascendance of Yin Cold leading to lack of arousal of Spleen Yang with abdominal pain and Cold with watery diarrhea.","With Rou Gui, for overabundant Yin leading Yang to float outward (separation of Yin and Yang).","With Fu Ling, for lower body edema and dysuria."]},{"herb":"GanJiang","dosage":"6g","actions":["Warms the Middle, rescues Devastated Yang and expels Interior Cold.","Withy Bai Zhu, for diarrhea due to Spleen Deficiency.","With Bai Zhu and Ren Shen, for Spleen Yang Deficiency with a cold abdomen, vomiting and diarrhea.","With Zhi Fu Zi, for debilitated Spleen and Kidney Yang with incessant diarrhea.","With Zhi Ban Xia, for vomiting of saliva or dry for heaves due to Cold-induced congested fluids.","With Zhi Ban Xia and Ren Shen, for vomiting due to Deficiency Cold.","With Fu Ling, Zhi Gan Cao and Bai Zhu, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]},{"herb":"RouGui","dosage":"3g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire.","With Zhi Fu Zi, for a cold, painful abdomen, anorexia, and diarrhea due to Kidney and Spleen Yang Deficiency."]},{"herb":"RenShen","dosage":"6g","actions":["Powerfully tonifies Yuan Qi.","With Zhi Fu Zi, for collapsed Qi and Devastated Yang with spontaneous sweat, ice cold extremities and shortness of breath.","With Bai Zhu, Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Zhi Ban Xia and Chen Pi , for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids.","With Zhi Fu Zi and Bai Zhu, for edema due to Spleen and Kidney Yang Deficiency."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, Dries Dampness and transforms Phlegm.","With Bai Zhu, for Anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Fu Ling and Zhi Ban Xia, for cough due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose, watery stools.","With Ren Shen, for vomiting due to Stomach Deficiency."]},{"herb":"WuWeiZi","dosage":"3g","actions":["Tonifies the Kidneys, astringes Jing, tonifies Qi and stops diarrhea and spermatorrhea.","With Ren Shen and Gan Jiang, for Lung Deficiency with chronic cough and wheezing."]}],"actions":["Rescues Yang (emergency)","Strengthens Qi","Generates the pulse"],"syndromes":["Extreme Yang Deficiency in Tai Yin, Shao Yin and Jue Yin"],"manifestations":{"symptoms":["Severe aversion to Cold","Body curled up","Icy cold extremities","Vomiting","Diarrhea","Absence of thirst","Abdominal pain","Lack of energy","A constant desire to sleep","Shivering","Foaming at the mouth","Lips and nails purplish"],"tongue":"Pale","tongueCoat":"White","pulse":"Deep and thready or Impalpable"},"conditions":[{"name":"Cardiac failure"},{"condition":"MyocardialInfarction","name":"Myocardial infarction"},{"name":"Shock "},{"name":"Acute gastroenteritis"},{"name":"Food poisoning "},{"condition":"AbdominalPain","name":"Abdominal pain "},{"condition":"Nebula","name":"Nausea/Vomiting"},{"name":"Prostration"},{"condition":"Diarrhea","name":"Diarrhea"},{"name":"Hypotension"},{"condition":"AbdominalCold","name":"Abdominal Cold "}],"contra":{"contraindications":["Do not take in large doses or for a long time.","Discontinue when the extremities have warmed up."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"vomiting or drooling of saliva","modifications":[{"herb":"WuZhuYu","modification":"+ Salt-fried Fr. Evodiae"},{"herb":"ShengMa","modification":"+ Rz. Cimicifugae"},{"herb":"HuangQi","modification":"+ Rx. Astragali"}]},{"purpose":"an impalpable pulse","modifications":[]},{"purpose":"constant diarrhea","modifications":[]},{"purpose":"constant vomiting","modifications":[{"herb":"ShengJiang","modification":"+ Rz. Zingiberis Recens"}]}]}