{"formula":"HuoLuoXiaoLingDanJiaWei","names":{"pinyin":"huo luo xiao ling dan jia wei","hanzi":"活絡效靈丹加味","english":"modified fantastically effective pill to invigorate the channels","commonEnglish":"Modified Fantastically Effective Pill to Invigorate the Channels","aka":[""]},"herbs":[{"herb":"ChiShao","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding and thick purple clots.","With Ru Xiang, Mo Yao, San Leng and E Zhu, for palpable abdominal masses."]},{"herb":"TaoRen","dosage":"15g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"RuXiang","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, invigorates the channels, reduces swelling, generates flesh and alleviates pain.","With Mo Yao, for traumatic injury pain, Blood Stasis obstructing the channels with epigastric, flank abdominal and joint pain, abdominal pain during menstruation, Wind-Cold-Damp Bi with numbness throughout the body and unresponsive extremities and chronic, ulcerated and non-healing sores."]},{"herb":"MoYao","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling, generates flesh, promotes healing and alleviates pain."]},{"herb":"SanLeng","dosage":"15g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and regulates menstruation."]},{"herb":"EZhu","dosage":"15g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, alleviates pain and dissolves accumulations.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]}],"actions":["Invigorates the Blood","Dispels Blood Stasis","Unblocks the collaterals","Alleviates pain"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible red spots","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"EctopicPregnancy","name":"Ectopic pregnancy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}