{"formula":"HuoXueTiaoJingTang","names":{"pinyin":"huo xue tiao jing tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates and nourishes the Blood, dispels Blood Stasis, clears Heat, soothes irritability, cools the Blood and reduces abscesses.","With Dang Gui, for irregular menstruation and retained lochia from Blood Stasis."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses.","With Chuan Xiong, and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Xiang Fu, for flank pain, abdominal pain and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"ZeLan","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis and regulates menstruation."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"ChongWeiZi","dosage":"3-15g","actions":["Invigorates the Blood and regulates the menses."]}],"actions":["Nourishes the Kidneys","Warms Yang","Replenishes Jing","Invigorates the Blood"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Delayed menstruation","Scanty and light-colored menses","Gradual amenorrhea","Occasional irregular menstruation","Infertility","Dizziness","Tinnitus","Aching and weak sensation in the loins and knees","A Cold sensation in the body","Cold limbs","Clear and profuse urine","Loose stools","Sexual frigidity","Obesity"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Deep and thin"},"conditions":[{"condition":"PolycysticOvarySyndrome","name":"Polycystic ovary syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}