{"formula":"HuoXueJieDuTang","names":{"pinyin":"huo xue jie du tang","hanzi":"活血解毒湯","english":"invigorate the blood and resolve toxicity decoction","commonEnglish":"Invigorate the Blood and Resolve Toxicity Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Tao Ren and Hong Hua, for amenorrhea, pain, swelling and other symptoms associated with Blood Stasis.","With Tao Ren, Hong Hua, Chuan Xiong and Chi Shao, for amenorrhea due to Blood Deficiency and Stagnation."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Dang Gui, Hong Hua and Tao Ren, for abdominal pain accompanying menstruation and headache from Blood Stagnation."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood, reduces swelling from sores and abscesses and inhibits the growth of cancer cells.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding, and thick purple clots.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"QuanXie","dosage":"5g","actions":["Attacks and relieves Fire toxins, dissipates nodules and rashes and inhibits the growth of cancer cells.","With Wu Gong, for toxic, swollen sores and scrofula."]},{"herb":"WuGong","dosage":"3g","actions":["Attacks and relieves Fire toxins, relieves abdominal masses, dissipates nodules, stops pain and inhibits the growth of cancer cells."]},{"herb":"TaoRen","dosage":"10g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses."]},{"herb":"HongHua","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation, alleviates pain and inhibits the growth of cancer cells.","With Tao Ren, Chuan Xiong, Chi Shao and Dang Gui, for menstrual pain or amenorrhea.","with Tao Ren, invigorates the Blood for all types of Blood Stagnation.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis."]},{"herb":"XiaKuCao","dosage":"15g","actions":["Clears Hot Phlegm, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"LianQiao","dosage":"10g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps, clears Blood Heat, promotes urination and inhibits the growth of cancer cells."]},{"herb":"SiGuaLuo","dosage":"10g","actions":["Resolves toxicity, reduces swelling and unblocks the channels and collaterals in the breast."]},{"herb":"GuaLou","dosage":"15g","actions":["Regulates Qi, reduces abscesses, clears Hot Phlegm, dissipates nodules and eliminates pus."]},{"herb":"ChenPi","dosage":"10g","actions":["Promotes the movement of Qi, dissipates clumps and stops pain."]}],"actions":["Clears Heat","Relieves toxicity","Invigorates the Blood","Breaks up Blood Stasis","Clears hot Phlegm","Dissipates nodules.","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat"],"manifestations":{"symptoms":["Tumor develops quickly","Fluid inside the breast with a lump inside it","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia"],"tongue":"Red","tongueCoat":"White or Yellow and greasy or Thick, sticky, dry and yellow","pulse":"Wiry or Rolling and rapid or Wiry, overflowing and rapid"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}