{"formula":"HuoXueZhiTongSan","names":{"pinyin":"huo xue zhi tong san","hanzi":"活血止通散","english":"powder for promoting blood circulation and arresting pain (topical)","commonEnglish":"Powder for Promoting Circulation and Arresting Pain","aka":[""]},"herbs":[{"herb":"TouGuCao","dosage":"30g","actions":["Invigorates Blood circulation, breaks up Blood Stasis, reduces swelling, generates flesh, dispels Wind and Dampness and relaxes the muscles and sinews."]},{"herb":"ChuanLianZi","dosage":"15g","actions":["Kills parasites, kills fungus and stops pain."]},{"herb":"DangGui","dosage":"15g","actions":["Invigorates and harmonizes the Blood and disperses Cold."]},{"herb":"HaiTongPi","dosage":"15g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, treats itching skin lesions and kills parasites."]},{"herb":"JiangHuang","dosage":"15g","actions":["Invigorates the Blood, eliminates Blood Stasis, promotes the movement of Qi, opens the channels and collaterals to alleviate pain and reduces swelling.","With Hai Tong Pi, Qiang Huo, and Dang Gui Wei, for Bi syndrome."]},{"herb":"WeiLingXian","dosage":"15g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain, especially in the upper joints.","With Niu Xi, for Wind-Damp Bi causing joint pain, especially in the lower joints."]},{"herb":"NiuXi","dosage":"15g","actions":["Invigorates the Blood and expels Blood Stasis."]},{"herb":"QiangHuo","dosage":"15g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain."]},{"herb":"BaiZhi","dosage":"15g","actions":["Expels Wind, eliminates Dampness, dispels Cold, alleviates pain, reduces swelling, eliminates toxins and expels pus.","With Qiang Huo, for Wind-Cold Dampness."]},{"herb":"SuMu","dosage":"15g","actions":["Invigorates Blood circulation, dispels Blood Stasis, reduces swellings, opens the channels and alleviates pain."]},{"herb":"WuJiaPi","dosage":"15g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys, strengthens the sinews and bones, transforms Dampness and reduces swelling."]},{"herb":"HongHua","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Su Mu, promotes the movement of Blood for trauma with pain and swelling."]},{"herb":"TuFuLing","dosage":"15g","actions":["Relieves toxicity, eliminates Dampness, benefits the joints and clears Damp-Heat from the skin."]},{"herb":"ChuanJiao","dosage":"6g","actions":["Disperses Cold, dispels Dampness and kills parasites."]},{"herb":"RuXiang","dosage":"6g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels, alleviates pain, reduces swelling and generates flesh."]}],"actions":["Invigorates the Blood","Resolves masses","Subdues swelling","Stops pain"],"syndromes":["Cold-Damp"],"manifestations":{"symptoms":["Persistent purple colored nodules","Arthralgia","Symptoms are worse in Cold weather","Edema of the legs (severe cases)"],"tongue":"Pale","tongueCoat":"White and greasy","pulse":"Deep and weak or Slow"},"conditions":[{"condition":"Erythema","name":"Erythema nodosum"},{"name":"Chilblain"},{"name":"Corns"},{"name":"Dermatosclerosis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Decoct the ingredients and rinse the affected area with the decoction while it is still hot. Apply once or twice daily for 30 minutes at a time."],"modifications":[]}