{"formula":"HuoXueTongLuoTang","names":{"pinyin":"huo xue tong luo fa","hanzi":"活血通络拨","english":"invigorate the blood and unblock the vessels batch","commonEnglish":"Invigorate the Blood and Unblock the Vessels Batch","aka":[""]},"herbs":[{"herb":"CiShi","dosage":"10-30g","actions":["Anchors Liver Yang, calms the Spirit, benefits Yin, nourishes the Kidneys, augments the Liver and improves hearing and vision.","With Ju Hua, for cataracts and other retinal problems."]},{"herb":"ZhenZhu","dosage":"0.3-1g","actions":["Sedates the Heart, settles tremors and palpitations, clears the Liver and eliminates superficial visual obstructions."]},{"herb":"JiXueTeng","dosage":"9-20g","actions":["Invigorates and tonifies the Blood, invigorates the channels and relaxes the sinews."]},{"herb":"XuanShen","dosage":"7-30g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Sheng Di Huang, for Excess or Deficiency Heat patterns, late-stage febrile disease with irritability, thirst and constipation and Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue."]},{"herb":"GouQiZi","dosage":"5-18g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Ju Hua, for Liver and Kidney Deficiencies with Jing and Blood unable to rise and nourish the eyes with tinnitus, headache, and visual impairment."]},{"herb":"JuHua","dosage":"4.5-20g","actions":["Disperses Wind, clears Heat, calms the Liver, clears the eyes, calms the Liver Yang, extinguishes Wind, promotes the movement of Heart Qi and Blood and stimulates Blood circulation."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood and cools Heart Fire.","With Bai Shao, for Blood Deficiency Heat.","With Niu Xi, powerfully clears Deficiency Fire Blazing Upward with pain and swelling of the gums, epistaxis, hematemesis and other hemorrhage in the upper body."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin and descends Blood and Fire."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood, clears Liver Fire and relieves eye pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Bai shao, for Blood Deficiency Heat."]},{"herb":"ZeXie","dosage":"4.5-16g","actions":["Promotes urination, leaches out Dampness, settles Ministerial Fire in the Kidneys and drains Kidney Fire."]}],"actions":["Anchors Liver Yang","Calms the Spirit","Benefits Yin","Nourishes the Kidneys","Augments the Liver","Invigorates and tonifies the Blood","Clears Heat","Cools the Blood","Drains Kidney Fire"],"syndromes":["Kidney and Liver Yin Deficiencies with Empty Fire Rising"],"manifestations":{"symptoms":["Facial complexion pale and sallow","Both cheeks slightly red","Dizziness","Dry eyes","Blurred vision","Spots before the eyes","Numbness of limbs","Flaccid paralysis (Wei syndrome)","Weakness","Tinnitus","Deafness","Forgetfulness","Low back and knees sore and painful","Throat dry and painful","Five sole Heat","Low grade fever in the afternoon","Night sweats","Irritability","Stools difficult to pass","Constipation","Aching, soreness or weakness of low back","Aching in bones","Aching in leg and heel","Dry mouth","Thirst","Men: Spermatorrhea Premature ejaculation","Women: Irregular menses or Scanty menses or Amenorrhea Vaginal discharge","Dry throat, maybe recurrent sore throat","Dry stools and / or constipation","Urine short and red","Heightened libido","If Heart Fire also Flares: Frequent dreams Insomnia Palpitations","If Liver Yang also Rises: Dizziness Blurred vision"],"tongue":"Red","tongueCoat":"None","pulse":"Thready and rapid"},"conditions":[{"condition":"Arteriosclerosis","name":"Aorto-arteritis"},{"condition":"Raynaud'sDisease","name":"Raynaud's disease "},{"condition":"Vasculitis","name":"Vasculitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}