{"formula":"HuPoSan","names":{"pinyin":"hu po san","hanzi":"琥珀散","english":"succinum powder","commonEnglish":"Succinum Powder","aka":[""]},"herbs":[{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and regulates menstruation.","With Yan Hu Suo, for pain due to Blood Stasis."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulations leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"HuPo","dosage":"1.5-3g","actions":["Invigorates the Blood, dissipates Stasis and unblocks the menses.","With San Leng, E Zhu and Yan Hu Suo, for palpable, immobile masses and pain due to Blood Stasis."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Mu Dan Pi, for Blood Stasis disorders (amenorrhea, menstrual pain, traumatic injury)."]},{"herb":"LiuJiNu","dosage":"6-15g","actions":["Dispels Blood Stasis, unblocks menstruation, alleviates pain, reduces Food Stagnation and transforms accumulations."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood and dispels Blood Stasis."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain."]},{"herb":"WuYao","dosage":"3-10g","actions":["Promotes the movement of Qi, alleviates pain, warms the Kidneys and disperses Cold.","With Rou Gui, for abdominal pain, especially sensations of Cold and pain in the lower abdomen."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain."]}],"actions":["Expels Cold","Warms the channels","Invigorates the Blood"],"syndromes":["Cold Stagnation"],"manifestations":{"symptoms":["Pain and distention of the abdomen which is worse with pressure","Leukorrhea","Low back pain","A dark or pale and greenish complexion","Headache","Stiff neck","Aversion to Cold"],"tongue":"Dark red or Purplish maculae","tongueCoat":"White","pulse":"Deep and Choppy or Deep, retarder and tight"},"conditions":[{"condition":"Amenorrhea","name":"Amenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}