{"formula":"JiaJianWenBaoYin","names":{"pinyin":"jia jian wen bao yin","hanzi":"加減温胞饮","english":"modified warm the uterus drink","commonEnglish":"Modified Warm the Uterus Drink","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and treats diarrhea due to Spleen Qi Deficiency with Dampness Obstruction."]},{"herb":"GuiZhi","dosage":"3-10g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi, warms the Middle and directs Turbid Yin downward.","With Zhi Fu Zi, for chills, backache and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi."]},{"herb":"BaJiTian","dosage":"6-15g","actions":["Tonifies the Kidneys, strengthens Yang, disperses Wind-Cold-Damp and strengthens the sinews and bones, augments primal Yang, replenishes Yin water and is appropriate to treat impotence or spermatorrhea due to Kidney Jing Deficiency.",""]},{"herb":"DangShen","dosage":"6-14g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees, weakness of the legs which makes walking difficult and especially threatened miscarriage due to instability of the Chong and Ren channels.","With Xu Duan and Shan Yao, for habitual miscarriage."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, benefits the Kidneys and Spleen and astringes diarrhea.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency.","With Bu Gu Zhi and Du Zhong, for low back pain from Kidney Deficiency."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Kidney Yin and astringes Jing.","With Dang Shen, for Spleen and Kidney Deficiency with fatigue, weakness, anorexia and watery stools.",""]},{"herb":"QianShi","dosage":"8-30g","actions":["Strengthens the Spleen, stops diarrhea, stabilizes the Kidneys, astringes Jing, expels Dampness and stops discharge."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Bai Zhu, for Spleen Yang Deficiency with a cold, painful abdomen, vomiting and watery diarrhea."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, astringes urine, tonifies and warms Spleen Yang and stops diarrhea.","With Xiao Hui Xiang, for Kidney Yang Deficiency with clear, frequent, profuse urination or spermatorrhea or dysmenorrhea with lower back ache, late periods and coldness in the lower abdomen and Spleen Yang Deficiency or Stomach Cold with epigastric distention, anorexia, nausea, explosive diarrhea or unformed stools with gripping abdominal pain."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain."]},{"herb":"XiaoHuiXiang","dosage":"3-12g","actions":["Warms the Liver and Kidneys, expels Cold, alleviates pain, regulates Qi and harmonizes the Stomach."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang, increases the libido, dispels Wind-Cold-Dampness and warms and unblocks the flow of Yang Qi.","With Shan Yao, enhances its functions.","With Xian Mao, for chills, impotence with cold sperm, cold extremities and infertility."]},{"herb":"XianMao","dosage":"3-10g","actions":["Tonifies the Kidneys, strengthens Yang, expels Cold and eliminates Dampness.","With Du Zhong, for impotence, spermatorrhea and weakness and pain in the lower back and legs."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Expels Wind-Cold-Damp"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Continuous cramping pain in the abdomen","Pain is not severe","Pain is relieved by pressure","Edema of the feet","Urinary difficulty","Slight edema (primarily of the lower limbs)","Symptoms generally occur during pregnancy","Pale face","Fatigue","Heaviness of head","Lassitude","Lower abdominal pain","Dizziness","Tinnitus","Lumbago","Edema","Abdominal pain with edema during pregnancy due to Blood Deficiency and abnormal water circulation","Oliguria","Palpitations","Cold feet","Extreme coldness of the hands and feet","Vertigo","Weakness and numbness of lower back and legs during pregnancy or postpartum","Mal position of the fetus","Dysmenorrhea","Irregular menstruation","Right upper quadrant pain","Hepatomegaly","Anemia","Lack of energy","Sore back","Thirst with no desire to drink"],"tongue":"Pale or pink maybe petechiae on margin","tongueCoat":"Thin or Greasy white","pulse":"Deep and weak or Soft, floating, small and slow or Wiry and small or Wiry and rough"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"condition":"EdemaDuringPregnancy","name":"Edema with abdominal pain during pregnancy"},{"condition":"AbdominalPainDuringPregnancy","name":"Abdominal pain with edema during pregnancy"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}