{"formula":"JiaJIanSuHeTang","names":{"pinyin":"jia jian su he tang","hanzi":"加減苏荷汤","english":"modified perilla and mentha decoction","commonEnglish":"Modified Perilla and Mentha Decoction","aka":[""]},"herbs":[{"herb":"ZiSuYe","dosage":"15g","actions":["Promotes the movement of Spleen and Stomach Qi, harmonizes the Middle Jiao and relieves intestinal gas.","With Chuan Xiong and Dang Gui, harmonizes the Blood and disperses Blood Stasis."]},{"herb":"BoHe","dosage":"15g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat, relieves Stagnation of Liver Qi and expels turbid filth."]},{"herb":"DangGui","dosage":"21g","actions":["Tonifies, Invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, stops cough, treats dyspnea and alleviates pain.","With Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GanCao","dosage":"15g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity, moderates spasms, relieves abdominal pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ZeLan","dosage":"6g","actions":["Invigorates the Blood and dispels Blood Stasis."]},{"herb":"BaiZhi","dosage":"15g","actions":["Expels Wind and Dampness, unblocks the nasal passages, dispels Cold, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Chuan Xiong, for headache.","With Gan Cao, for Stomach ache and ulcer pain."]},{"herb":"HeShouWu","dosage":"15g","actions":["Tonifies the Liver and Kidneys and nourishes Blood and Jing."]},{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior and tonifies the Lung, promotes the discharge of pus, generates flesh, expels toxins, promotes urination and reduces edema.","With Dang Gui, for Qi and Blood Deficiency."]},{"herb":"BaiHe","dosage":"15g","actions":["Nourishes the Lung, and Stomach Yin and harmonizes the Middle Jiao."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"SanLeng","dosage":"6g","actions":["Forcefully breaks up Blood Stasis, regulates Qi and alleviates pain.","With E Zhu, for Qi, Blood and Food Stagnation."]},{"herb":"EZhu","dosage":"6g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With Mu Xiang, for Food Stagnation with abdominal distention, fullness and pain."]},{"herb":"YuJin","dosage":"3g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears Heat, cools the Blood, clears the Heart and Pericardium, opens the Orifices, benefits the Gallbladder and reduces jaundice."]},{"herb":"MuXiang","dosage":"3g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, prevents Stagnation, dispels Damp-Heat, harmonizes the Liver and Spleen and alleviates pain."]},{"herb":"DingXiang","dosage":"3g","actions":["Warms the Middle Jiao, relieves pain and descends Qi."]},{"herb":"WiJiaPi","dosage":"15g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys, transforms Dampness and reduces swelling."]},{"herb":"ShengJiang","dosage":"6g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Zi Su Ye, for vomiting and diarrhea from seafood poisoning.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]}],"actions":["Harmonizes the Middle Jiao","Tonifies, Invigorates and harmonizes the Blood","Tonifies Qi","promotes the movement of Qi"],"syndromes":["Gu Syndrome with Qi and Blood Deficiency and Qi and Blood Stagnation"],"manifestations":{"symptoms":["Fatigue","Loose stools","Poor appetite","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Scanty periods","Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Pale or Pale, thin and dry or Purple, possible purple or red spots","tongueCoat":"White","pulse":"Weak or Thin and choppy or Choppy or Wiry and choppy"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["If the patient becomes constipated after taking this formula, switch to Su He Tang."],"modifications":[]}