{"formula":"JiaJIanWenShenWan","names":{"pinyin":"jia jian wen shen wan","hanzi":"加減温肾囊","english":"modified warm the kidneys pill","commonEnglish":"Modified Warm the Kidneys Pill","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi and alleviates pain."]},{"herb":"BaJiTian","dosage":"6-15g","actions":["Tonifies the Kidneys and strengthens Yang."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Huang Qi, for Qi and Blood Deficiency."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Tonifies the Kidneys, strengthens Yang, nourishes Yin, astringes Jing and urine and benefits the marrow.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency."]},{"herb":"LuRong","dosage":"3-5g","actions":["Tonifies the Kidneys, strengthens Yang, regulates the Chong and Ren channels and stabilizes the Dai Channel.","With Shu Di Huang, for infertility and thin vaginal discharge due to Kidney Deficiency Cold.","With Dang Gui and Huang Qi, for Inconsolidation of the Chong and Ren channels with uterine bleeding.",""]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees, weakness of the legs which makes walking difficult and especially threatened miscarriage due to instability of the Chong and Ren channels.","With Xu Duan and Shan Yao, for habitual miscarriage.","With Gou Qi Zi, for low back pain."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies Kidney Yin and astringes Jing."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, stops uterine bleeding, calms the fetus and prevents miscarriage."]},{"herb":"GouQiZi","dosage":"5-18g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Shu Di Huang, Tu Si Zi and Du Zhong, for Dizziness, weakness, impotence, and spermatorrhea due to Kidney and Liver Yin and Blood Deficiency."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood."]},{"herb":"SheChuangZi","dosage":"3-30g","actions":["Warms and tonifies the Kidneys and strengthens Yang."]}],"actions":["Tonifies Kidney Yang","Nourishes Blood","Tonifies Qi","Nourishes the Chong and Ren channels","Nourishes the uterus"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Long term infertility or infertility in an older woman","Possibly a history of late menarche","Delayed menstruation with decreased and pale menses or","Infrequent menstruation","Irregular periods","Period either scanty or heavy","Prolonged menstrual cycle","Scanty, dark discharge at the end of menstruation","Amenorrhea","Loss of libido","Aches and weakness in the waist and legs","Back pain","Cold limbs","A dusky complexion","Dull-pale complexion","Increased clear urine","Loose stools","Dizziness","Fatigue","Tinnitus","Feeling cold","Depression","Cold limbs","Frequent urination","Long-drawn-out urination with a thin stream or dribbling","Back soreness","Pain and coldness in loin and knees","Severe lumbago","Cold sensation in the lower abdomen"],"tongue":"Pale, swollen and wet","tongueCoat":"White","pulse":"Deep and weak or Thin and soft or Deep and thready or Deep, thready and forceless or Deep and slow"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}