{"formula":"JiaKangPing","names":{"pinyin":"jia kang ping","hanzi":"甲亢平","english":"hyperthyroidism balance","commonEnglish":"Hyperthyroidism Balance","aka":[""]},"herbs":[{"herb":"TaiZiShen","dosage":"30g","actions":["Strengthens the Spleen, tonifies Qi and generates Body Fluids."]},{"herb":"MuLi","dosage":"30g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness and dissipates nodules.","With Xuan Shen, Xia Ku Cao and Zhe Bei Mu, for scrofula and lymphadenoma."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan Shen, for Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue.","With Xuan Shen and Mai Men Dong, for a dry throat, irritability, a red tongue and a fast thready pulse due to Devastated Yin with Blazing Fire and swelling of the throat and lymph nodes."]},{"herb":"GeQiao(HaiGeKe)","dosage":"12g","actions":["Clears Lung Heat, transforms Phlegm, descends Lung Qi, softens hardness and dissipates nodules."]},{"herb":"ShiHu","dosage":"12g","actions":["Nourishes Yin, clears Heat and generates fluids."]},{"herb":"ZheBeiMu","dosage":"12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules.","With Mu Li and Xuan Shen, for scrofula due to Phlegm-Fire with swelling and pain at multiple sites and nodules without abscess."]},{"herb":"XiaKuCao","dosage":"12g","actions":["Clears Hot Phlegm, dissipates nodules and treats hypertension.","With Zhe Bei Mu, cools and relieves toxicity to disperse and transform Phlegm and treat goiter, scrofula and swollen or inflamed lymph glands."]},{"herb":"MaiMenDong","dosage":"9g","actions":["Nourishes Yin, moistens the Intestines and generates Fluids.","With Sheng Di Huang and Xuan Shen, for thirst, constipation, irritability and a low-grade fever due to Stomach Yin Deficiency.","With Sheng Di Huang, for Hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"XuanShen","dosage":"9g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness and dissipates nodules.","With Mu Li and Zhe Bei Mu, for scrofula, goiter and other nodules due to Phlegm."]}],"actions":["Tonifies Qi","Nourishes Yin","Resolves Phlegm","Softens hardness","Dissipates nodulation"],"syndromes":["Qi and Yin Deficiency with Phlegm nodulation"],"manifestations":{"symptoms":["Neck enlargement","Nodulations","Exophthalmia","Lassitude","Fatigue","Shortness of breath","Dizziness","Tinnitus","Palpitations","Emaciation","Lack of strength","Dry, rough eyes","Possible distended feeling in eyes","A pale, lusterless face","Possible malar flush","Restless","Insomnia","Poor memory","Hand tremors","Dry, parched throat","Tasteless feeling in the mouth","Low back and knee soreness and","Weakness","Low grade fever","Five sole heat","Maybe profuse perspiration","Possible tremors of the hands and tongue","Scanty fluid intake","Abdominal distention after meal","Loose stools"],"tongue":"Red","tongueCoat":"Thin or Peeled","pulse":"Empty and rapid or Thready and rapid"},"conditions":[{"condition":"Hyperthyroidism","name":"Hyperthyroidism"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}