{"formula":"JianNingSan","names":{"pinyin":"jiang ning san","hanzi":"肩凝散","english":"frozen shoulder powder","commonEnglish":"Frozen Shoulder Powder","aka":[""]},"herbs":[{"herb":"JiangHuang","dosage":"15g","actions":["Invigorates the Blood, eliminates Blood Stasis, expels Wind, promotes the movement of Qi and opens the channels and collaterals to alleviate pain.","With Gui Zhi. for pain due to Wind-Cold-Bi with Blood Stasis, especially shoulder pain."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Jiang Huang, for congealed painful obstruction in either the upper or lower limbs."]},{"herb":"QiangHuo","dosage":"12g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"DangGui","dosage":"12g","actions":["Invigorates and harmonizes the Blood and disperses Cold.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"WangBuLiuXing","dosage":"6g","actions":["Promotes the movement of Blood and invigorates the channels."]},{"herb":"WaLengZi","dosage":"6g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation and alleviates pain."]},{"herb":"BaiHuaShe(QiShe)","dosage":"15g","actions":["Powerfully unblocks the channels, extinguishes Wind and dispels Wind from the sinews.","With Dang Gui Wei, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis.",""]},{"herb":"DiLong","dosage":"15g","actions":["Clears Heat and unblocks and promotes movement in the channels and collaterals."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain."]},{"herb":"WeiLingXian","dosage":"12g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain, especially in the upper joints."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood,d promotes the movement of Qi, expels Wind and alleviates pain.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"ShengDiHuang","dosage":"25g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"BaiJieZi","dosage":"12g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]}],"actions":["Dispels Wind-Cold-Damp","Moves Qi","Invigorates the Blood","Removes Blood Stasis","Stops pain"],"syndromes":["Wind-Cold-Damp Bi"],"manifestations":{"symptoms":["Acute shoulder pain with a cold, heavy sensation","Pain is worse on exposure to Cold, Wind and rainy weather","Pain improves with warmth","The pain is fixed and worse at night","Occasionally a swollen shoulder with restricted movement","Purplish or slightly blue facial complexion","Heaviness","Stiffness","Numbness of the fingers"],"tongue":"Pale or slightly purplish","tongueCoat":"White and greasy","pulse":"Wiry and tight or Slippery and wiry or Rough"},"conditions":[{"condition":"ScapulohumeralPeriarthritis","name":"Shoulder pain"},{"condition":"Osteoarthritis","name":"Osteoarthritis"},{"condition":"FrozenShoulder","name":"Frozen shoulder"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}