{"formula":"JianPiGuJingWan","names":{"pinyin":"jian pi gu jing wan","hanzi":"健脾固精丸","english":"fortify the spleen and secure jing pill","commonEnglish":"Fortify the Spleen and Secure Jing Pill","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao and augments Qi.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"HuangQi","dosage":"18g","actions":["Tonifies Qi and Blood.","With Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweating.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"ShanYao","dosage":"9g","actions":["Tonifies the Spleen, nourishes Kidney Yin and astringes Jing.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools.","With Qian Shi and Lian Zi, for Kidney Deficiency with diarrhea, spermatorrhea and vaginal discharge."]},{"herb":"LianZi","dosage":"9g","actions":["Tonifies the Spleen and Kidneys and astringes Jing.","With Shan Yao, Dang Shen and Bai Zhu, for Spleen Deficient diarrhea with a poor appetite."]},{"herb":"RouDouKou","dosage":"6g","actions":["Warms the Middle Jiao, regulates Qi and alleviates pain."]},{"herb":"QianShi","dosage":"9g","actions":["Strengthens the Spleen, stops diarrhea, stabilizes the Kidneys and astringes Jing.","With Lian Zi, for nocturnal emissions, premature ejaculation, or urinary incontinence due to the failure of the Kidney's storage functions.","With Lian Zi, Dang Shen, Fu Ling and Bai Zhu, for chronic diarrhea due to Spleen Deficiency.","With Fu Ling, for cloudy urine."]}],"actions":["Strengthens the Spleen","Benefits Qi"],"syndromes":["Spleen Qi Deficiency"],"manifestations":{"symptoms":["Spermatorrhea","Sallow complexion","Fatigue","Anorexia","Four limbs feel tired and heavy","Abdominal and epigastric distention after eating","Maybe acid regurgitation or vomiting","Loose stools","Shortness of breath"],"tongue":"Pale and flabby - may have teethmarks","tongueCoat":"White","pulse":"Even, forceless and deficient"},"conditions":[{"condition":"Spermatorrhea","name":"Spermatorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}