{"formula":"JianPiRunFuTang","names":{"pinyin":"jian pi run fu tang","hanzi":"健脾润肤汤","english":"strengthen the spleen and moisten the skin decoction","commonEnglish":"Strengthen the Spleen and Moisten the Skin Decoction","aka":[""]},"herbs":[{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"CangZhu","dosage":"12g","actions":["Strongly dries Dampness, tonifies the Spleen, clears Dampness from the Lower Jiao."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction and vaginal discharge.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"ChiShao","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Chuan Xiong and Dang Gui, for abscesses, boils, and trauma induced pain."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, softens the Liver and relieves pain.","With Gan Cao, regulates the relationship between the Liver and Spleen.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"DiFuZi","dosage":"12g","actions":["Clears Damp-Heat, promotes urination, expels Dampness and stops itching."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle relieves the diaphragm and dries Dampness.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drink."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen and augments Qi and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Strengthens the Spleen","Moistens the skin"],"syndromes":["Spleen Deficiency with Blood Dryness"],"manifestations":{"symptoms":["Extremely itchy patches with scales","Thickened skin with scratch lines","Hyperpigmentation"],"tongue":"Pale","tongueCoat":"White","pulse":"Thready and weak"},"conditions":[{"condition":"Eczema","name":"Eczema"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}