{"formula":"JianYangDan","names":{"pinyin":"jian yang dan","hanzi":"建陽丹","english":"build yang pills","commonEnglish":"Build Yang Pills","aka":["Vitality Pearls"]},"herbs":[{"herb":"ZhiFuZi","dosage":"3-15g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang, disperses Cold, counteracts the Internal consequences of an External Wind-Cold attack, treats overabundance of Yin fluids due to Deficiency Cold and Cold-Damp Bi.","With Gan Jiang and Gan Cao, for cold extremities and diarrhea with undigested food due to Collapse of the Spleen and Kidney Yang.","With Bai Zhu, for Spleen Yang Deficiency with a Cold, painful abdomen, vomiting and watery diarrhea and Wind-Damp Bi.","With Gan Jiang and Bai Zhu, for Internal ascendance of Yin Cold leading to lack of arousal of Spleen Yang with abdominal pain and Cold with watery diarrhea."]},{"herb":"BaiHe","dosage":"9-30g","actions":["Nourishes Stomach Yin, harmonizes the Middle Jiao, moistens the Lungs, clears Heat, stops cough, clears the Heart and calms the Spirit."]},{"herb":"HuangJing","dosage":"6-30g","actions":["Tonifies Spleen Qi, nurtures Stomach Yin, moistens Lung Yin, tonifies the Kidneys and strengthens Jing."]},{"herb":"CiWuJia","dosage":"9-30g","actions":["Tonifies the Spleen and Stomach Qi to aid transformation and transportation, warms the Kidneys to aid Yang in warming the Spleen, augments Heart Qi, calms the Shen, invigorates the Blood and unblocks the collaterals."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, stabilizes the Exterior and stops sweating.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat, treats bleeding due to Deficiency of Spleen Yang with hemafecia or hematuria and frequent diarrhea due to Spleen and Stomach Deficiency Cold."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao, rescues Devastated Yang, expels Interior Cold, warms the Lungs, transforms thin mucus, warms the channels,unblocks the pulse and stops bleeding.","With Huang Lian, for epigastric pain and distention, dysentery, indeterminate gnawing hunger, vague abdominal pain or discomfort, belching, and nausea.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang, dispels Wind-Cold-Dampness, warms and unblocks the flow of Yang Qi and strengthens the sinews and bones."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, tonifies and warms Spleen Yang and stops diarrhea."]},{"herb":"GanCao","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"HuangLian","dosage":"3-10g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and stops bleeding."]}],"actions":["Tonifies the Spleen, Lungs and Kidneys","Warms Yang"],"syndromes":["Yang Deficiency"],"manifestations":{"symptoms":["Chills","Cold limbs","Inability to get warm","Loose stools","Profuse clear urine","Spontaneous sweating","Lassitude"],"tongue":"Pale","tongueCoat":"White","pulse":"Slow, deep and weak"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}