{"formula":"JianPiWan","names":{"pinyin":"jian pi wan","hanzi":"健脾片","english":"strengthen the spleen pill","commonEnglish":"Strengthen the Spleen Pill","aka":["Ginseng Stomachic Pills"]},"herbs":[{"herb":"BaiZhu","dosage":"15-75g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Sha Ren and Ren Shen, for Spleen and Stomach Deficiency.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"FuLing","dosage":"10-60g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Ren Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools.","With Mu Xiang, for diarrhea and borborygmus due to Dampness."]},{"herb":"RenShen","dosage":"10-45g","actions":["Tonifies Spleen and Stomach Qi.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue."]},{"herb":"DangShen","dosage":"(20-90g)","actions":["(Tonifies the Middle Jiao and augments Qi - Substitutes for Ren Shen.)","(With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.)"]},{"herb":"ShanYao","dosage":"10-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin and stops diarrhea.","With Bai Zhu and Fu Ling, for Spleen Deficiency with loose watery stools.","With Dang Shen, for Spleen and Kidney Deficiency with fatigue, weakness, anorexia, and watery stools.","With Ren Shen and Bai Zhu, for decreased appetite and lack of energy due to Spleen Deficiency."]},{"herb":"RouDouKou","dosage":"5-30g","actions":["Astringes the Intestines, stops diarrhea, warms the Middle Jiao, regulates Qi and alleviates pain.","With Mu Xiang, for poor appetite, diarrhea, and Cold abdominal pain due to Spleen and Stomach Deficiency Cold leading to constrained Middle Jiao Cold.","With Sha Ren and Shan Zha, for loss of appetite and poor digestion."]},{"herb":"ShanZha","dosage":"10-30g","actions":["Reduces and guides out Food Stagnation, transforms accumulations and stops diarrhea.","With Shen Qu, for general indigestion and Food Stagnation."]},{"herb":"ShenQu","dosage":"10-30g","actions":["Reduces Food Stagnation, moves Qi,promotes digestion and harmonizes the Stomach.","With Bai Zhu and Dang Shen, for Food Stagnation and diarrhea due to Spleen Deficiency.","With Mu Xiang and She Ren, for abdominal pain associated with Food Stagnation.","With Mai Ya and Shan Zha, for abdominal distention, belching, diarrhea and anorexia due to Food Stagnation; indigestion and childhood nutritional impairment due to improper breast feeding."]},{"herb":"MaiYa","dosage":"10-30g","actions":["Reduces Food Stagnation, improves digestion and strengthens the Stomach.","With Shen Qu, dry-fried for indigestion due to Food Stagnation."]},{"herb":"MuXiang","dosage":"5-22.5g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, prevents Stagnation and alleviates pain.","With Bai Zhu, for anorexia with epigastric and abdominal pain and distention.","With Huang Lian, for dysentery and diarrhea, especially when accompanied by tenesmus and abdominal distention and discomfort.","With Sha Ren, Ren Shen and Bai Zhu, for anorexia and abdominal distention and fullness which improves with warmth applied locally."]},{"herb":"ChenPi","dosage":"5-30g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Dang Shen, Bai Zhu, Shen Qu, Mai Yan Shan Zha and Gan Cao, for indigestion."]},{"herb":"ShaRen","dosage":"3-30g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen.","With Bai Zhu and Dang Shen, for abdominal pain and diarrhea due to Dampness Obstructing the Spleen and Stomach and morning sickness.","With Chen Pi, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea; belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi and vomiting of unadulterated, or scanty but viscous fluids."]},{"herb":"HuangLian","dosage":"3-22.5g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Mu Xiang, for dysenteric disorders due to Damp-Heat Obstructing the Intestines.","With Mu Xiang and Bing Lang, for hot dysenteric disorders with Qi Stagnation and Damp-Heat in the Middle Jiao with intense tenesmus."]},{"herb":"GanCao","dosage":"3-22.5g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Ren Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi."]}],"actions":["Strengthens the Spleen","Harmonizes the Stomach","Reduces Food Stagnation","Stops diarrhea"],"syndromes":["Spleen and Stomach Qi Deficiency with Food Stagnation"],"manifestations":{"symptoms":["Reduced appetite","Difficulty digesting","Abdominal and epigastric bloating","Watery diarrhea","Loose stools"],"tongue":"Normal","tongueCoat":"Slightly yellow, greasy","pulse":"Deficient and frail"},"conditions":[{"condition":"Gastritis","name":"Chronic gastritis"},{"condition":"Colitis","name":"Chronic colitis"},{"condition":"Enteritis","name":"Chronic enteritis"},{"condition":"ChronicPancreatitis","name":"Chronic pancreatitis"},{"condition":"Diarrhea","name":"Diarrhea"},{"condition":"FetalRestlessness","name":"Fetal restlessness"},{"condition":"Indigestion","name":"Indigestion"},{"condition":"CeliacDisease","name":"Celiac disease "},{"condition":"Ulcer","name":"Duodenal ulcer "},{"condition":"CirrhosisOfTheLiver","name":"Cirrhosis of the Liver"},{"condition":"Anorxia","name":"Poor appetite"}],"contra":{"contraindications":["Contraindicated in acute cases of Food Stagnation from contaminated food or over consumption."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"lack of Heat symptoms","modifications":[{"herb":"HuangLian","modification":"- Wine-fried Rz. Coptidis"}]},{"purpose":"signs of Cold","modifications":[{"herb":"HuangLian","modification":"- Wine-fried Rz. Coptidis"},{"herb":"GanJiang","modification":"+ Rz. Zingiberis"}]},{"purpose":"nausea and vomiting","modifications":[{"herb":"ZhiBanXia","modification":"+ Rz. Pinelliae Preparatum"},{"herb":"RouDouKou","modification":"- Sm. Myristicae"},{"herb":"ShengJiang","modification":"+ Rz. Zingiberis Recens"},{"herb":"DingXiang","modification":"+ Flos Caryophylli"},{"herb":"BaiBianDou","modification":"+ Sm. Lablab"},{"herb":"YiYiRen","modification":"+ Sm. Coicis"},{"herb":"ZeXie","modification":"+ Rz. Alismatis"}]},{"purpose":"cases without diarrhea","modifications":[{"herb":"ZhiBanXia","modification":"+ Rz. Pinelliae Preparatum"}]},{"purpose":"daybreak diarrhea with symptoms of Food Stagnation","modifications":[]},{"purpose":"diarrhea as the main symptom","modifications":[]},{"purpose":"severe Damp Accumulation","modifications":[{"herb":"CheQianZi","modification":"+ Sm. Plantaginis"},{"herb":"ZeXie","modification":"+ Rz. Alismatis"}]},{"purpose":"Damp Stagnation","modifications":[{"herb":"GanCao","modification":"- Rx. Glycyrrhizae"},{"herb":"ZhiShi","modification":"+ Fr. Aurantii Immaturus"}]},{"purpose":"childhood malnutrition","modifications":[{"herb":"GanCao","modification":"- Rx. Glycyrrhizae"},{"herb":"RouDouKou","modification":"- Sm. Myristicae"},{"herb":"BingLang","modification":"+ Sm. Arecae"}]}]}