{"formula":"JianNingTang","names":{"pinyin":"jian ning tang","hanzi":"肩凝汤","english":"congealed shoulder decoction","commonEnglish":"Congealed Shoulder Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"12g","actions":["Tonifies Qi and Blood and relieves numbness and pain.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesia."]},{"herb":"DuZhong","dosage":"9g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang.","With Gou Qi Zi, for low back pain."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao, augments Qi, assists herbs that release the Exterior and nourishes the Blood.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain.","With Du Zhong, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees, weakness of the legs which makes walking difficult."]},{"herb":"TuSiZi","dosage":"9g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow and tonifies the Kidneys and Liver.","With Du Zhong,enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency."]},{"herb":"QiangHuo","dosage":"9g","actions":["Releases the Exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"LuRong","dosage":"9g","actions":["Tonifies the Kidneys, strengthens Yang, tonifies the DU Channel, strengthens Jing and Blood, strengthens the sinews and bones and benefits marrow."]},{"herb":"GouQiZi","dosage":"9g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin."]},{"herb":"HeShouWu","dosage":"9g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and nourishes Jing."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"ShanZha","dosage":"9g","actions":["Reduces Food Stagnation, transforms Blood Stasis and invigorates Blood circulation."]},{"herb":"ShenJinCao","dosage":"9g","actions":["Dispels Wind, eliminates Dampness, relaxes the sinews, invigorates the collaterals and invigorates the Blood."]},{"herb":"GuYa(DaoYa)","dosage":"9g","actions":["Reduces Food Stagnation, promotes digestion, strengthens and descends Qi, opens the Stomach and harmonizes the Center."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Tonifies Qi and Blood","Nourishes the Liver and Kidneys","Expels Wind-Cold-Damp","Invigorates the Blood"],"syndromes":["Wind-Cold-Damp Bi with Qi, Blood, Liver and Kidney Deficiency"],"manifestations":{"symptoms":["Chronic pain, weakness and numbness (especially in the lower extremities) due to Windstroke","Muscle spasms","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion","Dizziness","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Scanty periods","Low back and knee pain","Tinnitus","Cramps","Heaviness and pain in the lower back and legs","Fixed or migrating pain in the bones in the bones and joints with reduced range of motion","Long-term numbness or paralysis in the hands and feet","Fatigue","Loose stools","Anorexia","Blurred vision","Depression"],"tongue":"Normal or Pale","tongueCoat":"Thin, white and dry or White and moist","pulse":"Empty or Thready and rapid or Weak"},"conditions":[{"condition":"ScapulohumeralPeriarthritis","name":"Chronic scapulohumeral periarthritis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}