{"formula":"JiaoAiBaZhenTang","names":{"pinyin":"jiao ai ba zhen tang","hanzi":"膠艾八珍湯","english":"eight treasures decoction with mugwort leaf and ass","commonEnglish":"Eight Treasures Decoction with Mugwort Leaf and Ass-Hide Gelatin","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"6-27g","actions":["Tonifies the Middle Jiao , augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude.","With Bai Zhu, Dang Gui, Bai Shao and Zhi Gan Cao, for Qi and Blood Deficiency."]},{"herb":"BaiZhu","dosage":"3-12g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Shu Di Huang and Bai Shao, for restless fetus due to Blood Deficiency, often with palpitations.","With Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency.","With Fu Ling and Sheng Jiang, for edema with Kidney Yang Deficiency.","With Shu Di Huang, Dang Gui and Bai Shao, for unstable pregnancy with Blood Deficiency."]},{"herb":"FuLing","dosage":"3-15g","actions":["Dries Dampness and strengthens the Spleen.","With Dang Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"GanCao","dosage":"1.5-6g","actions":["Augments Qi, ,warms and strengthens the Middle Jiao and moderates and harmonizes the harsh properties of other herbs.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Dang Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi."]},{"herb":"ShuDiHuang","dosage":"3-18g","actions":["Strengthens the Liver and Kidneys, and nourishes the Yin of the Blood.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Bai Shao, Dang Gui and Chuan Xiong, for anemia.","With Dang Shen, Bai Zhu, Fu Ling, Dang Gui and Bai Shao, for anemia with fatigue and weakness."]},{"herb":"BaiShao","dosage":"3-15g","actions":["Tonifies Blood and preserves Yin.","With Shu Di Huang, strongly tonifies Liver Blood.","With Shu Di Huang and Dang Gui, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies and invigorates the Blood, moistens the Intestines and regulates the relationship between the Liver and Kidneys.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Bai Shao and Fu Ling, for diarrhea during pregnancy with mild abdominal pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Dang Shen, Bai Zhu, Shu Di Huang and Bai Shao, for general menstrual disorders with fatigue and weakness due to Qi and Blood Deficiency."]},{"herb":"ChuanXiong","dosage":"3-9g","actions":["Invigorates the Blood, activates Qi, releases constraint and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Dang Gui, Shu Di Huang and Bai Shao, for headache from Blood Deficiency."]},{"herb":"AiYe","dosage":"3-10g","actions":["Warms the channels, warms the womb, stops bleeding.","With E Jiao, for prolonged uterine bleeding and menorrhagia.","With E Jiao and Bai Shao, for excessive loss of Blood and profuse bleeding due to Deficiency Cold."]},{"herb":"EJiao","dosage":"3-16g","actions":["Nourishes the Blood and stops bleeding.","With Dang Shen and Dang Gui, for Blood Deficiency with dizziness and palpitations.","With Bai Shao, Shu Di Huang, Ai Ye and Zhi Gan Cao, for hypermenorrhea, uterine bleeding, bleeding during pregnancy or bleeding after miscarriage."]},{"herb":"ShengJiang","dosage":"1-3g","actions":["Regulates the Spleen and Stomach.","With Da Zao, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, harmonizes the Ying and Wei, Nourishes the Blood, prevents injury from harsh Blood movers and assists the movement of Qi."]},{"herb":"DaZao","dosage":"1.5-5g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Dang Shen, Bai Shao and Fu Ling, for weakness and lassitude due to Spleen and Stomach Deficiency.","With Sheng Jiang, enhances the effects of other Qi and Blood tonifying herbs by facilitating their digestion and absorption."]}],"actions":["Tonifies Qi","Nourishes the Blood"],"syndromes":["Spleen Qi Deficiency Not Governing the Blood"],"manifestations":{"symptoms":["Excessive menstruation (menorrhagia)","Abdominal pain","Uterine bleeding (metrorrhagia)","Menstruation with constant spotting","Postpartum bleeding","Bleeding during pregnancy","The Blood is pale and thin without clots","Weakness","Sore lower back","Post abortion bleeding","Dull complexion","Weakness and pain of the legs","Whole body heavy and lethargic","Wants to lie down","Poor appetite","Palpitations","Dry mouth","Sallow complexion","Loss of taste","Light red, unelevated and indistinct eruptions"],"tongue":"Pale","tongueCoat":"Thin and white or Whitish and moist","pulse":"Thready and weak"},"conditions":[{"condition":"Menorrhagia","name":"Menorrhagia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}