{"formula":"JiaWeiZiShengShenQiWan","names":{"pinyin":"jia wei zi sheng shen qi wan","hanzi":"加味資生腎氣丸","english":"modified bolus for benefitting patients and reinforcing the kidney","commonEnglish":"Modified Bolus for Benefiting Patients and Reinforcing the Kidney","aka":[""]},"herbs":[{"herb":"QingHao","dosage":"15g","actions":["Clears Damp-Heat and deficiency fevers.","With Zhi Bie Jia, for the final stages of a Warm febrile disease when the Yin Fluids have already been damaged and the pathogen still lurks deep within the Yin level with night fever with chills in the morning, the fever recedes without sweating, emaciation, rapid pulse and a red tongue with little coating."]},{"herb":"BieJia","dosage":"10g","actions":["Nourishes Yin and anchors Yang Invigorates the Blood, softens hardness and dissipates nodules.","With Di Gu Pi and Qing Hao, for afternoon fever, night sweats, and steaming bone disorder due to Yin Deficiency."]},{"herb":"CangZhu","dosage":"15g","actions":["Strongly dries Dampness, tonifies the Spleen and expels Wind-Dampness.","With Huang Bai, for skin lesions due to Wind-Dampness."]},{"herb":"HuangBai","dosage":"6g","actions":["Drains Kidney Fire, drains Fire and relieves Fire toxicity.","With Cang Zhu, eliminates Dampness and clears Heat for Damp-Heat sores."]},{"herb":"ChiXiaoDou","dosage":"15g","actions":["Promotes urination, reduces edema, clears Damp Heat, disperses Blood Stasis and reduces swelling and Fire toxicity.","With Dang Gui, resolves toxicity, disperses Blood and expels pus, for Lung or Large Intestine abscess."]},{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, promotes urination, reduces edema, promotes the discharge of pus, generates flesh and expels toxins."]},{"herb":"HanFangJi","dosage":"10g","actions":["Promotes urination, reduces edema especially in the lower body, expels Wind-Dampness and alleviates pain.","With Huang Qi, for Wind-Dampness with exterior Deficiency."]},{"herb":"DiGuPi","dosage":"10g","actions":["Cools the Blood and drains Yin Deficiency Fire."]},{"herb":"SanLeng","dosage":"30g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain."]},{"herb":"RenDongTeng","dosage":"30g","actions":["Clears Heat, resolves toxicity and dispels Wind-Dampness."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood and reduces abscesses."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge."]},{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","With Dang Gui, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"LianQiao","dosage":"10g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, promotes urination, reduces abscesses and dissipates clumps."]},{"herb":"PuGongYing","dosage":"10g","actions":["Reduces abscesses, dissipates nodules, clears Heat, resolves Dampness and relieves Fire toxicity.","With Jin Yin Hua and Zi Hua Di Ding, for all hot, painful, hard, and deep-rooted boils."]},{"herb":"ZiHuaDiDing","dosage":"10g","actions":["Clears Heat, relieves Fire toxicity and clears hot sores, internally and externally."]},{"herb":"QingDai","dosage":"6g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, disperses Stagnation and reduces swelling."]},{"herb":"WuMei","dosage":"10g","actions":["Astringes leakage of Lung Qi, stops sweat, stops coughs and alleviates pain."]},{"herb":"YuanZhi","dosage":"15g","actions":["Calms the Spirit, reduces abscesses and dissipates swellings.","With Pu Gong Ying, for breast abscesses, furuncles, boils and carbuncles."]}],"actions":["Clears Heat,","Relieves Fire toxicity","Clears Deficiency fevers","Nourishes Yin","Invigorates the Blood","Strongly dries Dampness","Softens hardness","Dissipates nodules and swellings","Reduces abscesses"],"syndromes":["Toxic Heat with Yin Deficiency"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Local redness","Swelling and pain","A sensation of Heat in the chest","Five sole Heat","Constipation","Dry mouth and throat","Maybe fever and chills"],"tongue":"Normal","tongueCoat":"Thin white or yellow","pulse":"Rapid and forceful or Thready and rapid"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}