{"formula":"JiaWeiHuoLuoDan","names":{"pinyin":"jia wei huo luo dan","hanzi":"加味活络丹","english":"augmented invigorate the channels pill","commonEnglish":"Augmented Invigorate the Channels Pill","aka":[""]},"herbs":[{"herb":"ZhiChuanWu","dosage":"1.5-9g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain."]},{"herb":"ZhiCaoWu","dosage":"1.5-8g","actions":["Disperses Cold, scours out Wind, overcomes Dampness and stops pain."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves the discomfort of painful obstruction.","With Zhi Chuan Wu and Zhi Cao Wu, for Bi syndrome."]},{"herb":"SangZhi","dosage":"9-15g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, benefits the joints and stops spasms.","With Gui Zhi, for pain in the upper extremities."]},{"herb":"DuHuo","dosage":"3-10g","actions":["Dispels Wind-Dampness and alleviates pain.","With Sang Ji Sheng, Du Zhong and Dang Gui, for Wind-Dampness in a patient with underlying Kidney Deficiency, with low back and knee pain and stiffness.","With Fang Feng, for numbness in the legs."]},{"herb":"SangJiSheng","dosage":"9-30g","actions":["Tonifies Liver and Kidney Yin, strengthens the sinews and bones and expels Wind-Dampness.","With Du Zhong, Du Huo and Chuan Niu Xi, for low back and leg pain due to Kidney Qi Deficiency."]},{"herb":"JiXueTeng","dosage":"9-20g","actions":["Invigorates and tonifies the Blood, activates the channels and relaxes the sinews."]},{"herb":"ChuanNiuXi","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, expels Wind, drains Dampness, tonifies the Kidneys and Liver and strengthens the tendons and bones."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Gui Zhi and Dang Gui, for generalized pain that is more intense in the extremities from Wind-Cold entering the collaterals."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals.","With Dang Gui and Bai Shao, for Blood Deficiency with hemiplegia, especially with excess muscle tension in the upper extremities."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain."]},{"herb":"RenShen","dosage":"1-9g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Gui Zhi and Qin Jiao, for Wind-Damp Bi.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Du Huo and Qin Jiao, for chronic Bi Syndrome with injury to Qi and Blood leading to spasms of the extremities.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and aids the smooth flow of Qi and Blood.","With Gui Zhi, Qin Jiao and Du Huo, for Damp-Cold back pain with sore, swollen feeling and localized coldness that is exacerbated by exposure to Cold and accompanied by a deep, slow pulse and a white, greasy tongue coat."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Qi Jiao, for Wind Damp Bi with spasms of the tendons or numbness of the limbs and pain due to Wind-Dampness in patients with Blood Deficiency."]}],"actions":["Warms and opens the channels and collaterals","Dispels Cold and Dampness","Moves Qi","Invigorates the Blood","Relieves pain"],"syndromes":["Wind-Cold-Damp Bi"],"manifestations":{"symptoms":["Sciatica pain","The pain is intense and moves around","Swollen painful joints (especially lower limbs)","Joints are warm to the touch (may be burning and swollen)","The pain is worse at night","Reduced range of motion","Joint degeneration or deformity in the lumbar region","Chills","Anhidrosis","Weight loss","Shortness of breath","Muscular atrophy","Difficulty walking and moving","Thirst","Hemiplegia","Rigidity of the limbs","Headache","Dizziness","Vertigo","Nausea","Vomiting","Edema","Emaciation","Swollen feet","Numbness of the extremities","Paralysis","Fatigue"],"tongue":"Normal","tongueCoat":"White and greasy or Thin, yellow and greasy","pulse":"Wiry and slippery or Slippery and rapid"},"conditions":[{"condition":"Osteoarthritis","name":"Arthritis"},{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"LowBackPain","name":"Lumbago"},{"condition":"Sciatica","name":"Sciatica"},{"condition":"PostStrokeParalysis","name":"Post-stroke paralysis"},{"condition":"Parylysis","name":"Paralysis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}