{"formula":"JiaWeiPingWeiSan","names":{"pinyin":"jia wei ping wei san","hanzi":"加味平胃散","english":"modified calm the stomach powder","commonEnglish":"Modified Calm the Stomach Powder","aka":["Modified Magnolia and Ginger Formula","Modified Powder for Regulating the Function of the Stomach","Modified The Stomach Neutralizing Powder"]},"herbs":[{"herb":"CangZhu","dosage":"4-15g","actions":["Dispels Lower Jiao Dampness and strengthens the transporting function of the Spleen.","With Hou Po, dries Dampness and tonifies the Spleen.","With Hou Po and Chen Pi, for epigastric fullness, fatigue and discomfort, anorexia, vomiting and/or diarrhea with a turbid, greasy tongue due to Dampness Obstructing the Middle Jiao.","With Da Zao, for chronic accumulation of Dampness in the Spleen with hypochondriac pain, acid reflux and anorexia."]},{"herb":"MaiYa","dosage":"9-30g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi."]},{"herb":"HouPo","dosage":"3-12g","actions":["Circulates Qi, dispels Dampness, disperses fullness and warms and invigorates the Spleen.","With Chen Pi, revives the Spleen and increases the appetite.","With Cang Zhu, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat.","With Cang Zhu and Chen Pi, for Stomach Excess.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi."]},{"herb":"ChenPi","dosage":"3-12g","actions":["Regulates Qi, transforms Dampness and assists Hou Po in descending Qi and eliminating distention.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi and Cold-Dampness Obstructing the Middle with nausea and hiccup.","With Xiang Fu, for chest, epigastric and abdominal pain, distention and discomfort due to Dampness and Qi Obstruction.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation.","With Sha Ren, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea; belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi and vomiting of unadulterated or scanty but viscous fluids."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis."]},{"herb":"ShaRen","dosage":"3-7g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen,stops vomiting, warms the Middle and stops diarrhea.","With Cang Zhu, for Cold-Damp induced diarrhea and dysentery.","With Hou Po, for Constrained Dampness with Qi Stagnation leading to distention and fullness in the epigastrium and abdomen."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Cang Zhu, for indigestion, pain and distention in the flanks and abdomen, nausea, vomiting, and acid regurgitation."]},{"herb":"GanCao","dosage":"1-6g","actions":["Tonifies the Spleen and augments Qi and moderates and harmonizes the properties of other herbs."]},{"herb":"DaZao","dosage":"1-5g","actions":["Strengthens the Spleen, tonifies Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ShengJiang","dosage":"1-3g","actions":["Disperses Cold, warms the Middle and stops vomiting.","With Da Zao, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, protects Stomach Qi and reduces irritation of the gastrointestinal. tract by other herbs."]}],"actions":["Strengthens the Spleen and Stomach","Harmonizes the Middle Jiao","Relieves Food Stagnation"],"syndromes":["Damp Stagnation in the Spleen and Stomach","Food Stagnation"],"manifestations":{"symptoms":["Indigestion","A sensation of oppression in the chest","Abdominal pain","Nausea","Vomiting","Diarrhea","Postpartum abdominal fullness and distention","Abdominal fullness and distention with nausea and vomiting"],"tongue":"Pale and swollen","tongueCoat":"Thick, white and greasy","pulse":"Slippery and even or Slow or Moderate"},"conditions":[{"condition":"Indigestion","name":"Indigestion"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"condition":"Ulcer","name":"Gastric and duodenal ulcer "},{"condition":"AbdominalPain","name":"Abdominal pain "},{"condition":"GastricNeurosis","name":"Gastric neurosis"},{"condition":"BadBreath","name":"Bad breath"},{"condition":"Gastroptosis","name":" Gastroptosis"},{"name":"Decreased or absent peristalsis "},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Diarrhea","name":"Diarrhea"},{"condition":"Obesity","name":"Obesity"}],"contra":{"contraindications":["Modify significantly for those with Yin or Blood Deficiency.","Use caution during pregnancy."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"more severe Food Stagnation","modifications":[{"herb":"ZhiShi","modification":"+ Fr. Aurantii Immaturus"}]},{"purpose":"nausea, vomiting and abdominal pain","modifications":[]},{"purpose":"Phlegm Accumulation with fullness and oppression","modifications":[]},{"purpose":"Spleen and Stomach Qi Deficiency","modifications":[{"herb":"/HerbFormulascopy/SiJunZiTang","modification":"+ Two-Cured Decoction Er Chen Tang"}]}]}