{"formula":"JiaWeiQiXiangWan","names":{"pinyin":"jia wei qi xiang wan","hanzi":"加減七香囊","english":"augmented seven aromatics pill","commonEnglish":"Augmented Seven Aromatics Pill","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"6g","actions":["Spreads Liver Qi and relieves Stagnation.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation."]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Chai Hu, for Qi Stagnation and menstrual irregularity.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis.","With Chai Hu and Bai Shao, for pain and distention in the chest and flanks.","With Mu Xiang, Xiang Fu and Sha Ren, for epigastric and abdominal pain, indigestion, vomiting and diarrhea due to Qi Obstruction of the Liver and Spleen.","With Sha Ren and Mu Xiang, for an ulcer and digestive disturbance."]},{"herb":"EZhu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With Mu Xiang, for Food Stagnation with abdominal distention, fullness and pain."]},{"herb":"ShaRen","dosage":"6g","actions":["Promotes the movement of Qi, aromatically transforms Dampness and strengthens the Spleen.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen."]},{"herb":"YiZhiRen","dosage":"9g","actions":["Warms the Kidneys and astringes Jing and urine."]},{"herb":"DingXiang","dosage":"6g","actions":["Warms the Middle Jiao, relieves pain, descends Qi, warms the Kidneys and assists Yang."]},{"herb":"MuXiang","dosage":"9g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen."]},{"herb":"FoShou","dosage":"9g","actions":["Spreads and regulates Liver Qi, harmonizes the Stomach, dries Dampness and strengthens the Spleen."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Chai Hu, for Flank pain due to Liver Qi Stagnation."]}],"actions":["Dredges the Liver","Regulates Qi","Alleviates pain"],"syndromes":["Liver Qi Stagnation"],"manifestations":{"symptoms":["Low back pain which tends to be irritated by stress or emotional upset","Severe distention with mild pain in the back","The pain often radiates to the lower abdomen or hypochondriac region","The pain is vague and distending","The pain may move from place to place or come and go","The pain is worse at dawn but better after getting up and moving around","Range of motion is only slightly affected","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Often accompanied by pain and distention hypochondrium and abdomen","Tenderness at the origin of the back muscles or ligaments","Muscular spasms on one side of the back or abdomen","Hypertonicity of the lower abdomen","Enduring standing is impossible","Tendency to sigh","Melancholy","Depression","Irritability","Nervousness","Insomnia","Headache","A poor appetite","Inappropriate anger","Irregular menses","Dysmenorrhea","Loose stools when nervous","Breast distention and pain before and during menses","Distending pain in the genital region"],"tongue":"Pink or Red or Dark or Pale","tongueCoat":"Thin and white or Thin and yellow","pulse":"Wiry or Wiry and thready or Deep and wiry or Wiry and rapid or Wiry and choppy"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Qi Stagnation transforming into Heat","modifications":[{"herb":"ZhiZi","modification":"+ 9g Fr. Gardeniae"},{"herb":"MuDanPi","modification":"+ 9g Cx. Moutan"},{"herb":"SangJiSheng","modification":"+ 9g Hb. Taxilli"},{"herb":"DuZhong","modification":"+ 9g Cx. Eucommiae"}]}]}