{"formula":"JiaWeiSiWuErChenTang","names":{"pinyin":"jia wei si wu er chen tang","hanzi":"加味四物二陈汤","english":"added flavors four things two aged decoction","commonEnglish":"Added Flavors Four Things Two Aged (Ingredients) Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9g","actions":["Invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis."]},{"herb":"ChiShao","dosage":"9-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood and relieves pain.","With Dang Gui and Chuan Xiong, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Xiang Fu, for flank pain, abdominal pain, and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"ChuanXiong","dosage":"9-15g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ShengDiHuang","dosage":"12-15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Mu Dan Pi, for residual Warm pathogen which has injured the Yin."]},{"herb":"ChenPi","dosage":"6-9g","actions":["Regulates Qi, adjusts the Middle, dries Dampness and transforms Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness and transforms Phlegm.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood and dispels Blood Stasis.","With Chi Shao, for Blood Stasis disorders."]},{"herb":"FuLing","dosage":"9-12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm."]},{"herb":"HaiZao","dosage":"9-15g","actions":["Reduces Phlegm, softens areas of hardness, promotes urination and reduces edema."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis."]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for Irregular menstruation and dysmenor-rhea due to Qi and Blood Stasis.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]}],"actions":["Eliminates Phlegm and Dampness","Invigorates the Blood","Promotes menstruation"],"syndromes":["Phlegm-Damp Accumulation with Blood Stagnation"],"manifestations":{"symptoms":["Light colored discharge leading to no period","Palpitations of the Heart","Shortness of breath","A fat, plump body","Profuse sputum","Epigastric fullness","Upper abdominal distention","Chest and epigastric tightness","Nausea","Vomiting with profuse phlegm","Increased vaginal discharge that is white and viscid","In general, the patient also is obese or has generalized edema","Lassitude","Lack of strength","Fatigue","Dizziness","Blurred vision","Puffy, yellowish complexion","Anorexia","Lumbar soreness","Edema and swelling","Profuse white colored vaginal discharge"],"tongue":"Pale and plump","tongueCoat":"White and greasy","pulse":"Slippery or Wiry and slippery or Deep, and/or small pulse"},"conditions":[{"condition":"Amenorrhea","name":"Amenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}