{"formula":"JiaZhuangXianAiTang","names":{"pinyin":"jia zhuang xian ai tang","hanzi":"甲状腺癌汤","english":"decoction for treating thyroid cancer","commonEnglish":"Decoction for Treating Thyroid Cancer","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan Shen, for Kidney Yin Deficiency with Fire Blazing."]},{"herb":"XuanShen","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire, relieves toxicity, softens hardness and dissipates nodules.","With Sheng Di Huang, for Excess or Deficiency Heat patterns."]},{"herb":"XiaKuCao","dosage":"15g","actions":["Clears Liver Fire, clears Hot Phlegm, dissipates nodules and inhibits the growth of cancer cells.","With Lian Qiao, removes toxicity.","With Chai Hu, for neck nodules due to Liver Qi Stagnation."]},{"herb":"HaiZao","dosage":"15g","actions":["Reduces Phlegm, softens areas of hardness and inhibits the growth of cancer cells.","With Mu Li, Gan Cao and Kun Bu, softens hard masses.","With Xia Ku Cao, Lian Qiao and Xuan Shen, for scrofula.","With Gan Cao, for goiter and scrofula.","With Kun Bu, for hyperthyroidism, hypothyroidism, goiter and scrofula."]},{"herb":"KunBu","dosage":"15g","actions":["Resolves Phlegm, softens Phlegm nodules and inhibits the growth of cancer cells."]},{"herb":"ChaiHu","dosage":"9g","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel.","With Qing Pi and Ju He, regulates Liver Qi.","With Qing Pi, Ju He, San Leng and Bai Jie Zi, relieves stagnation and disintegrates masses.","With Gan Cao, for upper right quadrant pain."]},{"herb":"QingPi","dosage":"9g","actions":["Spreads Liver Qi, breaks up Stagnation, dissipates accumulations, dries Dampness and transforms Phlegm.","With Bai Jie Zi, for coughing with chest and flank pain due to congested fluids.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"MuLi","dosage":"15g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"BaiJieZi","dosage":"9g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"SanLeng","dosage":"10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells."]},{"herb":"ChenPi","dosage":"15g","actions":["Promotes the movement of Qi, dissipates clumps and stops pain."]},{"herb":"HuangYaoZi","dosage":"9g","actions":["Resolves Phlegm, dissipates nodules, reduces masses, clears Heat, reduces toxicity and inhibits the growth of cancer cells.","With Hai Zao, Mu Li and Kun Bu, for thyroid swellings.","With Xia Ku Cao, for goiter."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps and inhibits the growth of cancer cells."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, resolves Phlegm, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Invigorates the Blood","Breaks up Stasis","Regulates Qi","Eliminates Phlegm","Dissolves hardness","Clears Heat","Relieves toxicity","Inhibits the growth of cancer cells"],"syndromes":["Qi, Blood and Phlegm stagnation with Toxic Heat"],"manifestations":{"symptoms":["Tumor develops quickly","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia","Facial color dark and dull","Emaciation","Sides and ribs distended on both sides (maybe with sharp pain)","Enlargement of the Liver and Spleen","Suffocating sensation in chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Anorexia","Edema","Abdominal distention","Chest and hypochondriac distention","Dizziness","Nausea","Vomiting","Thirst with no desire to drink","Maybe no thirst","Palpitations","Shortness of Breath"],"tongue":"Red or Varies from Normal to Dark purple (maybe purple spots on edge of tongue)","tongueCoat":"White or Yellow and greasy or Thick, sticky, dry and yellow","pulse":"Wiry or Rolling and rapid or Wiry, overflowing and rapid or Wiry, choppy and slow or Slippery, full and maybe wiry"},"conditions":[{"condition":"ThyroidCancer","name":"Thyroid cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}