{"formula":"JieDuSiWuTang","names":{"pinyin":"jie du si wu tang","hanzi":"解毒四物汤","english":"detoxifying four substances decoction","commonEnglish":"Detoxifying Four Substances Decoction","aka":[""]},"herbs":[{"herb":"HuangLian","dosage":"1.5-10g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Huang Qin and Zhi Zi, for high fever, irritability, dry mouth and throat, and dark urine due to Fire toxin in the three burners","With Sheng Di Huang, for insomnia and delirium due to unremitting Heat injuring the Ying level."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Huang Lian and Bai Shao, for Damp-Heat dysentery with fever and tenesmus.","With Zhi Zi, for irregular vaginal bleeding due to Liver Fire.","With Bai Shao, cools Heat and nourishes the Blood for calming the fetus which is disturbed by Heat and Liver Heat Attacking the Spleen and Stomach during pregnancy with nausea and vomiting."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Kidney Fire, drains Fire and relieves Fire toxicity.","With Zhi Zi, resolves constraint and directs Qi downward for clearing Heat and Fire from the Liver channel."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, eliminates irritability and drains Damp-Heat."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood Nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and relieves pain.","With Huang Qin and Huang Lian, for Damp-Heat dysenteric disorders.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]}],"actions":["Clears Heat,","Drains Dampness","Drains Fire","Resolves Fire toxicity","Invigorates the Blood","Promotes the movement of Qi","Nourishes the Blood","Regulates menstruation,"],"syndromes":["Damp-Heat"],"manifestations":{"symptoms":["Infertility","Failure to conceive after the last delivery","Irregular periods","Delayed periods","Constant spotting","White vaginal discharge","Pains in the loins","Abdominal pain which is worse with menstruation and fatigue","Low-grade fever","Premenstrual breast distention"],"tongue":"Red","tongueCoat":"White and sticky or Yellow and sticky","pulse":"Wiry and rapid"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}