{"formula":"JieDuXiYao","names":{"pinyin":"jie du xi yao","hanzi":"解毒洗药","english":"detoxifying lotion (topical)","commonEnglish":"Detoxifying Lotion","aka":[""]},"herbs":[{"herb":"PuGongYing","dosage":"30g","actions":["Reduces abscesses, dissipates nodules, clears Heat, resolves Dampness, relieves Fire toxicity and clears Heat in the Blood."]},{"herb":"KuShen","dosage":"12g","actions":["Clears Heat, dries Dampness, disperses Wind, kills parasites and stops itching."]},{"herb":"HuangBai","dosage":"12g","actions":["Drains Damp-Heat, drains Fire and relieves Fire toxicity."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat, relieves toxicity, reduces abscesses and dissipates clumps.","With Jin Yin Hua, for the initial-stage of Wind-Heat."]},{"herb":"MuBieZi","dosage":"12g","actions":["Resolves toxicity, reduces swellings and invigorates the Blood."]},{"herb":"JinYinHua","dosage":"9g","actions":["Clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","With Gan Cao, for toxic swellings and sores."]},{"herb":"BaiZhi","dosage":"9g","actions":["Expels Wind, eliminates Dampness, reduces swelling, eliminates toxins, expels pus and alleviates pain."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Chi Shao, for purpuric rash, hematemesis and Heat injuring the Ying and Xue levels."]},{"herb":"GanCao","dosage":"9g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Pu Gong Ying, internally or externally for abscesses or other toxic swellings.","With Pu Gong Ying, Jin Yin Hua and Lian Qiao, for Yang sores marked by redness, swelling and pain."]}],"actions":["Clears Heat","Resolves toxicity","Invigorates the Blood","Reduces swelling","Eliminates exudate"],"syndromes":["Damp-Heat (Topical)"],"manifestations":{"symptoms":["Pinpoint papules Papulovesicles Vesicles, some of which coalesce","Slight infiltration and severe, painful itching is likely","Maybe necrosis","Water blisters","The skin is rough and itchy","Local skin flushing","Skin erosion","Bleeding or exudation follows rupture of skin after scratching","Erythema","Burning Itching Pain"],"tongue":"Red","tongueCoat":"Thin and yellow or white or Sticky and yellow","pulse":"Soggy and rapid or Floating"},"conditions":[{"condition":"ContactDermatitis","name":"Contact dermatitis"},{"name":"Acute suppurative infections"},{"condition":"Erythema","name":"Erythema"},{"name":"Post-traumatic infections"},{"name":"Pyogenic dermatoses"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}