{"formula":"JiJiuWeiYangTang","names":{"pinyin":"ji jiu wei yang tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"12-30g","actions":["Strongly tonifies Yuan, Spleen, Lung, and Heart Qi.","With Zhi Fu Zi, for Collapsed Qi and Devastated Yang with spontaneous sweat, ice cold extremities, shortness of breath."]},{"herb":"ZhiFuZi","dosage":"6-30g","actions":["Restores Devastated Yang, rescues from rebellion, warms the Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Ren Shen, for severe Deficiency of the Source Qi and Collapse of Yang with cold extremities, sweating, weak breathing, dizziness, and an extremely pale complexion."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, rescues Devastated Yang, expels Interior Cold, warms the Lungs and transforms thin mucus.","With Bai Zhu and Ren Shen, for Spleen Yang Deficiency with a cold abdomen, vomiting, and diarrhea.","With Zhi Fu Zi, for Devastated Yang.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold."]},{"herb":"GanCao","dosage":"3-30g","actions":["Tonifies the Spleen and augments Qi.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, stabilizes the Exterior and stops sweating.","With Gan Jiang, eliminates Cold Dampness in the Spleen."]},{"herb":"HongHua","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, for all types of Blood Stagnation."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]}],"actions":["Restores Yang","Strongly tonifies Yuan Qi","Invigorates the Blood"],"syndromes":["Respiratory failure"],"manifestations":{"symptoms":["Respiratory failure",""]},"conditions":[{"condition":"RespiratoryFailure","name":"Respiratory failure "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}