{"formula":"JinLianZhongZiFang","names":{"pinyin":"jin lian zhong zi fang","hanzi":"金连种子方","english":"golden link seed formula","commonEnglish":"Golden Link Seed Formula","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire, alleviates pain and assists in the generation of Qi and Blood.","With Zhi Fu Zi, for Deficiency of Ming Men Fire with impotence or infertility.","With Zhi Fu Zi and Gan Jiang, for a cold, painful abdomen, anorexia and diarrhea due to Kidney and Spleen Yang Deficiency."]},{"herb":"LongGu","dosage":"9-16g","actions":["Settles anxiety and calms the Spirit."]},{"herb":"WuYao","dosage":"3-10g","actions":["Promotes the movement of Qi, alleviates pain, warms the Kidneys and disperses Cold.","With Rou Gui, for abdominal pain, especially sensations of Cold and pain in the lower abdomen.","With Wu Zhu Yu, for abdominal pain, vomiting, and diarrhea due to Spleen and Kidney Deficiency Cold.","With Dang Gui, disperses Cold and stops pain, for abdominal pain due to External Cold.","With Yi Zhi Ren, warms and contains the Kidney Qi so that it returns to its source and secures the urine to treat Lower Jiao Deficiency Cold with incontinence, urinary frequency or urinary dribbling."]},{"herb":"YiZhiRen","dosage":"3-10g","actions":["Warms the Kidneys, astringes Jing and urine, warms the Spleen, increases the appetite and stops diarrhea and salivation."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"ShiChangPu","dosage":"1.5-10g","actions":["Transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen and promotes the movement of Qi.","With Fu Shen, for forgetfulness and dulled senses."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi and alleviates pain.","With Gan Jiang, for acid reflux after meals due to Deficiency and Cold in the Stomach.","With Gan Jiang and Zhi Ban Xia, for abdominal pain, vomiting and acid regurgitation due to Stomach Cold."]},{"herb":"FuLing","dosage":"3-9g","actions":["Nourishes the Heart and calms the Shen."]},{"herb":"ChuanNiuXi","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the menses, tonifies the Kidneys and Liver and strengthens the tendons and bones."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels, soothes the sinews and collaterals and clears Deficiency Heat.","With Dang Gui and Bai Shao, for Blood Deficiency with hemiplegia, especially with excess muscle tension in the upper extremities."]},{"herb":"XiXin","dosage":"0.5-5g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Zhi Fu Zi, for Cold damage both Internal and External with aversion to Cold, headache and generalized body aches with aching joints.","With Zhi Fu Zi and Rou Gui, for abdominal pain, coldness of the lower extremities, a pale tongue and no thirst."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm.","With Zhi Ban Xia, for coughing due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain."]},{"herb":"ZhiBanXia.htm","dosage":"3-15g","actions":["Dries Dampness and transforms Phlegm.","With Xi Xin and Gan Jiang, for vomiting due to Cold with copious, frothy sputum with Cold signs and thin mucus in the Lungs.","With Gan Jiang and Wu Zhu Yu, for vomiting with clear signs of Cold in the Middle Jiao."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, regulates menstruation, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao, rescues Devastated Yang, expels Interior Cold, warms the Lungs and transforms thin mucus.","With Zhi Fu Zi, warms the Spleen and Kidneys, benefits Yang, and disperses Cold.","With Zhi Ban Xia, for vomiting of saliva or dry heaves due to Cold-induced congested fluids."]},{"herb":"ChuanJiao","dosage":"2-7g","actions":["Warms the Middle Jiao, disperses Cold, dispels Dampness, relieves diarrhea and alleviates pain.","With Zhi Fu Zi, for Cold-Dampness in either the Middle or Lower Jiao, Kidney Yang Deficiency with Deficiency of Ming Men Fire allowing Cold-Damp to accumulate in the Lower Jiao leading to urinary frequency, cold sweats or spermatorrhea and strengthens the warming effect on the Spleen, for Spleen Yang Deficiency with Cold-Dampness leading to Cold pain in the epigastrium, nausea, vomiting and diarrhea.","With Zhi Fu Zi and Gan Jiang, for diarrhea due to more Cold than Dampness."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Rou Gui, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees."]},{"herb":"MuLi","dosage":"9-30g","actions":["Heavily settles and calms the Spirit."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Transforms Phlegm","Expels Wind-Cold-Damp"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Continuous cramping pain in the abdomen","Pain is not severe","Pain is relieved by pressure","Edema of the feet","Urinary difficulty","Slight edema (primarily of the lower limbs)","Symptoms generally occur during pregnancy","Pale face","Fatigue","Heaviness of head","Lassitude","Lower abdominal pain","Dizziness","Tinnitus","Lumbago","Edema","Abdominal pain with edema during pregnancy due to Blood Deficiency and abnormal water circulation","Oliguria","Palpitations","Cold feet","Extreme coldness of the hands and feet","Vertigo","Weakness and numbness of lower back and legs during pregnancy or postpartum","Mal position of the fetus","Dysmenorrhea","Irregular menstruation","Right upper quadrant pain","Hepatomegaly","Anemia","Lack of energy","Sore back","Thirst with no desire to drink"],"tongue":"Pale or pink maybe petechiae on margin","tongueCoat":"Thin or Greasy white","pulse":"Deep and weak or Soft, floating, small and slow or Wiry and small or Wiry and rough"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"condition":"AbdominalPainDuringPregnancy","name":"Abdominal pain with edema during pregnancy"},{"condition":"EdemaDuringPregnancy","name":"Edema with abdominal pain during pregnancy"},{"condition":"Pregnancy","name":" Weakness and numbness of lower back and legs during pregnancy or postpartum "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}