{"formula":"JiShengZhuFuTang","names":{"pinyin":"ji sheng zhu fu tang","hanzi":"濟生术附汤","english":"atractylodes and prepared aconite decoction to aid the living","commonEnglish":"Atractylodes and Prepared Aconite Decoction to Aid the Living","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Gan Jiang, eliminates Cold Dampness in the Spleen."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Disperses Cold and Dampness, warms the channels, stops pain, warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Gan Jiang, counteracts the Internal consequences of an External Wind-Cold Attack and treats Cold-Damp Bi.","With Bai Zhu, for Spleen Yang Deficiency with a cold, painful abdomen, vomiting and watery diarrhea and treats Wind-Damp Bi.","With Bai Zhu and Gan Jiang, for the internal ascendance of Yin Cold leading to a lack of arousal of Spleen Yang with abdominal pain, Cold, and watery diarrhea."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and aids the smooth flow of Qi and Blood."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, warms the channels and dispels Wind-Dampness seeping into the Lower Jiao.","With Bai Zhu, for diarrhea due to Spleen Deficiency.","With Zhi Fu Zi, warms the Spleen and Kidneys, benefits Yang and disperses Cold."]}],"actions":["Dispels Wind","Warms Cold","Eliminates Dampness","Strengthens and warms the Spleen and Lungs"],"syndromes":["Cold Dampness in the Lower Jiao","Tai Yin Cold-Damp"],"manifestations":{"symptoms":["Chronic cold pain in the lower back and body with a heavy sensation","A preference for warmth","Pain worse in Damp weather","Pain radiating downward and to the lower limbs","Limited movement of the lower spine","Severe hardness and stiffness in the lumbar area with obvious tenderness","A cord-like, swollen sensation of the supraspinous ligament on palpation","A movable cord-like sensation at the origin of the sacro-spinal muscle","Pain and other symptoms worsen gradually","A long-lasting course of illness","A heavy sensation in the head","The lower back region feels Cold to the touch","The pain is a deep, unremitting ache","The pain may be occasionally be severe","Twisting and bending are difficult","The pain is aggravated by cold weather","Lying down provides no improvement","Stiffness which is worse on rainy days","Aversion to Cold","Cold extremities","Sciatica","Copious urination","Extreme heavy sensation in the lower back","Absence of thirst","Maybe headaches","Nausea","Loose stools","A poor appetite","Maybe general body aches","Spontaneous contracture of the limbs","Maybe a feverish sensation in the upper body","Craves hot drinks and compresses","Dizziness","Vomiting","Profuse, purulent leukorrhea with a foul odor"],"tongue":"Pale","tongueCoat":"White or Greasy and white at the root","pulse":"Deep, thready and moderate or Deep and slow or Moderate or Slippery and slow"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}