{"formula":"JiuWeiYaoTongFang","names":{"pinyin":"jiu wei yao tong fang","hanzi":"九委腰痛方","english":"nine","commonEnglish":"Nine-Ingredient Formula for Lower Back Pain","aka":[""]},"herbs":[{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, tonifies Kidney Yang and aids the smooth flow of Qi and Blood.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees and weakness of the legs which makes walking difficult."]},{"herb":"GouJi","dosage":"4.5-15g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, expels Wind-Dampness, relieves Bi syndrome, warms and stabilizes the Kidneys and prevents leakage.","With Dang Gui, for a long term disease leading to lower extremity swelling.","With Du Zhong and Niu Xi, for Liver and Kidney Yang Deficiency causing weak legs and pain, stiffness and motor impairment of the low back."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints.","With Du Zhong, for low back and extremity pain and weakness due to Bi pain or Kidney Deficiency."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain.","With Du Zhong and Niu Xi, for deficient Kidneys or Cold-Damp Bi causing low back and leg pain and weakness and contracture of the leg muscles.",""]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi, stops pain and disperses extravasation."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]}],"actions":["Invigorates the Blood","Strengthens the Kidneys","Stops pain"],"syndromes":["Traumatic Injury"],"manifestations":{"symptoms":["Back pain with a history of injury to the low back","The pain is often prickly ,fixed and/or severe","The pain is worse with exertion, movement and, in severe cases, breathing","the pain often gets worse at night","Limited movement","Difficulty turning the body or lying on the back","Fixed spine or soft tissue tenderness","Local redness and/or swelling","Muscular stiffness and spasms","Bruising","Swelling","Fatigued libs","Slight fever","Rest often relieves pain"],"tongue":"Dark with maculae","tongueCoat":"White","pulse":"Wiry or deep and choppy"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}