{"formula":"JiuWeiBingLangJiaWuFuTang","names":{"pinyin":"jiu wei bing lang jia wu fu tang","hanzi":"九味槟榔加吳茯湯","english":"areca nine decoction with evodia and poria","commonEnglish":"Areca Nine Decoction with Evodia and Poria","aka":["Semen Areca Combination"]},"herbs":[{"herb":"BingLang","dosage":"6-15g","actions":["Regulates Qi, reduces accumulations, unblocks the bowels and promotes urination.","With Zi Su Ye, Chen Pi and Sheng Jiang, for Wind-Damp Leg Qi."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"HouPo","dosage":"3-10g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm."]},{"herb":"MuXiang","dosage":"3-10g","actions":["Promotes the movement of Qi, dispels Damp-Heat, harmonizes the Liver and Spleen and","alleviates pain.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines.","With Bing Lang and Da Huang, for epigastric and abdominal fullness, distention, and pain with constipation."]},{"herb":"ZiSuYe","dosage":"3-10g","actions":["Releases the Exterior, disperses Cold and promotes the movement of Spleen and Stomach Qi."]},{"herb":"WuZhuYu","dosage":"3-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi, relieves Stagnation in the Liver channel and alleviates pain."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Releases the Exterior, assists Yang, releases the muscle layer and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Fu Ling, unblocks Yang and facilitates the removal of congested fluids.","With Wu Zhu Yu, for abdominal pain, dysmenorrhea and menstrual irregularity due to Cold from Deficiency in the Chong and Ren channels.","With Da Huang, removes Blood Stasis and unblocks the flow of Qi."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Mu Xiang, for diarrhea and borborygmus due to Dampness."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Drains Heat, purges accumulations, transforms Dampness, promotes urination, invigorates the Blood, dispels Blood Stasis and eliminates Phlegm."]},{"herb":"ShengJiang","dosage":"3-6g","actions":["Releases the Exterior, induces perspiration,","disperses Cold, warms the Middle, warms the Lungs and normalizes the flow of Qi at the center.","With Chen Pi, for Cold-Dampness Obstructing the Middle."]},{"herb":"GanCao","dosage":"1-3g","actions":["Moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dispels water accumulation","Disperses Qi and Blood Stagnation","Relieves constipation"],"syndromes":["Qi and Blood Stagnation with water accumulation in the legs"],"manifestations":{"symptoms":["Pitting edema","Numbness","Fatigue","Weakness in the legs","Palpitations","Distention beneath the Heart","Constipation","Dyspnea"],"tongue":"Blue purple maybe with purple or red spots","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"Hypertension","name":"Hypertension"},{"name":"Myocarditis"},{"condition":"CongestiveHeartFailure","name":"Congestive Heart failure"},{"name":"Beriberi"},{"condition":"Neurosis","name":"Neurosis"},{"condition":"Numbness","name":"Numbness"},{"condition":"Numbness","name":"Paresthesia"},{"condition":"Weakness","name":"Weakness"},{"condition":"Edema","name":"Pitting edema"},{"condition":"Neuritis","name":"Multiple neuritis"},{"condition":"Dyspnea","name":"Dyspnea"},{"name":"Basedow's disease "},{"condition":"Neuritis","name":"Neuritis"},{"condition":"Neurosis","name":"Cardiac neurosis"},{"condition":"Palpitations","name":"Palpitations"},{"condition":"Constipation","name":"Constipation"},{"condition":"Fatigue","name":"Fatigue"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}