{"formula":"JiXueFuZiNianTongTang","names":{"pinyin":"ji xue fu zi nian tong tang","hanzi":"鸡血附子撵痛汤","english":"spatholobi and aconite assuage pain decoction","commonEnglish":"Spatholobi and Aconite Assuage Pain Decoction","aka":[""]},"herbs":[{"herb":"JiXueTeng","dosage":"50g","actions":["Invigorates and tonifies the Blood, activates the channels and relaxes the sinews."]},{"herb":"RenDongTeng","dosage":"50g","actions":["Dispels Wind-Dampness, soothes the sinews, unblocks the channels and clears Damp-Heat from the Lower Jiao."]},{"herb":"CangZhu","dosage":"15g","actions":["Induces sweating, expels Wind-Dampness, strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao."]},{"herb":"JingJie","dosage":"15g","actions":["Releases the Exterior, expels Wind and relieves muscle spasms.","With Fang Feng and Qiang Huo, for External Wind-Cold with chills, fever and anhidrosis.",""]},{"herb":"FangFeng","dosage":"15g","actions":["Releases the Exterior, expels Wind-Dampness and alleviates pain.","With Jing Jie, for Wind-Cold and Exterior patterns in any season.","With Jing Jie and Qiang Huo, for Wind-Cold.","With Qin Jiao, for Wind Dampness Bi with spasms of the tendons or numbness of the limbs.","With Cang Zhu, for pain due to Wind-Dampness Bi with aching joints, heavy limbs and generalized aching discomfort.","with Qiang Huo, Du Huo and Wei Ling Xian, for painful obstruction.","with Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi."]},{"herb":"DuHuo","dosage":"15g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain.","With Fang Feng, for numbness in the legs.","With Qiang Huo, for joint pain and numbness."]},{"herb":"QiangHuo","dosage":"15g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Fang Feng, for Wind-Dampness.","with Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"GuiZhi","dosage":"15g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi.","With Qiang Huo, Du Huo, Wei Ling Xian and Fang Feng, for rheumatoid arthritis."]},{"herb":"QinJiao","dosage":"15g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals.","With Fang Feng, Du Huo and Qiang Huo, for Wind-Cold-Damp Bi.","With Du Huo, Gui Zhi and Zhi Fu Zi, for Cold Bi syndrome with pain and difficulty moving."]},{"herb":"WeiLingXian","dosage":"15g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain.","With Niu Xi, for Wind-Damp Bi causing joint pain."]},{"herb":"NiuXi","dosage":"15g","actions":["Invigorates the Blood and expels Blood Stasis."]},{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Gui Zhi and Qin Jiao, for Wind-Damp Bi.","With Chuan Xiong, Harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Chuan Xiong, Qiang Huo and Qin Jiao, for postpartum Bi syndrome."]},{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"ChiShao","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Chuan Xiong and Dang Gui, for abscesses, boils, and trauma induced pain.","With Ru Xiang and Mo Yao, for bruising, swelling, and pain from traumatic injury."]},{"herb":"RuXiang","dosage":"6g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels and alleviates pain.","With Mo Yao, for Blood Stasis obstructing the channels with epigastric, flank abdominal and joint pain."]},{"herb":"MoYao","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling.","With Ru Xiang, disseminates and unblocks the organs and dredges the channels and collaterals to treat epigastric, flank, abdominal and joint pain and Wind-Cold-Damp Bi with numbness throughout the body and unresponsive extremities.","With Qiang Huo and Qin Jiao, for joint pain due to Wind-Cold-Damp Bi."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Disperses Cold and Dampness, warms the channels and stops pain."]},{"herb":"ZhiChuanWu","dosage":"6g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain."]}],"actions":["Dispels Wind-Cold-Damp","Tonifies Qi","Warms the channels","Strengthens the tendons","Nourishes and Invigorates the Blood","Breaks up Blood Stasis","Eliminates Damp","Stops pain"],"syndromes":["Wind-Cold-Damp Bi with Blood Stasis"],"manifestations":{"symptoms":["Attacks of severe acute joint pain which is fixed in location, worse with Cold and better with warmth","Aversion to Wind, Cold and Dampness","Stiff and painful muscles and joints","Limited movement","Pain aggravated by Wind","Sensitive to climatic changes","Numbness of muscles","Pain aggravated by Dampness","Cold joints","Possible deformation and hardening of the joint with restricted movement","Maybe joint swelling without redness or Heat","Pain worse at night","Low back pain or soreness","Lumbago","Fatigue","Heaviness of the body","Heaviness of the muscles","Preference for warmth","Weak joints","Palpitations","Pale face","Shortness of breath","Preference for dry weather"],"tongue":"Pale or Purplish","tongueCoat":"Thin, white and greasy","pulse":"Thready and weak or Thready and slippery or Deep, slippery and wiry or Soft, moderate and wiry"},"conditions":[{"condition":"Gout","name":"Gout"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"marked Qi Deficiency","modifications":[{"herb":"CangZhu","modification":"- Rz. Atractylodis"},{"herb":"BaiZhu","modification":"+ 9g Rz. Atractylodis Macrocephalae"},{"herb":"HuangQi","modification":"+ 15g Rx. Astragali"},{"herb":"DangShen","modification":"+ 9g Rx. Codonopsis"},{"herb":"FuLing","modification":"+ 9g Poria"}]},{"purpose":"Phlegm Obstruction","modifications":[{"herb":"BaiJieZi","modification":"+ 9g Sm. Sinapis"},{"herb":"ZhiTianNanXing","modification":"+ 9g Rz. Arisaematis"}]},{"purpose":"Wind predominant with moving pain and itching and possible desquamation","modifications":[{"herb":"ChiShao","modification":"- Rx. Paeoniae Rubrum"},{"herb":"RuXiang","modification":"- Olibanum"},{"herb":"MoYao","modification":"- Myrrh"},{"herb":"CangErZi","modification":"+ 12g Fr. Xanthii"}]},{"purpose":"Cold predominant with fixed pain and difficult movement","modifications":[{"herb":"XuChangQing","modification":"+ Rx. Cynanchi"},{"herb":"RenDongTeng","modification":"- Caulis Lonicerae"},{"herb":"ChiShao","modification":"- Rx. Paeoniae Rubra"},{"herb":"XiXin","modification":"+ Hb. cum Rx. Asari"},{"herb":"HaiFengTeng","modification":"+ 9g Caulis Piperis Kadursae"},{"herb":"JingJie","modification":"- Hb. Schizonepetae"}]},{"purpose":"Damp predominant with swollen, painful, heavy joints and worsening symptoms in rainy or damp weather","modifications":[{"herb":"HanFangJi","modification":"+ 9g Rx. Stephaniae Tetrandrae"},{"herb":"BeiXie","modification":"+ 9g Rz. Dioscoreae Hypoglaucae"},{"herb":"TuFuLing","modification":"+ 9g Rz. Smilacis Glabrae"}]}]}