{"formula":"JiZhengXueAiTangErHao","names":{"pinyin":"ji zheng xue ai tang er hao","hanzi":"急症血癌湯二号","english":"acute leukemia decoction #2","commonEnglish":"Acute Leukemia Decoction #2","aka":[""]},"herbs":[{"herb":"DaHuang","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, drains Heat, purges accumulations, cools the Blood, reduces Fire toxicity and inhibits the growth of cancer cells.","With Sheng Di Huang, for Deficiency Fire.","With Gan Cao, for vomiting immediately after eating."]},{"herb":"MuDanPi","dosage":"3g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Sheng Di Huang, for residual Warm pathogens which have injured the Yin and Kidney Yin Deficiency with steaming bones."]},{"herb":"XuanShen","dosage":"9g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates Stagnation in the lymph nodes of the neck, drains Fire and relieves toxicity.","With Sheng Di Huang, for Excess or Deficiency Heat patterns.","With Mu Dan Pi, for erysipelas and purplish rashes."]},{"herb":"ShengDiHuang","dosage":"9g","actions":["Clears Heat, cools the Blood and nourishes Yin."]},{"herb":"DaQingYe","dosage":"9g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, dissipates maculae and treats leukemia."]},{"herb":"GanCao","dosage":"4.5g","actions":["Clears Heat, relieves Fire toxicity, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChanTui","dosage":"4.5g","actions":["Disperses Wind, clears Heat and inhibits the growth of cancer cells."]},{"herb":"TianHuaFen","dosage":"6g","actions":["Drains Heat, generates Fluids, relieves toxicity, expels pus, reduces swelling and inhibits the growth of cancer cells."]}],"actions":["Clear Heat","Cools the Blood","Relieves toxicity","Inhibits the growth of cancer cells"],"syndromes":["Blood Heat"],"manifestations":{"symptoms":["Chronic, stubborn skin lesions","Sores","Enlarged lymph nodes","Nodules","Red itching skin","Hardness"],"tongue":"Pale with red spots","pulse":"Rapid and pecking"},"conditions":[{"condition":"AcuteLeukemia","name":"Acute granulocytic leukemia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}