{"formula":"JuHuaTongShengSanJiaJian","names":{"pinyin":"ju hua tong sheng san jia jian","hanzi":"菊花通圣丸加減","english":"modified chrysanthemum sagely opening powder","commonEnglish":"Modified Chrysanthemum Sagely Opening Powder","aka":[""]},"herbs":[{"herb":"JuHua","dosage":"15g","actions":["Disperses Wind, clears Heat, calms the Liver, clears the eyes and detoxifies.","Wind-Heat patterns with fever, chills, With Bo He, for a headache, dizziness, sore eyes and a sore throat.","With Fang Feng, for Wind-Heat irritating the Exterior with slight chills, mild fever, headache and itchy eyes.","With Chuan Xiong and Shi Gao, for headaches due to Wind-Heat or Liver Yang Rising."]},{"herb":"FangFeng","dosage":"10g","actions":["Releases the Exterior, expels External Wind and alleviates pain.","With Jing Jie, for exterior patterns in any season.","With bo He and Lian Qiao, for Wind-Heat.","With Jing Jie, Lian Qiao and Bo He, for Wind-Heat with red eyes and a sore throat.","With Ma Huang, dispels Wind-Cold from the Exterior.","With Ma Huang, Huang Qin and Zhi Zi, dispels Wind-Heat from the Exterior and clears Heat from the Interior.","With Bo He, Huang Qin Huang Lian and Lian Qiao, for Wind-Heat Attacking the upper body."]},{"herb":"QiangHuo","dosage":"10g","actions":["Releases the Exterior and disperses Cold.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"BoHe","dosage":"6g","actions":["Disperses Wind-Heat and cools and clears the head and eyes.","With Ju Hua, for a headache due to Wind-Heat and headaches and pain, redness, and swelling of the eyes due to Liver Fire."]},{"herb":"LianQiao","dosage":"10g","actions":["Clears Heat, especially in the Upper Jiao, and relieves toxicity."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating and releases the Exterior.","With Shi Gao, for coughing from Heat Obstructing the Lungs with wheezing, flaring of the nostrils and fever."]},{"herb":"JingJie","dosage":"10g","actions":["Releases the Exterior and expels Wind.","With Bo He, disperses Wind in the head."]},{"herb":"ZhiZi","dosage":"6g","actions":["Clears Heat, reduces Fire and eliminates irritability in the San Jiao.","With Huang Lian, Da Huang and Lian Qiao, for irritability and restlessness with high fever due to Toxic Heat."]},{"herb":"ShiGao","dosage":"15g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Excess Heat from the Lungs."]},{"herb":"HuangQin","dosage":"10g","actions":["Drains Fire, detoxifies and calms ascending Liver Yang.","With Huang Lian and Zhi Zi, for acute febrile diseases.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, coughing with yellow sputum and epistaxis or hematemesis."]},{"herb":"DaHuang","dosage":"6g","actions":["Clears Heat and reduces Fire toxicity.","With Huang Lian, for a feeling of fullness and distention due to Heat Accumulation.","With Zhi Zi, Huang Qin, Lian Qiao and Mang Xiao, for strong pathogenic Heat in the Upper and Middle Jiaos and upward Flaring of Heat attacking the head."]},{"herb":"MangXiao","dosage":"6g","actions":["Clears Heat,d drains Fire and reduces swelling.","With Da Huang, for constipation.","With Da Huang, Huang Qin and Zhi Zi, for Heat in the Lungs and Stomach."]},{"herb":"DangGui","dosage":"6g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chaun Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Fang Feng and Jing Jie, for headaches due Wind-Cold Invasion."]},{"herb":"HuangLian","dosage":"6g","actions":["Drains Fire and resolves Fire toxicity.","With Huang Qin and Zhi Zi, for a high fever, irritability, a dry mouth and throat and dark urine due to Fire toxin in the three burners.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos.","With Huang Qin, Lian Qiao and Da Huang, for swelling and inflammation due to toxic Heat."]}],"actions":["Dispels Wind","Clears Heat"],"syndromes":["Wind-Heat with Simultaneous Interior and Exterior Heat"],"manifestations":{"symptoms":["Acute eye pain","Redness and swelling of the eye with a burning sensation","Pain is aggravated by exposure to Wind and Heat","Formation of pus in the eye","Fever","Aversion to Cold","Thirst","A distending headache","Constipation"],"tongue":"Red tip","tongueCoat":"Yellow","pulse":"Floating and rapid"},"conditions":[{"condition":"EyePain","name":"Eye pain"},{"name":"Inflammation of the eyes"},{"name":"Redness and swelling of the eyes"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}