{"formula":"KaiGuanLiGeFang","names":{"pinyin":"kai guan li ge fang","hanzi":"开关利膈方","english":"aucklandia and agastaches formula","commonEnglish":"Aucklandia and Agastaches Formula","aka":[""]},"herbs":[{"herb":"MuXiang","dosage":"2.1g","actions":["Promotes the movement of Qi, alleviates pain and strengthens the Spleen.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation.","With Bing Lang and Da Huang, for epigastric and abdominal fullness, distention, and pain with constipation."]},{"herb":"BingLang","dosage":"2.1g","actions":["Regulates Qi, reduces accumulations, drains downward and unblocks the bowels and inhibits the growth of cancer cells."]},{"herb":"RenShen","dosage":"3g","actions":["Tonifies Spleen, Stomach and Lung Qi and inhibits the growth of cancer cells."]},{"herb":"DangGui","dosage":"3g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh, alleviates pain, stops coughing and treats dyspnea."]},{"herb":"HuoXiang","dosage":"3g","actions":["Aromatically transforms Dampness, releases the Exterior and harmonizes the Middle Jiao."]},{"herb":"HouPo","dosage":"6g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Rebellious Qi, reduces Phlegm and calms wheezing.","With Zhi Shi, for Stagnant Qi failing to move with abdominal distention, wheezing, shortness of breath, nausea and constipation.","With Zhi Shi and Da Huang, for relatively severe accumulation and Stagnation with abdominal distention and pain and constipation."]},{"herb":"ZhiShi","dosage":"3g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Da Huang, for constipation and abdominal swelling due to Food Stagnation and Qi Stagnation."]},{"herb":"DaHuang","dosage":"6g","actions":["Drains Heat, purges accumulations, clears Heat, transforms Dampness, promotes urination, invigorates the Blood, dispels Blood Stasis and inhibits the growth of cancer cells.","With Dang Gui, for Blood Stasis.","With Ren Shen and Dang Gui, for Yang Ming Stage with Qi and Blood Deficiency."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen and augments Qi, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Promotes the movement of Qi","Alleviates pain","Strengthens the Spleen","Drains Heat","Purges accumulations","Invigorates the Blood","Dispels Blood Stasis","Tonifies, invigorates and harmonizes the Blood","Inhibits the growth of cancer cells"],"syndromes":["Qi and Blood Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Local redness, swelling and pain","Maybe fever and chills","A constricted esophagus","Obstruction of food in the throat"],"tongue":"Normal","tongueCoat":"Thin white or yellow","pulse":"Rapid and forceful"},"conditions":[{"condition":"LungCancer","name":"Lung cancer"},{"condition":"EsophagealCancer","name":"Esophageal cancer"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}