{"formula":"KaiYuZhongYuTangJiaJian","names":{"pinyin":"kai yu zhong yu tang jia jian","hanzi":"开郁种玉汤加減","english":"modified opening stagnation and growing jade decoction","commonEnglish":"Modified Opening Stagnation and Growing Jade Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"6-12g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Tao Ren and Hong Hua, for amenorrhea, pain, swelling and other symptoms associated with Blood Stasis."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding and thick purple clots.","With Xiang Fu, for Flank pain, abdominal pain, and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"XiangFu","dosage":"9-10g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain."]},{"herb":"LuLuTong","dosage":"3-10g","actions":["Promotes the movement of Qi and invigorates the Blood, opens the Middle Jiao and unblocks the channels.","With Xiang Fu, for irregular, scanty periods."]},{"herb":"QianCaoGen","dosage":"6-16g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood and stops bleeding.","With Dang Gui, Chi Shao and Xiang Fu, for amenorrhea due to Blood Stasis."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Hong Hua, Dang Gui and Chi Shao, for menstrual pain, amenorrhea or irregular menstruation due to Blood Stasis."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation such as dysmenorrhea, amenorrhea, swollen painful sores and chest and abdominal pain."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis and stops bleeding by astringing."]},{"herb":"HongTeng","dosage":"9-30g","actions":["Invigorates the Blood and disperses Stasis."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi."]},{"herb":"ZaoJiaoCi","dosage":"3-10g","actions":["invigorates the Blood and reduces swelling."]},{"herb":"ShiJianChuan","dosage":"6-15g","actions":["Invigorates, cools and nourishes the Blood and calms the Shen."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido."]}],"actions":["Regulates Qi","Invigorates the Blood","Breaks up Stasis","Clears Heat","Regulates menstruation","Stops bleeding"],"syndromes":["Infertility due to Liver Qi and Blood Stagnation"],"manifestations":{"symptoms":["Facial color dark and dull","Emaciation","Sides and ribs distended on both sides (maybe with sharp pain)","Enlargement of the Liver and Spleen","Suffocating sensation in chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Infertility","Breast distention and pain before and during menses"],"tongue":"Dark purple (maybe purple spots on edge of tongue)","pulse":"Wiry, choppy and slow"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Take between cycles."],"modifications":[]}