{"formula":"KangGuZhiZengShengPian","names":{"pinyin":"kang gu zhi zeng sheng pian","hanzi":"抗骨窒增生片","english":"anti","commonEnglish":"Anti-Osteophyte Tablets","aka":[""]},"herbs":[{"herb":"ZhiChuanWu","dosage":"1.5-9g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Disperses Cold and Dampness, warms the channels and stops pain."]},{"herb":"RuXiang","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels and alleviates pain."]},{"herb":"MaQianZi","dosage":".6-1.2g","actions":["Unblocks the channels and collaterals, disperses clumps, cools Blood Heat to reduce swelling and alleviates pain."]},{"herb":"MaQianZi","dosage":".02-.09g","actions":["Unblocks the channels and collaterals, disperses clumps, cools Blood Heat to reduce swelling and alleviates pain."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain and assists in the generation of Qi and Blood.","With Zhi Fu Zi, for Damp-Cold Bi in the channels with generalized aches and pains and difficulty in rotating the trunk."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"DangShen","dosage":"6-14g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang, dispels Wind-Cold-Dampness, warms and unblocks the flow of Yang Qi and strengthens the sinews and bones."]}],"actions":["Warms Yang","Tonifies the Blood","Disperses Cold","Eliminates Stagnation"],"syndromes":["Blood and Yang Deficiency with Cold"],"manifestations":{"symptoms":["Localized painful swellings without a head that bleed into the surrounding tissues and do not affect the color or texture of the skin","The swellings are not hot to the touch","No thirst","Swollen and painful joints","Wasting of the muscles of the thigh and calf"],"tongue":"Very pale or Pale-pink","tongueCoat":"White","pulse":"Thready and forceless or Deep and slow"},"conditions":[{"condition":"BoneSpur","name":"Bone spurs"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}