{"formula":"KuanDaiTang","names":{"pinyin":"kuan dai tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and treats diarrhea due to Spleen Qi Deficiency with Dampness Obstruction.","With Shu Di Huang and Bai Shao, for a restless fetus due to Blood Deficiency, often with palpitations.","With Shu Di Huang, Bai Shao and Dang Gui, for an unstable pregnancy with Blood Deficiency."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Kidney Yin and astringes Jing.",""]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"BaJiTian","dosage":"6-15g","actions":["Tonifies the Kidneys, strengthens Yang, disperses Wind-Cold-Damp and strengthens the sinews and bones, augments primal Yang and replenishes Yin.","With Rou Cong Rong, tonifies Yang without injuring Yin.",""]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, astringes urine, tonifies and warms Spleen Yang and stops diarrhea."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"RouCongRong","dosage":"6-21g","actions":["Tonifies the Kidneys, strengthens the Yang,","benefits Jing and marrow and warms the Womb.","With Du Zhong and Ba Ji Tian, for deficient Kidney induced pain and weakness in the lower back with a feeling of weakness in the sinews and bones."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Rou Cong Rong, for Blood Deficiency failing to supply the sinews of the Intestines, interfering with peristalsis."]},{"herb":"WuWeiZi","dosage":"1.5-9g","actions":["Tonifies the Kidneys, astringes Jing, stops diarrhea and spermatorrhea and tonifies Qi.","With Bu Gu Zhi and Rou Dou Kou, for Kidney Deficiency with chronic dysentery and daybreak diarrhea."]},{"herb":"LianZi","dosage":"6-18g","actions":["Tonifies the Spleen, astringes diarrhea, tonifies the Kidneys and astringes Jing.","With Shan Yao and Bai Zhu, for chronic diarrhea due to Spleen Deficiency."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Scatters Cold","Restrains the Dai channel","Consolidates the Chong and Ren channels"],"syndromes":["Spleen and Kidney Yang Deficiency with Dampness Accumulation"],"manifestations":{"symptoms":["Continuous cramping pain in the abdomen","Pain is not severe","Pain is relieved by pressure","Edema of the feet","Urinary difficulty","Slight edema (primarily of the lower limbs)","Symptoms generally occur during pregnancy","Pale face","Fatigue","Heaviness of head","Lassitude","Lower abdominal pain","Dizziness","Tinnitus","Lumbago","Edema","Abdominal pain with edema during pregnancy due to Blood Deficiency and abnormal water circulation","Oliguria","Palpitations","Cold feet","Extreme coldness of the hands and feet","Vertigo","Weakness and numbness of lower back and legs during pregnancy or postpartum","Mal position of the fetus","Dysmenorrhea","Irregular menstruation","Right upper quadrant pain","Hepatomegaly","Anemia","Lack of energy","Sore back","Thirst with no desire to drink"],"tongue":"Pale or pink maybe petechiae on margin","tongueCoat":"Thin or Greasy white","pulse":"Deep and weak or Soft, floating, small and slow or Wiry and small or Wiry and rough"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"condition":"EdemaDuringPregnancy","name":"Edema with abdominal pain during pregnancy"},{"condition":"AbdominalPainDuringPregnancy","name":"Abdominal pain with edema during pregnancy"},{"condition":"Pregnancy","name":" Weakness and numbness of lower back and legs during pregnancy or postpartum "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}