{"formula":"LeechAndSargassumCombination","names":{"pinyin":"leech and sargassum combination","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ShuiZhi","dosage":"1-6g","actions":["Breaks up and drives out Blood Stasis and reduces fixed masses.","With San Leng, E Zhu and Dang Gui, for palpable, fixed abdominal masses.","With Hai Zao, for palpable, fixed masses of the throat as in esophageal carcinoma.","With Da Huang, regulates Yin and Yang to quickly attack and break up Blood Stasis."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxin.","With Dang Gui, for Qi and Blood Deficiency."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations, regulates menstruation and alleviates pain.","With E Zhu, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis, invigorates the Blood and drains abscesses."]},{"herb":"ZhiFuZi","dosage":"3-15g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Huang Qi, for Spontaneous sweat and chills due to Yang Deficiency."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Da Huang, removes Stasis and unblocks the flow of Qi."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Dang Gui, for Blood Stasis."]},{"herb":"HaiZao","dosage":"6-16g","actions":["Reduces Phlegm and softens areas of hardness."]},{"herb":"XueJie","dosage":"0.3-0.6g","actions":["Invigorates the Blood, dispels Blood Stasis and alleviates pain."]}],"actions":["Activates the Blood","Warms the Interior"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Hard enlarged masses","Fixed pain","A dark gray complexion","Emaciation","Lassitude","Anorexia","Fever (or feverish feeling)","Aversion to Cold","Amenorrhea"],"tongue":"Purple","pulse":"Choppy or Taut and smooth"},"conditions":[{"condition":"UterineMyoma","name":"Uterine fibroids"},{"condition":"Amenorrhea","name":"Amenorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}