{"formula":"LianQiaoBaiDuPian","names":{"pinyin":"lian qiao bai du pian","hanzi":"连翘败毒片","english":"forsythia fruit tablet for removing toxin","commonEnglish":"Forsythia Fruit Tablet for Removing Toxin","aka":["Forsythia Expelling Poison Tablet"]},"herbs":[{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat.","With JIn Yin Hua, for initial-stage Wind-Heat."]},{"herb":"JinYinHua","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood and vents and disperses External Wind-Heat.","With Huang Qin, for suppurating boils that have not ulcerated, or have ulcerated but are not discharging pus.","With Lian Qiao and Huang Qin, for unremitting high fever."]},{"herb":"DaHuang","dosage":"12g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis and reduces Fire toxicity.","With Zhi Zi, Huang Qin and Lian Qiao, for strong pathogenic Heat in the Upper and Middle Jiaos."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, Drains damp-Heat, cools the Blood, relieves toxicity, reduces swelling and activates the Blood.","With Lian Qiao, for Heat entering the Pericardium."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, cools the Blood and detoxifies.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, cough with yellow sputum and epistaxis or hematemesis and sores due to Heat toxin."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain."]},{"herb":"BaiXianPi","dosage":"9g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness and stops itching."]},{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain."]},{"herb":"ChanTui","dosage":"6g","actions":["Disperses Wind, clears Heat, vents rashes and relieves itching."]}],"actions":["Clears Heat","Relieves toxicity","Alleviates pain","Cools the Blood","Stops itching"],"syndromes":["Toxic Wind-Heat"],"manifestations":{"symptoms":["Localized itching, redness, swelling, heat, inflammation or suppuration of the skin","Fever","Headache","Thirst","Sore throat","Dry throat","Constipation"],"tongue":"Pink or Red or Red tip","tongueCoat":"Yellow","pulse":"Floating and rapid or rapid pulse"},"conditions":[{"name":"Abscess (early stage)"},{"name":" Early-stage painful skin infection (with incomplete expression of rash)"},{"condition":"Urticaria","name":"Urticaria"},{"condition":"Furuncles","name":"Furuncle"},{"condition":"Psoriasis","name":" Psoriasis"},{"name":" Skin allergy"}],"contra":{"contraindications":["Contraindicated during pregnancy."],"interactions":[""]},"notes":[""],"modifications":[]}