{"formula":"LianQiaoBaiDuSan","names":{"pinyin":"lian qiao bai du san","hanzi":"连翘败毒散","english":"forsythia powder to overcome pathogenic influences","commonEnglish":"Forsythia Powder to Overcome Pathogenic Influences","aka":["Forsythia Detox Formula"]},"herbs":[{"herb":"LianQiao","dosage":"9g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat.","With Niu Bang Zi and Bo He, for Wei Stage Heat."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, Drains damp-Heat, cools the Blood, relieves toxicity, reduces swelling and activates the Blood.","With Lian Qiao, for Heat entering the Pericardium."]},{"herb":"QiangHuo","dosage":"8g","actions":["Expels Wind-Cold-Dampnes and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headache and generalized body aches and pains associated with the common cold."]},{"herb":"XuanShen","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, drains Fire and relieves toxicity.","With Niu Bang Zi, Jie Geng and Bo He, for pain and swelling of the throat and purpuric rashes due to Wind-Heat.","With Fang Feng, for pain due to External Wind-Dampness.","With Jie Geng, for skin conditions."]},{"herb":"BoHe","dosage":"5g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat and vents rashes."]},{"herb":"FangFeng","dosage":"5g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Bo He and Lian Qiao, for Wind-Heat.","With Qiang Huo, for Wind-Dampness."]},{"herb":"ChaiHu","dosage":"6g","actions":["Disperses Wind-Heat and resolves Phlegm and congestion."]},{"herb":"JieGeng","dosage":"5g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and raises Lung Qi, directing the effects of other herbs to the upper body."]},{"herb":"ShengMa","dosage":"5g","actions":["Releases the exterior, vents measles, clears Heat and relieves toxicity.","With Chai Hu, for continuous fever, headache and sore throat from Wind-Heat patterns constrained in the muscle layer and erysipelas of the head and face and swelling and pain due to Fire toxin."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"DangGui","dosage":"8g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, cools the Blood and detoxifies.","With Chai Hu, for Heat in the Shao Yang with alternating chills and fever and nausea.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, cough with yellow sputum and epistaxis or hematemesis and sores due to Heat toxin."]},{"herb":"BaiShao","dosage":"10g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"NiuBangZi","dosage":"6g","actions":["Disperses Wind-Heat, benefits the throat, relieves toxicity and vents rashes.","With Bo He, for sores due to Wind-Heat, dry throat, cough with yellow sputum and incomplete expression of measles or pruritic rash.","With Jie Geng and Bo He, for throat inflammation and productive cough due to Wind-Heat.","With Lian Qiao, unblocks and drains Heat toxin, disperses clumps and swellings for sore, swollen throat, swellings like mumps, boils and other Heat toxin lesions and ulcerations and abscesses of the tongue and mouth."]},{"herb":"HongHua","dosage":"(6g)","actions":["(Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain. Decoct first.)"]}],"actions":["Release Wind-Heat","Clear Heat","Eliminate toxins"],"syndromes":["Wind-Heat Toxins"],"manifestations":{"symptoms":["Mumps",""]},"conditions":[{"name":"Parotitis"},{"name":"Mumps"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"thirst","modifications":[{"herb":"TianHuaFen","modification":"+ Rx. Trichosanthis"},{"herb":"WeiLingXian","modification":"+ Rx. Clematidis"}]},{"purpose":"facial swelling","modifications":[{"herb":"BaiZhi","modification":"+ Rx. Angelicae Dahuricae"}]},{"purpose":"swelling of the neck","modifications":[]},{"purpose":"constipation due to Excess","modifications":[{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"},{"herb":"ChuanShanJia","modification":"+ Squama Manitis"}]},{"purpose":"Qi Deficiency","modifications":[{"herb":"RenShen","modification":"+ Rx. Ginseng"}]}]}