{"formula":"LiangXueXiaoFengSan","names":{"pinyin":"liang xue xiao feng san","hanzi":"凉血消風散","english":"cool the blood and eliminate wind powder","commonEnglish":"Cool the Blood and Eliminate Wind Powder","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, activates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"JingJie","dosage":"9g","actions":["Releases the Exterior, expels Wind, vents rashes and relieves itching.","With Dang Gui, for itching and tremors of the hands and feet from Wind due to Blood Deficiency."]},{"herb":"ChanTui","dosage":"6g","actions":["Disperses Wind, clears Heat, vents rashes and relieves itching."]},{"herb":"KuShen","dosage":"9g","actions":["Clears Heat, dries Dampness, disperses Wind and stops itching.","With Chan Tui and Jing JIe, for generalized itching."]},{"herb":"Bai(Ci)JiLi","dosage":"9g","actions":["Dispels Wind and stops itching.","With Dang Gui, Jing Jie and Chan Tui, for eczema with itching."]},{"herb":"ZhiMu","dosage":"9g","actions":["Clears Heat, drains Fire, nourishes Yin and moistens Dryness."]},{"herb":"ShiGao","dosage":"30g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and heals eczema, burns and ulcerated sores and wounds.","With Zhi Mu, for a high fever from Wind-Heat with irritability and extreme thirst.","With Sheng Di Huang, for excessive Fire with injured fluids.","with Sheng Di Huang and Zhi Mu, for Stomach Fire."]},{"herb":"GanCao","dosage":"6g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Expels Wind","Clears Heat","Cools the Blood","Nourishes Yin and Blood","Eliminates Dampness"],"syndromes":["Wind-Heat with Blood Dryness with Wind-Heat Predominant"],"manifestations":{"symptoms":["The lesions have a slightly erythematous base","The scales are dry and powdery","The scales may be very thick on the scalp"]},"conditions":[{"condition":"SeborrheicDermatitis","name":"Seborrheic dermatitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}