{"formula":"LiangYingQingQiTang","names":{"pinyin":"liang ying qing qi tang","hanzi":"凉营清氣汤","english":"cool the nutritive and clear the qi decoction","commonEnglish":"Cool the Nutritive and Clear the Qi Decoction","aka":[""]},"herbs":[{"herb":"ShuiNiuJiao","dosage":"3g","actions":["Clears Heat from the Ying and Xue stages,","relieves Fire toxicity, cools the Blood and stops bleeding.","With Sheng Di Huang, for loss of consciousness and delirium, with epistaxis, hematemesis, or purpura due to Blood Heat.","With Huang Lian and Xuan Shen, for a high fever, loss of consciousness, delirium, hematemesis, epistaxis and purpura associated with warm febrile disease."]},{"herb":"ShiHu","dosage":"24g","actions":["Nourishes Stomach, Kidney and Lung Yin, clears Heat and generates fluids."]},{"herb":"ZhiZi","dosage":"6g","actions":["Clears Heat, reduces Fire, eliminates irritability, cools the Blood and relieves toxicity.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood.","With Bai Mao Gen, for epistaxis, hematemesis or hematuria."]},{"herb":"MuDanPi","dosage":"6g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Bai Mao Gen, for hematuria, hematemesis and epistaxis due to warm febrile disease.","With Chi Shao and Sheng Di Huang, for epistaxis and hematemesis due to Heat in the Xue level.","With Sheng Di Huang, for Ying and Xue Stage Heat with a high fever, scarlet tongue, thirst, a rash all over the body, epistaxis and hemoptysis."]},{"herb":"ShengDiHuang","dosage":"24g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shui Niu Jiao and Mu Dan Pi, for rashes due to Blood Heat.","With Shui Niu Jiao and Xuan Shen, for Heat in the Ying Stage.","With Xuan Shen, for Excess or Deficiency Heat patterns and Late-stage febrile disease with irritability, thirst and constipation.","With Mu Dan Pi and Chi Shao, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"BoHe","dosage":"2.4g","actions":["Disperses Wind and vents rashes."]},{"herb":"HuangLian","dosage":"1.5g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and stops bleeding.","With Sheng Di Huang, for insomnia and delirium due to unremitting Heat injuring the Ying level.","With Zhi Zi and Shi Gao, for Ying Stage Heat with delirium and loss of consciousness."]},{"herb":"ChiShao","dosage":"6g","actions":["Clears Heat, cools the Blood, invigorates the Blood, dispels Blood Stasis and relieves pain.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes.","With Mu Dan Pi and Sheng Di Huang, for Heat entering the Xue Stage causing maculae or hemorrhage."]},{"herb":"XuanShen","dosage":"9g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Mu Dan Pi, for erysipelas and purplish rashes.","With Sheng Di Huang, Shui Niu Jiao and Lian Qiao, for Ying Stage Heat."]},{"herb":"ShiGao","dosage":"24g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Lung Heat and Blazing Stomach Fire.","With Shui Niu Jiao, for Epidemic Damp-Heat toxin with a high fever, loss of consciousness, epistaxis and a rash.","With Sheng Di HUang, for Excessive Fire with injured fluids.","With Xuan Shen and Shui Niu Jiao, for Heat at the Qi and Blood Stages with skin eruptions and echymoses.","With Sheng Di Huang, Mu Dan Pi and Xuan Shen, for Excessive Heat in the Qi and Xue Levels with continuous high fever and maculae."]},{"herb":"GanCao","dosage":"2.4g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"LianQiao","dosage":"9g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity and clears Blood Heat.","With Zhi Zi, for Heat entering the Pericardium and Heat remaining in the Heart channel with sores in the mouth, or on the tongue, dark and scanty urine, or urinary discomfort."]},{"herb":"DanZhuYe","dosage":"30g","actions":["Clears Heat and eliminates irritability.","With Shi Gao, for late stage febrile diseases with residual fever, sensations of Heat in the chest, desire for cold drinks and a red tongue with a thin coat and lingering fever from febrile disease with insomnia, irritability and a scanty dry tongue coat.",""]},{"herb":"LuGen","dosage":"30g","actions":["Clears Heat and irritability from the Lungs and Stomach, generates fluids, regulates Stomach Qi, relieves thirst, stops vomiting and vents rashes.","With Shi Gao, for a dry mouth, severe bad breath and toothache due to Stomach Fire.","With Zhi Zi, for irritability.",""]},{"herb":"BaiMaoGen","dosage":"30g","actions":["Cools the Blood, stops bleeding and clears Heat from the Stomach and Lungs.","With Lu Gen, for a warm febrile disease with thirst and irritability.","With Shi Gao, for later stages of a Warm febrile disease with remnants of fever, thirst and dark urine, persistent fever from a Warm pathogen disease and excessive Heat in the summertime with thirst, irritability and darkish urine.","With Sheng Di Huang, cools the Blood, draws out toxicity and reduces searing Heat for Ying Stage Heat with fever, thirst, a scarlet tongue and rashes."]},{"herb":"JinZhi","dosage":"30g","actions":["Strongly clears Heat and cleans toxins."]}],"actions":["Clears Heat from the Qi Stage","Resolves toxicity in the Ying and Xue Stages","Cools the Blood"],"syndromes":["Toxic Heat in the Qi, Ying and Xue Stages"],"manifestations":{"symptoms":["High fever","Profuse sweating","Thirst with a desire for cold drinks","Irritability","Restlessness","Severe red, swollen, painful and ulcerated throat","Shortness of breath","Maybe partial blockage of the respiratory tract","Labored breathing"],"tongue":"Deep red with prickles and dense patches of macules","tongueCoat":"Yellow","pulse":"Forceful and rapid"},"conditions":[{"condition":"Perspiration","name":"Profuse perspiration"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"a muddled consciousness, delirium, and cold extremities due to Heat Blocking the Heart","modifications":[]},{"purpose":"Collapse of Yang","modifications":[]}]}