{"formula":"LiangXueChuShiTang","names":{"pinyin":"liang xue chu shi tang","hanzi":"凉血除湿汤","english":"cool the blood and eliminate dampness decoction","commonEnglish":"Cool the Blood and Eliminate Dampness Decoction","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood,nourishes Yin and generates fluids."]},{"herb":"RenDongTeng","dosage":"15g","actions":["Clears Heat and resolves toxicity, Dispels Wind-Dampness, soothes the sinews, unblocks the channels, Cools the Blood, Clears Damp-Heat from the Lower Jiao and Expels Wind-Heat."]},{"herb":"BaiXianPi","dosage":"15g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching.","With Ren Dong Teng, for Bi syndrome."]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Sheng Di Huang, for Ying and Xue Stage Heat with a high fever, scarlet tongue, thirst, a rash all over the body, epistaxis and hemoptysis."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes.","With Mu Dan Pi and Sheng Di Huang, for Heat entering the Xue Stage causing maculae or hemorrhage."]},{"herb":"HaiTongPi","dosage":"10g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, promotes urination, reduces edema and treats itching skin lesions."]},{"herb":"DiFuZi","dosage":"10g","actions":["Clears Damp-Heat, promotes urination, expels Dampness and stops itching.","With Sheng Di Huang and Bai Xian Pi, for Damp-Heat or Wind-Heat causing eczema and itch."]},{"herb":"XiXianCao","dosage":"12g","actions":["Dispels Wind-Dampness, strengthens the sinews and unblocks the channels and collaterals Clears and transforms Damp-Heat and eliminates toxins"]},{"herb":"ChiXiaoDou","dosage":"12g","actions":["Clears Damp Heat, disperses Blood Stasis, reduces swelling and reduces Fire toxicity."]},{"herb":"LianZiXin","dosage":"6g","actions":["Drains Heart Fire and relieves irritability."]}],"actions":["Clears Heat","Eliminates Dampness"],"syndromes":["Wind-Damp-Heat - Heat Predominant"],"manifestations":{"symptoms":["Acute onset","Inflammation","Numerous red 1-2 mm papules and a few vesicles","A sensation of scorching Heat","Irritability","Thirst","Itching","Short voiding of reddish urine","Constipation"],"tongue":"Red","tongueCoat":"Thin yellow"},"conditions":[{"condition":"Eczema","name":"Eczema"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"eczema","modifications":[]}]}