{"formula":"LiangXueQingFeiYin","names":{"pinyin":"liang xue qing fei yin","hanzi":"凉血清肺飲","english":"cool the blood and clear the lung drink","commonEnglish":"Cool the Blood and Clear the Lung Drink","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Mu Dan Pi and Chi Shao, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"ShiGao","dosage":"30g","actions":["Clears Qi Stage Heat, drains Fire, relieves irritability, quenches thirst, clears Excess Heat from the Lungs and heals eczema, burns and ulcerated sores and wounds.","With Zhi Mu, for high fever from Wind-Heat, Qi Stage Heat or Yang Ming Heat with irritability and extreme thirst.","With Sheng Di Huang, for Excessive Fire with injured fluids."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Sheng Di Huang, for Ying and Xue Stage Heat."]},{"herb":"ChiShao","dosage":"9g","actions":["Clears Heat, cools and invigorates the Blood, dispels Blood Stasis, reduces swelling from sores and abscesses and relieves pain.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes.","With Mu Dan Pi and Sheng Di Huang, for Heat entering the Xue Stage causing maculae or hemorrhage."]},{"herb":"HuangQin","dosage":"9g","actions":["Cools the Blood, stops bleeding, drains Fire and detoxifies.","With Zhi Mu, for acute and chronic Lung Heat cough."]},{"herb":"ZhiMu","dosage":"9g","actions":["Clears Heat, drains Fire, nourishes Yin and moistens Dryness."]},{"herb":"SangBaiPi","dosage":"9g","actions":["Drains Heat from the Lungs, stops cough and calms wheezing.","With Huang Qin, drains Heat from the Lungs, and stops cough and wheezing."]},{"herb":"PiPaYe","dosage":"9g","actions":["Transforms Phlegm, clears Lung Heat and descends Lung Qi."]},{"herb":"GanCao","dosage":"6g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Clears Heat","Cools the Blood"],"syndromes":["Blood Heat"],"manifestations":{"symptoms":["Red pimples with Heat and pain in the local area.","Red complexion","The lesions are hot and maybe painful","Pus eruptions","Redness of the bulb of the nose","The redness blanches upon pressure","Red papules, tubercles and acne and inflammatory infiltration around them","Whiteheads or blackheads","Dry nose","Dry mouth","Burning sensation","Constipation","Dry stool"],"tongue":"Red or Red tip","tongueCoat":"Thin and yellow","pulse":"Wiry and slippery or Slippery and rapid or Floating and rapid"},"conditions":[{"condition":"AcneVulgaris","name":"Acne"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"dry stools","modifications":[{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"},{"herb":"DaQingYe","modification":"+ Fol. Isatidis"}]}]}