{"formula":"LiJinTang","names":{"pinyin":"li jin tang","hanzi":"利金湯","english":"benefit metal decoction","commonEnglish":"Benefit Metal Decoction","aka":["Metal Pearls"]},"herbs":[{"herb":"BaiHe","dosage":"9-30g","actions":["Nourishes Stomach Yin, harmonizes the Middle Jiao, moistens the Lungs, clears Heat, stops coughing, clears the Heart and calms the Spirit.","With Hua Shi, for dark urine and dysuria."]},{"herb":"SheGan","dosage":"3-10g","actions":["Clears Heat, relieves Fire toxicity, transforms Phlegm and clears the Lungs.","With Huang Qin, for a sore throat and coughing due to Lung Heat.","With Huang Qin and Jie Geng, for pain and swelling of the throat with hoarseness due to Fire Excess.","With Xing Ren and Jie Geng, for coughing, pain and swelling of the throat with difficulty expectorating due to Lung Heat."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm.","With Zhi Ban Xia, for coughing due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]},{"herb":"XingRen","dosage":"3-10g","actions":["Stops cough, calms wheezing, moistens the Intestines and unblocks bowels."]},{"herb":"ZhiBanXia.htm","dosage":"3-15g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi harmonizes the Stomach and stops vomiting.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi and a productive cough and a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools and prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Fu Ling and Zhi Ban Xia, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, cools the Blood, dries Dampness, drains Fire, detoxifies and calms ascending Liver Yang.","With Bai Shao, for dysenteric disorders with abdominal pain due to Heat entering the Interior."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain."]},{"herb":"HuaShi","dosage":"9-18g","actions":["Expels Damp-Heat, releases Summeheat and resolves Dampness."]},{"herb":"JiangCan","dosage":"3-10g","actions":["Dispels Wind, disperses Wind-Heat, stops itching and pain, transforms Phlegm, softens hardness, eliminates toxins and dissipates nodules."]}],"actions":["Descends Lung and Large Intestine Qi","Transforms Phlegm","Clears Heat","Detoxifies","Promote the flow of Qi","Invigorates the Blood","Regulates fluid metabolism in Upper and Middle Jiaos","Resolves Toxins","Nourishes Lung Yin","Calms the Shen"],"syndromes":["Phlegm-Heat"],"manifestations":{"symptoms":["Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}