{"formula":"LingLongShaGuiDan","names":{"pinyin":"ling long sha gui dan","hanzi":"靈龍殺鬼丹","english":"spiritual dragon pills to kill evil","commonEnglish":"Spiritual Dragon Pills to Kill Evil","aka":["Dragon Pearls"]},"herbs":[{"herb":"QingDai","dosage":"1.5-3g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, drains Lung Heat, disperses Stagnation, drains Liver Fire and dispels Summerheat."]},{"herb":"YinChen(Hao)","dosage":"9-30g","actions":["Clears Damp-Heat from the Liver and Gallbladder and clears and releases Dampness in the the Exterior.","With Huang Qin, for Damp-Heat skin rashes.","With Zhi Zi, strongly relieves Damp-Heat.","With Da Huang, for early-stage Damp-Heat when Heat is stronger than Dampness.","With Zhi Chuan Wu, for Spleen Yang Deficiency leading to Dampness."]},{"herb":"GuiJianYu","dosage":"3-9g","actions":["Breaks up Blood Stasis, eliminates parasites, eliminates Wind-toxin, clears Heat and cools the Blood."]},{"herb":"ZhiChuanWu","dosage":"1.5-9g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, drains Fire, dries Dampness, detoxifies, cools the Blood and calms Liver Yang.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, cough with yellow sputum and epistaxis or hematemesis; Damp-Heat jaundice; sores due to Heat toxin and irregular vaginal bleeding due to Liver Fire.","With Zhi Zi, Yin Chen Hao and Da Huang, for Damp-Heat with jaundice.","With Huang Lian and Zhi Zi, for acute febrile disease.","With Da Huang, for constipation."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, drains Damp-Heat cools the Blood and relieves toxicity.","With Da Huang, for constipation."]},{"herb":"GeQiao(HaiGeKe)","dosage":"1-3g","actions":["Clears Lung Heat, transforms Phlegm, descends Lung Qi, promotes urination and expels Dampness.","With Qing Dai, for red eyes, a bitter taste, pain in the ribs, a paroxysmal cough and viscous sputum that is difficult to expectorate due to Lung Heat."]},{"herb":"ShengJiang","dosage":"3-10g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting, warms the Lungs, stops coughing normalizes the flow of Qi at the center and reduces the toxicity of other herbs."]},{"herb":"HuangLian","dosage":"3-10g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity, clears Heart Fire and Drains Stomach Fire.","With Huang Qin and Zhi Zi, for high fever, irritability, dry mouth and throat and dark urine due to Fire toxin in the three burners.","With Zhi Zi, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes, irritability in warm-febrile disease and explosive diarrhea and dysentery with burning pain in the anus or fitted, filthy stools and abdominal pain.","With Huang Qin and Da Huang, for hematemesis and rectal bleeding due to Blood Heat."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Drains Damp-Heat and clears Heat through the stool.","With Huang Lian, for distention, palpitations, mental distress with facial congestion and epilepsy due to Excess Heat.","With Huang Lian and HUang Qi, for whole body Damp-Heat."]},{"herb":"GanCao","dosage":"3-14g","actions":["Moistens the Lungs, resolves Phlegm, stops cough, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Toxic Heat in acute cases of aggressive inflammation","Transforms Damp Heat","Transforms Toxic Phlegm","Reduces fevers","Dispels Wind-Damp","Invigorates the Blood","Opens blocked collaterals","Alleviates pain"],"syndromes":["Toxic Wind-Damp-Heat with Internal Damp-Heat"],"manifestations":{"symptoms":["Arthralgia involving one or several joints of the extremities","Knee swelling is frequent","Local redness and Heat","Swelling with excruciating pain","Severe limitation of movement","Pain better during the day and worse at night","The pain is relieved by Cold","Fever","Sometimes slight chills and fever","Thirst","Dryness of the mouth and tongue","Irritability","Nervousness","Restlessness","Aversion to Heat","Desire for Cold drinks","Dark urine","Yang jaundice (sclera and skin bright yellow)","Pain and fullness in ribs on both sides","Maybe pain in the right hypochondrium","Bitter taste in mouth","Nausea","Vomiting sour and bitter fluids","Anorexia","Maybe alternating chills and fever","Concentrated, dark urine","Abdominal distention","Women: Yellow vaginal discharge with foul smell Pruritis vulvae","Men: Pain, swelling and burning sensations of testicles"],"tongue":"Pink or Red","tongueCoat":"Yellow and greasy or sticky","pulse":"Rolling and rapid maybe slippery Wiry and rapid or Slippery and rapid"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome"},{"condition":"Arthralgia","name":"Arthralgia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}