{"formula":"LiQiTongBianTang","names":{"pinyin":"li qi tong bian tang","hanzi":"理氣通畅湯","english":"regulate qi and eliminate constipation decoction","commonEnglish":"Regulate Qi and Eliminate Constipation Decoction","aka":[""]},"herbs":[{"herb":"ChenXiang","dosage":"3-5g","actions":["Promotes movement of Qi, regulates the Middle, dispels Cold, warms the Spleen and Stomach and alleviates pain.","With Wu Yao, for lower abdominal pain, especially with lower abdominal Cold and tension.","With Mu Xiang, relieves pain.","With Mu Xiang and Bing Lang, for constipation due to Liver Qi Stagnation.","With Wu Yao, Bing Lang and Mu Xiang, for chest and abdominal distention and pain due to Accumulation of Cold."]},{"herb":"MuXiang","dosage":"8g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, prevents Stagnation, dispels Damp-Heat, harmonizes the Liver and Spleen and alleviates pain.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation.","With Wu Yao, for lower abdominal Coldness and pain."]},{"herb":"WuYao","dosage":"8g","actions":["Promotes the movement of Qi, warms the Kidneys, disperses Cold and alleviates pain.","With Mu Xiang and Zhi Ke, for epigastric and abdominal pain and distention due to Cold Stagnation and Qi Obstruction."]},{"herb":"ZhiKe(Qiao)","dosage":"10g","actions":["Promotes the movement of Qi, reduces distention and pressure, resolves hardenings and removes stagnated food."]},{"herb":"BingLang","dosage":"5g","actions":["Regulates Qi, reduces accumulations, drains downward and unblocks the bowels."]},{"herb":"GuaLouRen","dosage":"12g","actions":["Moistens the Intestines and promotes bowel movements.","With Yu Li Ren and Zhi Ke, for constipation."]},{"herb":"LaiFuZi","dosage":"10g","actions":["Reduces Food Stagnation, transforms accumulation, promotes digestion and eliminates distention.","With Zhi Ke, for distention, belching, and anorexia due to Food Stagnation."]},{"herb":"YuLiRen","dosage":"10g","actions":["Moistens the Intestines and unblocks the bowels."]}],"actions":["Regulates Qi","Promotes bowel movements"],"syndromes":["Qi Stagnation"],"manifestations":{"symptoms":["Abdominal, epigastric and/or hypochondriac distention, fullness and pain","Dry stools which are difficult to evacuate or","Stools are less dry but there are a few days between evacuations","Maybe a desire to defecate without results","Maybe a bearing-down sensation in the rectum with a desire to defecate","Pains that move around","Frequent belching","Depression","Irritability"],"tongue":"Normal or Dark or red (with Heat)","tongueCoat":"Thin and white or Greasy and white (with Food Stagnation)","pulse":"Wiry"},"conditions":[{"condition":"Constipation","name":"Constipation"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}