{"formula":"LiuWeiGuJingWan","names":{"pinyin":"liu wei gu jing wan","hanzi":"六味固精丸","english":"rehmannia six and lotus stamen pill","commonEnglish":"Rehmannia Six and Lotus Stamen Pill","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"8-30g","actions":["Tonifies the Kidneys and nourishes Jing, Yin and Blood.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"ShanZhuYu","dosage":"4-20g","actions":["Nourishes Kidney Yin and Yang, astringes Jing and Yin and stops perspiration.","With Shan Yao, tonifies the Liver and Spleen.","With Shu Di Huang and Shan Yao, for urinary frequency (day or night), dizziness, tinnitus and lower back pain due to Kidney Deficiency."]},{"herb":"ShanYao","dosage":"4-15g","actions":["Strengthens the Spleen , stabilizes the Kidneys and astringes Jing.","With Shu Di Huang and Shan Zhu Yu, for Kidney Deficiency with spermatorrhea, dizziness, tinnitus, lower back pain, impotence and night sweats."]},{"herb":"FuLing","dosage":"3-15g","actions":["Strengthens the Spleen and drains Dampness.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention."]},{"herb":"MuDanPi","dosage":"3-15g","actions":["Clears Heat, cools the Blood clears and Deficiency Fire."]},{"herb":"ZeXie","dosage":"3-15g","actions":["Promotes urination and prevents Kidney Fire as a result of tonification.","With Fu Ling and Mu Dan Pi, regulates the Kidneys, Liver and Spleen, drains and tonifies.","With Fu Ling, promotes urination.","With Mu Dan Pi, for steaming bone disorder, dizziness, and vertigo."]},{"herb":"ShaYuanZi","dosage":"10-60g","actions":["Tonifies the Kidney Yang, benefits Jing and stops leakage of semen. (Not included in some versions.)","With Qian Shi, for nocturnal emission and spermatorrhea.","With Lian Zi, for nocturnal emission and spermatorrhea.","With Quan Shi and Lian Zi, for Liver and Kidney Deficiency with symptoms of Jing Gate Not Consolidated.","With Bai Ji Li, tonifies the Liver and Kidneys to ensure that the eyes are nourished, anchors Liver Yang and expels Wind-Heat to treat many eye disorders, especially when there is Liver and Kidney Deficiency with either Liver Qi Stagnation with Liver Yang Rising or External Wind-Heat affecting the eyes."]},{"herb":"QianShi","dosage":"5-60g","actions":["Stabilizes the Kidneys, astringes Jing and dispels Dampness.","With Lian Zi, reestablishes communication between the Heart and Kidneys, treats nocturnal emissions, premature ejaculation, or urinary incontinence due to the failure of the Kidney's storage functions and inhibits chronic diarrhea or dysentery, watery and thin vaginal discharge, and turbid, painful urinary dysfunction due to Spleen Deficiency or Spleen and Kidney Deficiency.","With Jin Ying Zi, Sha Yuan Zi, and Su Zhi Long Gu, tonifies Kidney Qi and strengthens Jing, for vaginal discharge, cloudy urine, spermatorrhea, premature ejaculation, urinary frequency and vaginal discharge due to Kidney Deficiency an loose stools and diarrhea due to Spleen Deficiency."]},{"herb":"LianXu","dosage":"5-60g","actions":["Stabilizes the Kidneys and nourishes Jing.","With Lian Zi, for seminal emission.","With Sha Yuan Zi, Qian Shi and Su Zhi Long Gu, for loss of sperm and tinnitus.","With Jin Ying Zi and Qian Shi, for vaginal discharge form Kidney Deficiency."]},{"herb":"LongGu","dosage":"2.5-30g","actions":["Anchors and preserves floating Yang and prevents leakage of Fluids.","With Duan Mu Li, strongly suppresses Blazing Fire and assists in preventing spermatorrhea.","With Sha Yuan Zi and Qian Shi, for spermatorrhea due to Kidney Deficiency."]},{"herb":"MuLi","dosage":"3-30g","actions":["Anchors floating Yang and prevents leakage of Fluids.","With Qian Shi, Sha Yuan Zi and Lian Xu, for spermatorrhea and sore lower back and extremities."]},{"herb":"LianZi","dosage":"3-15g","actions":["Tonifies the Kidneys and astringes semen."]},{"herb":"JinYingZi","dosage":"10-15g","actions":["Stabilizes the Kidneys and astringes Jing. (Not included in some versions).","With Long Gu and Mu Li, for spermatorrhea and premature ejaculation due to Yin Deficiency.","With Su Zhi Long Gu and Duan Mu Li, for spermatorrhea and premature ejaculation due to Yin Deficiency."]},{"herb":"SuoYang","dosage":"10-15g","actions":["Tonifies Kidney Yang, fortifies Jing and nourishes Blood. (Not included in some versions)."]},{"herb":"BaiJiLi","dosage":"5g","actions":["Calms the Liver and anchors Yang. (Included only in some versions.)"]}],"actions":["Enriches Yin","Nourishes the Essence of the Liver and Kidney","Astringes","Consolidates and Stabilizes the Kidneys to build up Jing"],"syndromes":["Kidney Jing Insufficiency"],"manifestations":{"symptoms":["Spermatorrhea due to Kidney Deficiency","Maybe neurasthenia","Spermatorrhea in individuals who are mentally and physically drained"]},"conditions":[{"condition":"Spermatorrhea","name":"Spermatorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}