{"formula":"LouLuSan","names":{"pinyin":"lou lu san","hanzi":"漏蘆散","english":"rhapontici/echinopsis powder","commonEnglish":"Rhapontici/Echinopsis Powder","aka":[""]},"herbs":[{"herb":"LouLu","dosage":"3-14g","actions":["Clears Heat, resolves toxicity, drains abscesses and swellings, expels pus and promotes lactation."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood,clears Liver Fire and reduces swelling from sores and abscesses.","With Chuan Xiong and Chi Shao, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat and expels pus.","With Gan Cao, for Excess disorders in the Upper Jiao with no disorder in the Lower Jiao."]},{"herb":"BaiZhi","dosage":"3-10g","actions":["Reduces swelling, eliminates toxins and expels pus.","With Jie Geng, for ulcerated boils when pus has not been discharged.","With Dang Gui, for vaginal infections."]},{"herb":"GanCao","dosage":"3-14g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ZaoJiaoCi","dosage":"3-10g","actions":["Draws out toxicity, discharges pus, invigorates the Blood and reduces swelling.","With Bai Zhi. for un-ulcerated abscesses or those with difficulty discharging pus."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm, for chest congestion."]},{"herb":"MuXiang","dosage":"3-10g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen."]}],"actions":["Regulates Qi","Invigorates the Blood","Promotes lactation"],"syndromes":["Liver Qi Stagnation"],"manifestations":{"symptoms":["Absent or scanty lactation","Obstructed lactation","Breast distention","Hardness of the breasts","Painful breasts","Hypochondriac distension","Irritability","Epigastric distension","Pain and distention along the flanks","Palpable masses","Chest oppression","Eructation","Nausea","Distention in the head","Headaches"],"tongue":"Red edges","tongueCoat":"White","pulse":"Wiry"},"conditions":[{"condition":"InsufficientLactation","name":"Insufficient lactation"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}