{"formula":"MeiHeQiYanFang","names":{"pinyin":"mei he qi yan fang","hanzi":"梅核气咽方","english":"prescription for treating globus hystericus","commonEnglish":"Prescription for Treating Globus Hystericus","aka":[""]},"herbs":[{"herb":"XuanShen","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, transforms Phlegm-Heat, drains Fire and relieves toxicity.","With Sheng Di Huang and Mai Men Dong, for a sore, dry throat due to Deficiency Fire.","With Jie Geng and Gan Cao, for a sore throat with Dryness and pain."]},{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan shen, for Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue.","With Xuan Shen and Mai Men Dong, for swelling of the throat and lymph nodes."]},{"herb":"MaiMenDong","dosage":"9g","actions":["Moistens the Lungs, nourishes Lung and Stomach Yin and generates Fluids.","With Xuan Shen, Jie Geng and Gan Cao, for an itchy, dry throat, thirst and a nonproductive cough due to Lung Yin Deficiency."]},{"herb":"TianHuaFen","dosage":"9g","actions":["Drains Heat, generates Fluids, clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus, reduces swelling and inhibits the growth of cancer cells."]},{"herb":"ShanDouGen","dosage":"9g","actions":["Clears Heat, relieves Fire toxicity, disperses swellings, improves the throat and inhibits the growth of cancer cells."]},{"herb":"MuXiang","dosage":"9g","actions":["Promotes the movement of Qi, harmonizes the Liver and Spleen and alleviates pain.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation."]},{"herb":"JieGeng","dosage":"9g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm and pus.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus."]},{"herb":"ZhiShi","dosage":"9g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, transforms Phlegm, reduces distention and resolves hardenings."]},{"herb":"BingLang","dosage":"9g","actions":["Regulates Qi, reduces accumulations, drains downward, unblocks the bowels and inhibits the growth of cancer cells."]},{"herb":"HouPo","dosage":"0g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Shi, for abdominal or chest distention, focal epigastric distention, wheezing, shortness of breath, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, clears Heat, relieves Fire toxicity, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Spreads Qi","Resolves Phlegm","Nourishes Yin","Clears Deficiency Fire","Resolves toxicity"],"syndromes":["Liver Qi Stagnation: Phlegm and Qi Stagnant and Blocked with Yin Deficiency Heat"],"manifestations":{"symptoms":["Feeling of obstruction in throat as if a slice of roast meat were stuck there which cannot be coughed up nor swallowed down. This sensation becomes more prominent during emotional upset and subsides when relaxed","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Breast distention and pain before and during menses","Dysmenorrhea","Dizziness","Blurred vision","Impaired vision","Dry eyes","Night blindness","Tinnitus","Headache","Dry throat","Thirst","Five Sole Heat","Night sweats"],"tongue":"Red","tongueCoat":"Yellow or Little or None","pulse":"Slippery and wiry or Wiry, thready and rapid"},"conditions":[{"condition":"EsophagealCancer","name":"Early-stage esophageal cancer "},{"condition":"GlobusHystericus","name":"Globus hystericus"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}