{"formula":"Menstruation-RegulatingFormula","names":{"pinyin":"menstruation regulating formula","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Tao Ren and Hong Hua, for amenorrhea, pain, swelling and other symptoms associated with Blood Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Tao Ren, Hong Hua, Chuan Xiong and Chi Shao, for amenorrhea due to Blood Deficiency and Stagnation."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Dang Gui, Hong Hua and Chi Shao, for menstrual pain, amenorrhea or irregular menstruation due to Blood Stasis."]},{"herb":"ZeLan","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis and regulates menstruation.","With Chuan Xiong, for pain due to trauma, dysmenorrhea and amenorrhea.","With Chuan Xiong, Dang Gui, Tao Ren and Hong Hua, for pain and bruises."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding and thick purple clots.","With Xiang Fu, for flank pain, abdominal pain and dysmenorrhea due to Qi and Blood Stagnation.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Yi Mu Cao, for Blood Stasis with abdominal pain or postpartum lochiostasis.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation such as dysmenorrhea, amenorrhea, swollen painful sores and chest and abdominal pain.","With Tao Ren, Dang Gui, Chuan Xiong and Chi Shao, for menstrual pain or amenorrhea."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis and nourishes Liver and Kidney Yin.","With Dang Gui, Tao Ren and Hong Hua, for menstrual pain, irregular menstruation and postpartum pain."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea.","With Dang Gui, Tao Ren and Hong Hua, for abdominal pain accompanying menstruation.","With Hong Hua and Ze Lan, for amenorrhea."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis and regulates menstruation.","With Dang Gui, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness and scanty menstruation.","with Dang Gui and Chuan Xiong, for dysmenorrhea or lower abdominal pain due to postpartum Blood Stasis.","With Ze Lan, for disorders which include both Blood Stasis and accumulation of pathogenic water such as Blood separation (amenorrhea followed by generalized edema)."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi and breaks up Stagnant Qi.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates and descends Qi, adjusts the Middle and relieves the diaphragm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]}],"actions":["Moves Qi","Invigorates the Blood"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"EndocrineDyscrasias","name":"Endocrine dyscrasia infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}