{"formula":"MoFengGao","names":{"pinyin":"mo feng gao","hanzi":"摩风膏","english":"rub the wind ointment (topical)","commonEnglish":"Rub the Wind Ointment","aka":[""]},"herbs":[{"herb":"MaHuang","dosage":"15g","actions":["Induces sweating, releases the Exterior and warms and disperses Cold pathogens."]},{"herb":"QingHao","dosage":"30g","actions":["Cools the Blood, stops bleeding and clears Deficiency fevers."]},{"herb":"TanXiang","dosage":"3g","actions":["Promotes movement of Qi, alleviates pain and removes Blood Stagnation."]},{"herb":"ShengMa","dosage":"6g","actions":["Releases the Exterior, clears Heat and relieves toxicity."]},{"herb":"FangFeng","dosage":"6g","actions":["Releases the Exterior and expels External Wind."]},{"herb":"BaiJi","dosage":"3g","actions":["Reduces swelling, generates flesh, eliminates ulcers, astringes leakage of Blood and stops bleeding."]},{"herb":"DangGui","dosage":"3g","actions":["Tonifies, activates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"ZhiMaYou","dosage":"150g","actions":["Removes toxicity, promotes tissue regeneration and moistens Dryness."]},{"herb":"FengLa","dosage":"15g","actions":["Arrests discharges, promotes healing of wounds, promotes tissue regeneration and alleviate pain."]}],"actions":["Expels Wind","Tonifies the Blood Dispels Blood Stasis","Reduces swelling","Expels pus","Generates flesh","Stops pain"],"syndromes":["Wind-Heat with Blood dryness"],"manifestations":{"symptoms":["The lesions have a slightly erythematous base","The scales are dry and powdery","The scales may be very thick on the scalp"]},"conditions":[{"condition":"SeborrheicDermatitis","name":"Seborrheic dermatitis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients together a put in an amber bottle with an airtight lid.Pour in the sesame oil and steep for 5 days. Transfer the solution into a nonmetallic saucepan and heat until the ingredients turn brown. Remove the dregs and add dissolved beeswax. Reheat if necessary. Pour the solution into the previously used amber bottle and allow to congeal. Apply 2-3 times daily by rubbing gently into the lesions."],"modifications":[]}