{"formula":"NaoQingLingKouFuYe","names":{"pinyin":"nao qing ling kou fu ye","commonEnglish":"","aka":[""]},"herbs":[{"herb":"LongGu","dosage":"15-30g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang."]},{"herb":"MuLi","dosage":"9-30g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Bai Shao, for headache, dizziness and tinnitus and other symptoms associated with Yin Deficiency with Yang Rising."]},{"herb":"BieJia","dosage":"9-30g","actions":["Nourishes Yin and anchors Yang."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes the Liver and Kidney Yin and descends Blood and Fire.","With Sheng Di Huang, powerfully clears Deficiency Fire Blazing Upward."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, eliminates irritability and activates the Blood."]},{"herb":"MaiMenDong","dosage":"6-15g","actions":["Moistens the Lungs, nourishes Yin, nourishes Stomach Yin, generates fluids, clears the Heart and eliminates irritability.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, softens the Liver, calms Liver Yang and Liver Wind and alleviates pain.","With LOng Gu and Mu Li, for spontaneous sweating and night sweats due to Yin Deficiency."]},{"herb":"GouTeng","dosage":"6-16g","actions":["Extinguishes Wind, alleviates spasms, drains Liver Heat and pacifies Liver Yang."]},{"herb":"JiangCan","dosage":"3-10g","actions":["Extinguishes Wind, stops spasms and convulsions, dispels Wind and disperses Wind-Heat."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin, and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing."]},{"herb":"ShanZha","dosage":"8-16g","actions":["Reduces and guides out Food Stagnation, transforms accumulations, transforms Blood Stasis, invigorates Blood circulation and treats hypertension."]}],"actions":["Settles anxiety","Calms the Spirit","Calms the Liver","Benefits Yin","Anchors Floating Yang","Clears Heat","Reduces Fire","Extinguishes Wind","Stops spasms and convulsions","Tonifies the Spleen","Softens the Liver"],"syndromes":["Liver, Spleen and Kidney Deficiency Generating Wind"],"manifestations":{"symptoms":["Fatigue","Muscle spasms with alternating flexion and extension of the extremities","Prostration","Weak and sore lower back and knees","Weakness and atrophy of the legs","Dry, parched mouth and throat","Dizziness","Blurred vision","Insomnia","Dream disturbed sleep","Spermatorrhea","Prematurely gray hair","Premature hair loss","A bitter taste in the mouth","Nocturnal emissions","Hypermenorrhea"],"tongue":"Red and dry or Deep red","tongueCoat":"Thin or Peeled","pulse":"Weak and faint"},"conditions":[{"condition":"TouretteSyndrome","name":"Tourette syndrome "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}