{"formula":"NeiShuHuangLianTang","names":{"pinyin":"nei shu huang lian tang","hanzi":"内疏黃蓮湯","english":"internal dispersing decoction with coptis","commonEnglish":"Internal Dispersing Decoction with Coptis","aka":["Internally Coursing Decoction with Coptis","Decoction of Coptis for Detoxification"]},"herbs":[{"herb":"HuangLian","dosage":"6-9g","actions":["Clears Heat, drains Dampness and resolves Fire toxicity.","With Huang Qin and Zhi Zi, for a high fever, irritability, dry mouth and throat, and dark urine due to Fire toxin in the three burners.","With Mu Xiang, for dysenteric disorders due to Damp-Heat Obstructing the Intestines.","With Mu Xiang and Bing Lang, for hot dysenteric disorders with Qi Stagnation and Damp-Heat in the Middle Jiao with intense tenesmus.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Huang Qi, Lian Qiao and Da Huang, for abscesses, lesions, carbuncles, furuncles, burns, swelling and inflammation due to toxic Heat."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat and dries Dampness and detoxifies.","With Huang Lian and Bai Shao, for Damp-Heat dysentery with fever and tenesmus.","With Zhi Zi, for Damp-Heat jaundice and sores due to Heat toxin.","with Da Huang, for constipation."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, drains Damp-Heat, relieves toxicity, reduces swelling and invigorates the Blood.","With Huang Lian, Huang Qin, Da Huang and Lian Qiao, for Carbuncles and furuncles with or without abscesses and ulcerations.","with Da Huang, for constipation."]},{"herb":"LianQiao","dosage":"9-12g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and promotes urination."]},{"herb":"BoHe","dosage":"3-6g","actions":["Disperses Wind-Heat, cools and clears the head and eyes and relieves Stagnation of Liver Qi."]},{"herb":"JieGeng","dosage":"3-6g","actions":["Expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, for Lung abscess with expectoration of pus and pain in the chest and flanks."]},{"herb":"GanCao","dosage":"3-6g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, softens the Liver and relieves pain.","With Gan Cao, for abdominal pain due to disharmony between the Liver and Stomach.","With Huang Lian and Huang Qin, for Damp-Heat dysenteric disorders.","With Dang Gui, nourishes Yin and Blood.","With Huang Qin, for Dysenteric disorders with abdominal pain due to Heat entering the Interior."]},{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen.","With Bing Lang and Da Huang, for epigastric and abdominal fullness, distention and pain with constipation and red and white dysenteric diarrhea due to Stagnation in the Stomach and Intestines transforming into Damp-Heat.","With Bing Lang, for dysentery and diarrhea, especially when accompanied by tenesmus and abdominal distention and discomfort.","With Bai Shao, for diarrhea with profuse pus and Blood.",""]},{"herb":"BingLang","dosage":"6g","actions":["Regulates Qi, reduces accumulations, drains downward, unblocks the bowels, promotes urination and relieves nausea.","With Bai Shao, Mu Xiang and Huang Lian, for Damp-Heat dysenteric disorders with tenesmus."]},{"herb":"DaHuang","dosage":"6g","actions":["Drains Heat, purges accumulations, clears Heat, reduces Fire toxicity, transforms Dampness, promotes urination, invigorates the Blood and dispels Blood Stasis.","With Huang Lian, for A feeling of fullness and distention due to Heat Accumulation.","With Huang Lian and Huang Qin, for whole body Damp-Heat.","With Zhi Zi, Huang Qin and Lian Qiao, for strong pathogenic Heat in the Upper and Middle Jiaos and upward Flaring of Heat attacking the head.","with Dang Gui, for Blood Stasis.","With Huang Lian, Huang Qin and Bai Shao, for dysentery with Excess Damp-Heat."]}],"actions":["Clears Heat","Resolves toxicity","Invigorates the Blood","Reduces swelling","Reduces constipation","Alleviates pain"],"syndromes":["Abscesses due to Interior Heat"],"manifestations":{"symptoms":["Headache","Brain ringing","Swelling with no change in skin color","Fever","Irritability","Abdominal fullness","Vomiting","Dry heaves","Thirst","Constipation","Reduced urination","Reddish urination"],"tongue":"Reddish","tongueCoat":"Turbid and yellow","pulse":"Deep and excess"},"conditions":[{"condition":"Headache","name":"Headache"},{"condition":"Jaundice","name":"Jaundice"},{"name":"Liver abscess"},{"name":"Lung Abscess"},{"condition":"Mastitis","name":"Mastitis"},{"condition":"Dysentery","name":"Dysentery"},{"name":"Brain ringing"},{"name":"Appendicitis"},{"name":"Cellulitis"},{"name":"Lymphadenitis"},{"condition":"Cholecystitis","name":"Acute cholecystitis"},{"condition":"Constipation","name":"Constipation"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}