{"formula":"NeiXiaoLuoLiWan","names":{"pinyin":"nei xiao luo li wan","hanzi":"内消瘰疠片","english":"internally reducing cervical adenopathy pills","commonEnglish":"Internally Reducing Cervical Adenopathy Pills","aka":[""]},"herbs":[{"herb":"XiaKuCao","dosage":"25g","actions":["Clears Hot Phlegm and dissipates nodules.","With Xuan Shen and Kun Bu, for nodules due to Phlegm Fire."]},{"herb":"XuanShen","dosage":"16g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, transforms Phlegm-Heat, drains Fire and relieves toxicity.","With Jie Geng and Gan Cao, for a sore throat with Dryness and pain."]},{"herb":"DaQingYan","dosage":"16g","actions":["Clears Heat and cools the Blood, improves eyesight and moistens dryness."]},{"herb":"HaiZao","dosage":"3g","actions":["Reduces Phlegm and softens areas of hardness.","With Xia Ku Cao, Lian Qiao and Xuan Shen, for scrofula.",""]},{"herb":"BoHe","dosage":"3g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat, relieves Stagnation of Liver Qi and expels turbid filth.","With Xia Ku Cao, for scrofula."]},{"herb":"ChuanBeiMu","dosage":"3g","actions":["Clears Heat, transforms Phlegm, nourishes and moistens the Lungs and dissipates nodules.","With Lian Qiao, for goiter."]},{"herb":"TianHuaFen","dosage":"3g","actions":["Clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus and reduces swelling."]},{"herb":"GeQiao(HaiGeKe)","dosage":"3g","actions":["Clears Lung Heat, transforms Phlegm, descends Lung Qi, softens hardness and dissipates nodules.","With Kun Bu and Hai Zao, for goiter and scrofula."]},{"herb":"BaiLian","dosage":"3g","actions":["Drains Fire, relieves toxicity, eliminates Dampness, resolves lumps, reduces swelling, relieves pain, promotes the healing of wounds and generates flesh."]},{"herb":"KunBu","dosage":"3g","actions":["Resolves Phlegm, softens Phlegm nodules, promotes urination and reduces swelling.","With Hai Zao, for goiter and scrofula.","With Hai Zao, Chuan Bei Mu, Xia Ku Cao, Xuan Shen and Ge Qiao, for scrofula, goiter and other nodules."]},{"herb":"LianQiao","dosage":"3g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat.","With Xia Ku Cao, Chuan Bei Mu and Xuan Shen, for scrofula and tuberculosis adenitis."]},{"herb":"ShuDiHuang","dosage":"3g","actions":["Nourishes the Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"JieGeng","dosage":"3g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus."]},{"herb":"ZhiKe(Qiao)","dosage":"3g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"DangGui","dosage":"3g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"XiaoShi","dosage":"3g","actions":["Softens hardness, eliminates accumulations, dissolves abscesses, removes toxins and relieves swellings."]}],"actions":["Clears Heat","Transforms Phlegm","Dissipates nodules"],"syndromes":["Phlegm-Heat"],"manifestations":{"symptoms":["Swollen, painful glands that have not suppurated","Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"CervicalLymphadenopathy","name":"Cervical lymphadenopathy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}