{"formula":"NeiYiWan","names":{"pinyin":"nei yi wan","hanzi":"内伊囊","english":"endometriosis pill","commonEnglish":"Endometriosis Pill","aka":[""]},"herbs":[{"herb":"BieJia","dosage":"9-30g","actions":["Nourishes Yin, anchors Yang and Invigorates the Blood, promotes menstruation, softens hardness and dissipates nodules."]},{"herb":"TuBieChong","dosage":"3-12g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation and disperses lumps and masses."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Promotes the movement of Qi, dissipates clumps and stops pain."]},{"herb":"ShaRen","dosage":"3-7g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen and warms the Middle."]},{"herb":"GuiBan","dosage":"9-45g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys, nourishes the Blood, enriches Yin and stabilizes the Chong and Ren channels.","With Zhi Bie Jia, for steaming bones and nightsweats due to Liver and Kidney Yin Deficiencies with Heat Rising."]},{"herb":"WuYao","dosage":"3-10g","actions":["Promotes movement of Qi, warms the Kidneys, disperses Cold and alleviates pain.","With Dang Gui, disperses Cold and stops pain, for abdominal pain due to External Cold."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Xiao Hui Xiang and Wu Yao, for abdominal pain and hernias due to Qi and Blood Stasis due to Cold."]},{"herb":"LiZhiHe","dosage":"6-15g","actions":["Disperses Cold, regulates Qi and Stagnation and stops pain.","With Ju He, for ovarian cysts and abdominal masses."]},{"herb":"ChuanShanJia","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks menstruation, reduces swelling and promotes the discharge of pus.","With Zao Jiao Ci, for suppurative, inflamed skin lesions that have pustulated but remain closed."]},{"herb":"XiaoHuiXiang","dosage":"3-12g","actions":["Warms the Liver and Kidneys, expels Cold, regulates Qi, harmonizes the Stomach and alleviates pain."]},{"herb":"GanCao","dosage":"3-14g","actions":["Moderates spasms, alleviates pain and moderates and harmonizes the harsh properties of other herbs.","With Jin Yin Hua, for damp rashes or acne."]},{"herb":"JinYinHua","dosage":"6-20g","actions":["Clears Heat, resolves Fire toxicity and clears Damp-Heat from the Lower Jiao.","With Gan Cao, for toxic swellings and sores.","With Dang Gui, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"ZaoJiaoCi","dosage":"3-10g","actions":["Draws out toxicity, discharges pus, invigorates the Blood and reduces swelling."]},{"herb":"SheTui(Pi)","dosage":"1.5-6g","actions":["Resolves toxins."]},{"herb":"DangGui","dosage":"3-15g","actions":["Invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus and alleviates pain.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Wu Yao, disperses Cold and stops pain, for abdominal pain due to External Cold and cold dysmenorrhea or postpartum abdominal pain."]},{"herb":"DongChongXiaCao","dosage":"3-14g","actions":["Tonifies the Kidneys, strengthens Yang and augments Jing."]},{"herb":"XueJie","dosage":"0.3-0.6g","actions":["Invigorates the Blood, dispels Blood Stasis, stops bleeding and alleviates pain."]}],"actions":["Invigorates the Blood","Promotes menstruation","Softens hardness","Dissipates nodules","Calms the Spirit","Warms the Lower Jiao"],"syndromes":["Blood Stagnation due to Accumulation of Cold"],"manifestations":{"symptoms":["Pain in the lower abdomen and pelvic region","Heavy and/or irregular periods","Spotting between periods or before periods","Infertility","Difficulty conceiving","Pain during sexual intercourse","Abdominal swelling","Painful bowel movements, especially during menstruation","Bleeding from the rectum during menstruation","Lower abdominal pain during menstruation","Low back pain","Painful urination during menstruation","Sometimes no symptoms at all","Other symptoms may include: Headaches Low grade fevers Depression Hypoglycemia Anxiety Susceptibility to infections and allergies"]},"conditions":[{"condition":"Endometriosis","name":"Endometriosis"},{"condition":"UterineMyoma","name":"Uterine fibroids"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}