{"formula":"NeiYiFangYiHao","names":{"pinyin":"nei yi fang yi hao","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies Invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Dan Shen and Mo Yao, for pain due to Blood Stasis in the extremities.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, nourishes the Blood and calms the Spirit.","With Dang Gui, for irregular menstruation and retained lochia from Blood Stasis due to trauma."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis and nourishes Liver and Kidney Yin."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Chuan Xiong, Dang Gui and Pu Huang, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Xiang Fu, for flank pain, abdominal pain and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Chuan Xiong, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves the discomfort of painful obstruction.","With Dang Gui and Chuan Xiong, for irregular menstruation due to Yang Deficiency with Cold Stagnation."]},{"herb":"MoYao","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling."]},{"herb":"WuLingZhi","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis,","alleviates pain, transforms Stasis and stops bleeding."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis and stops bleeding by astringing.","With Wu Ling Zhi, for Blood Stasis causing menstrual irregularity, dysmenorrhea and lochiostasis with chest and abdominal pain."]},{"herb":"XueJie","dosage":"0.3-0.6g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and stops bleeding."]}],"actions":["Invigorates the Blood","Breaks up Stagnation","Warms the channels","Unblocks Yang"],"syndromes":["Kidney Yang Deficiency with Blood Stagnation"],"manifestations":{"symptoms":["The origin of this pattern is either a constitutional weakness, or a history of surgical procedures","Pain in the lower abdomen and pelvic region","Heavy and/or irregular periods","Spotting between periods or before periods","Infertility","Difficulty conceiving","Pain during sexual intercourse","Abdominal swelling","Painful bowel movements, especially during menstruation","Bleeding from the rectum during menstruation","Lower abdominal pain during menstruation","Painful urination during menstruation","Low back pain","Sometimes no symptoms at all","Abdominal tenderness","A feeling of pressure and pain during or after periods","Soreness of the back, legs, and hips","Dizziness","Scanty periods or spotting","Blood clots with periods","Other symptoms may include: Headaches Low grade fevers Depression Hypoglycemia Anxiety"],"tongue":"Pale or with spots","tongueCoat":"Thin and white","pulse":"Deep, thin and choppy"},"conditions":[{"condition":"Endometriosis","name":"Endometriosis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Take from premenstruation through menstruation."],"modifications":[]}