{"formula":"NeiZhangMingYanWan","names":{"pinyin":"nei zhang ming yan wan","hanzi":"內障明眼丸","english":"cataract visiion","commonEnglish":"Cataract Vision-Improving Pills","aka":[""]},"herbs":[{"herb":"ShiHu","dosage":"15g","actions":["Nourishes the Yin, clears Heat, generates fluids, enriches Kidney Yin, reduces Heat from Deficiency, tonifies the Kidneys, augments Jing and brightens the eyes.","With Gou Qi Zi, Ju Hua and Shu Di Huang, for gradual onset of blurred vision and dizziness."]},{"herb":"JuHua","dosage":"8g","actions":["Calms the Liver, clears the eyes, calms Liver Yang, extinguishes Wind and detoxifies."]},{"herb":"BaiShao","dosage":"8g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui and Shu Di Huang, for dizziness and blurred vision, due to Blood Deficiency or Stasis."]},{"herb":"GouQiZi","dosage":"8g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Ju Hua, for Liver and Kidney Deficiency with Jing and Blood unable to rise and nourish the eyes with tinnitus, headache, and visual impairment."]},{"herb":"DangGui","dosage":"8g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge.","With Bai Shao, regulates and harmonizes Qi and Blood for Blood Deficiency Heat.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"TuSiZi","dosage":"6g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver and improves vision.","With Ju Hua, for unclear vision."]},{"herb":"NiuXi","dosage":"6g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, and descends Blood and Fire.","With Sheng Di Huang, powerfully clears Deficiency Fire Blazing Upward."]},{"herb":"ShengDiHuang","dosage":"6g","actions":["Clears Heat, cools the Blood and nourishes Yin.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"6g","actions":["Nourishes Liver and Kidney Yin,nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency.","With Dang Gui and Huang Lian, for Blood Deficiency with Heat."]},{"herb":"HuangBai","dosage":"6g","actions":["Drains Kidney Fire, drains Fire and relieves Fire toxicity."]},{"herb":"WuWeiZi","dosage":"6g","actions":["Tonifies the Kidneys and astringes Jing."]},{"herb":"HuangQi","dosage":"5g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins.","With Sheng Di Huang and Huang Bai, for Yin Deficiency with night sweats."]},{"herb":"DiGuPi","dosage":"5g","actions":["Clears Heat, cools the Blood and drains Yin Deficiency Fire."]},{"herb":"DaHuang","dosage":"3g","actions":["Drains Heat, purges accumulations, and reduces Fire toxicity.","With Dang Gui, for Blood Stasis.","with Sheng Di Huang, for Blazing Heart and Stomach Fire."]},{"herb":"HuangLian","dosage":"3g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity."]},{"herb":"MingFan","dosage":"1g","actions":["Relieves toxicity, dries Dampness, alleviates itching, restrains and inhibits sores, generates flesh and transforms putrefication."]}],"actions":["Clears Heat","Improves vision","Nourishes Yin and Blood of the Liver and Kidneys","Moves Qi and Blood","Tonifies Qi and Blood"],"syndromes":["Diminished vision due to Liver and Kidney Yin Deficiency with Heat"],"manifestations":{"symptoms":["Night blindness","Poor vision","Itchy painful eyes","Impaired vision","Ocular pain","Red eyes"],"tongue":"Red","tongueCoat":"Little or none","pulse":"Thready and Rapid or Thready , Rapid and Wiry"},"conditions":[{"condition":"Blepharitis","name":"Blepharitis"},{"condition":"Cataracts","name":"Cataract"},{"condition":"Conjunctivitis","name":"Conjunctivitis"},{"condition":"Glaucoma","name":" Glaucoma"},{"name":" Night blindness"},{"name":"Ocular pain"},{"name":" Poor vision"},{"name":" Red eyes"},{"name":"Ocular disease following surgery"}],"contra":{"contraindications":["Do not use long-term."],"interactions":[""]},"notes":[""],"modifications":[]}