{"formula":"NiaoDuErHaoFang","names":{"pinyin":"niao du er hao fang","hanzi":"尿毒二号方","english":"uremia formula #2","commonEnglish":"Uremia Formula #2","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"30g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Sheng Jiang and Wu Zhu Yu, for vomiting with clear signs of Cold in the Middle Jiao.","With Hou Po, for Phlegm-Dampness with Qi Stagnation."]},{"herb":"DaiZheShi","dosage":"30g","actions":["Strongly descends rebellious Qi, calms the Liver, anchors Floating Yang and clears Liver Fire.","With Zhi Ban Xia and Xuan Fu Hua, for vomiting, hiccup, and belching due to rebellious Qi."]},{"herb":"LiuYueXue","dosage":"30g","actions":["Promotes diuresis, clears Heat and removes toxicity."]},{"herb":"HeiDou","dosage":"30g","actions":["Tonifies the Kidneys and relieves low back and knee pain."]},{"herb":"XuanFuHua","dosage":"9g","actions":["Expels Phlegm, removes pathogenic water, descends Qi and stops vomiting.","With Zhi Ban Xia, for vomiting, cough, wheezing and epigastric distention due to congested fluids."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Zhi Ban Xia, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools."]},{"herb":"HouPo","dosage":"6g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi."]},{"herb":"ShengJiang","dosage":"6g","actions":["Warms the Middle and stops vomiting.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold."]},{"herb":"HuangLian","dosage":"3g","actions":["Cools Stomach Fire and Heat, alleviates nausea and descends rebellious Qi.","With Zhi Ban Xia, for Cold and Heat in the Middle Jiao with abdominal fullness, nausea and vomiting.","With Wu Zhu Yu, for epigastric and abdominal pain, acid regurgitation, ulcers, vomiting and epigastric upset due to Liver Fire or Stomach Heat."]},{"herb":"WuZhuYu","dosage":"3g","actions":["Warms the Spleen, stops diarrhea, expels Damp-Cold, promotes the movement of Qi and alleviates pain."]}],"actions":["Warms Yang","Assists transportation","Harmonizes the Stomach","Expels Turbid Dampness"],"syndromes":["Turbid Dampness in the San Jiao"],"manifestations":{"symptoms":["A lusterless face","Nausea","Vomiting","Anorexia","A slimy mouth with a sweet taste","Inhibited defecation","Heaviness of the limbs"],"tongue":"Thick and pale with teethmarks","tongueCoat":"White","pulse":"Deep and thready"},"conditions":[{"condition":"KidneyFailure","name":"Kidney failure"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}