{"formula":"NingShenLingFang","names":{"pinyin":"ning shen ling fang","hanzi":"甯神灵方","english":"calm the spirit magic formula","commonEnglish":"Calm the Spirit Magic Formula","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"20g","actions":["Resolves Shao Yang disorders, spreads Liver Qi, relieves Stagnation, raises Yang Qi and resolves Phlegm and congestion.","With Huang Qin, restores normal function of the Liver and Gallbladder.","With Zhi Ban Xia and Huang Qin, for Shao Yang disorders with alternating chills and fever and a sensation of fullness in the hypochondria and chest."]},{"herb":"HuangQin","dosage":"15g","actions":["Clears Heat, dries Dampness and calms ascending Liver Yang.","With Chai Hu, for Heat in the Shao Yang with alternating chills and fever and nausea.","With Da Huang, for constipation."]},{"herb":"ZhiBanXia.htm","dosage":"15g","actions":["Dries Dampness and transforms Phlegm.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"LongGu","dosage":"15g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors Floating Yang."]},{"herb":"MuLi","dosage":"15g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Gui Zhi, for restlessness, irritability, palpitations and spontaneous sweating due to Floating Yang."]},{"herb":"DaHuang","dosage":"7.5g","actions":["Drains Heat, purges accumulations, transforms Dampness, promotes urination, invigorates the Blood, dispels Blood Stasis and eliminates Phlegm."]},{"herb":"GanCao","dosage":"10g","actions":["Tonifies the Spleen and augments Qi, resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"GuiZhi","dosage":"15g","actions":["Unblocks Yang, transforms Qi and thin mucus, assists Heart Yang, warms and facilitates the flow of Yang Qi in the chest, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels, warms the Middle and directs Turbid Yin downward.","With Long Gu and Mu Li, for irritability and insomnia due to floating Yang in the Upper Jiao and injured Yin in the Lower Jiao due to Heart Yang Deficiency.","With Chai Hu, for Tai Yang Stage moving to Shao Yang Stage.","With Da Huang, for combined Interior/Exterior conditions with chills, headache, fever, sweating and abdominal fullness and pain."]}],"actions":["Harmonize the Liver and Gallbladder","Purge Internal Heat","Resolve Phlegm"],"syndromes":["Shao Yang Syndromes"],"manifestations":{"symptoms":["Depression","Alternating chills and fever (not so likely)","Feeling of oppression in the chest","Plum-seed Qi Stagnation","Restlessness","Irritability","Continuous vomiting","Headache (side of head)","Hypochondriac pain","Epigastric pain","Bitter taste in mouth","Digestive disruption","Anorexia","Nausea","Acid regurgitation","Burning diarrhea or","Constipation","Menstrual problems","Dry throat","Heart pain with vomiting","Throat pain","Hip pain"],"tongue":"Red","tongueCoat":"Thin yellow","pulse":"Wiry and forceful or Slippery-wiry"},"conditions":[{"condition":"Depression","name":"Depression"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}