{"formula":"NiuBangJieJiTang","names":{"pinyin":"niu bang jie ji tang","hanzi":"牛蒡解肌汤","english":"arctium decoction to release the muscle layer","commonEnglish":"Arctium Decoction to Release the Muscle Layer","aka":["Decoction of Burdock Fruit for Expelling Pathogenic Factors from the Muscles"]},"herbs":[{"herb":"NiuBangZi","dosage":"10g","actions":["Disperses Wind-Heat, relieves toxicity, vents rashes, and benefits the throat.","With Jing Jie and Bo He, for throat inflammation and productive cough due to Wind-Heat.","With Lian Qiao, unblocks and drains Heat toxin and disperses clumps and swellings for sore, swollen throat, mumps, boils and other Heat toxin lesions and ulcerations, and abscesses of the tongue and mouth."]},{"herb":"BoHe","dosage":"6g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat and vents rashes.","With Jing Jie and Lian Qiao, for Wind-Heat with fever, headache and a sore throat.","With Xia Ku Cao, for inflammation of the eyes and scrofula.","With Niu Bang Zi, for sores, dry throat, cough with yellow sputum and incomplete expression of measles or pruritic rash due to Wind-Heat."]},{"herb":"JingJie","dosage":"6g","actions":["Releases the Exterior, expels Wind, vents rashes, relieves itching, dispels Wind and relieves muscle spasms.","With Jing Jie, releases the Exterior to induce sweating, disperses Wind in the head, vents rashes and alleviates itching."]},{"herb":"LianQiao","dosage":"10g","actions":["Clears Heat, especially in the Upper Jiao, clears Blood Heat, relieves toxicity, reduces abscesses and dissipates clumps.","With Niu Bang Zi and Bo He, for Wind-Heat.","With Zhi Zi, for Heat remaining in the Heart channel with sores in the mouth or on the tongue and dark, scanty urine or urinary discomfort."]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat, cools, harmonizes and invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling."]},{"herb":"XiaKuCao","dosage":"12g","actions":["Clears Hot Phlegm and dissipates nodules."]},{"herb":"ZhiZi","dosage":"10g","actions":["Clears Heat, reduces Fire, drains Damp-Heat, cools and invigorates the Blood, relieves toxicity and reduces swelling.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood."]},{"herb":"XuanShen","dosage":"10g","actions":["Clears Heat, cools the Blood, nourishes Yin, transforms Phlegm-Heat, drains Fire, relieves toxicity, softens hardness and dissipates nodules.","With Mu Dan Pi, for erysipelas and purplish rashes."]},{"herb":"ShiHu","dosage":"12g","actions":["Nourishes Stomach and Lung Yin, clears Heat and generates fluids."]}],"actions":["Dispels Wind","Clears Heat","Cools the Blood","Reduces swelling"],"syndromes":["Localized abscesses and swelling due to Wind-Heat"],"manifestations":{"symptoms":["Burning, red, swelling and pain caused by carbuncle on the skin","Phlegm and toxins in the neck","Mild chills","High fever","Little sweating","Thirst","Deep-colored urine","Toothache"],"tongue":"Red tip","tongueCoat":"Whitish or Yellowish","pulse":"Floating rapid pulse"},"conditions":[{"condition":"CervicalLymphadenopathy","name":"Cervical lymphadenitis"},{"condition":"Gingivitis","name":"Periodontitis"},{"condition":"Influenza","name":"Influenza"},{"condition":"Mastitis","name":"Mastitis"},{"condition":"Toothache","name":"Toothache"},{"condition":"NeckPain","name":"Neck pain"},{"condition":"Furuncles","name":"Boils"},{"condition":"Furuncles","name":"Furuncles"},{"name":"Cellulitis"},{"name":"Abscesses"},{"name":"Sores"}],"contra":{"contraindications":["Use with caution for those with underlying Yin and Body Fluid Deficiency."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"neck pain","modifications":[{"herb":"ZheBeiMu","modification":"+ 9g Bul. Fritillariae Thunbergii"},{"herb":"JiangCan","modification":"+ 9g Bombyx Batryticatus"}]}]}