{"formula":"NiuBangGanJieTangJiaJian","names":{"pinyin":"niu bang gan jie tang jia jian","hanzi":"牛旁甘桔汤加減","english":"modified arctium, licorice and platycodon decoction","commonEnglish":"Modified Arctium, Licorice and Platycodon Decoction","aka":[""]},"herbs":[{"herb":"NiuBangZi","dosage":"3-9g","actions":["Disperses Wind-Heat, benefits the throat and relieves toxicity.","With JIe Geng and Bo He, for throat inflammation and productive cough due to Wind-Heat.","With Lian Qiao, unblocks and drains Heat toxin, disperses clumps and swellings for sore, swollen throat, swellings like mumps, boils and other Heat toxin lesions and ulcerations and abscesses of the tongue and mouth.","With Jin Yin Hua, Bo He, Lian Qiao and Jie Geng, for Sore throat caused by a febrile disorder or Wind-Heat."]},{"herb":"JieGeng","dosage":"3-9g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, for Excess disorders in the Upper Jiao with no disorder in the Lower Jiao."]},{"herb":"GanCao","dosage":"2-12g","actions":["Moistens the Lungs, resolves Phlegm, stops cough, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Jie Geng, for pain and swelling of the throat.","With Niu Bang Zi, strongly clears the throat and Lungs to treat Wind-Heat attacks the Lungs or Fire toxin flaring upwards."]},{"herb":"JinYinHua","dosage":"9-15g","actions":["Clears Heat, resolves Fire toxicity and vents and disperses External Wind-Heat.","With Lian Qiao, for various Heat disorders (Exterior, Interior Qi, Blood).","With Lian Qiao, Jie Geng and Niu Bang Zi, for pain and swelling of the throat.","With Gan Cao, for toxic swellings and sores."]},{"herb":"LianQiao","dosage":"6-15g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses and dissipates clumps.","With Niu Bang Zi and Bo He, for Wei Stage Heat.","With Jin Yin Hua, for initial stage Wind-Heat.","With Shan Dou Gen, Jie geng and Gan Cao, for throat Bi and lumps and nodules."]},{"herb":"ShanDouGen","dosage":"3-9g","actions":["Clears Heat, relieves Fire toxicity and improves the throat.","With Niu Bang Zi, and Jie Geng, for pain and swelling of the throat."]},{"herb":"LuGen","dosage":"15-30g","actions":["Clears Heat and irritability from the Lungs and Stomach and generates fluids."]},{"herb":"BoHe","dosage":"1.5-6g","actions":["Disperses Wind-Heat and cools and clears the head and eyes and benefits the throat","With Niu Bang Zi, for sores, dry throat, cough with yellow sputum, incomplete expression of measles or pruritic rash due to Wind-Heat."]}],"actions":["Releases the Exterior","Clears Heat","Regulates the throat"],"syndromes":["Initial Stage Wind-Heat Attacks the Lungs"],"manifestations":{"symptoms":["Fever and chills with fever predominant","Maybe anhidrosis","Sore throat","General malaise","Swollen and engorged tonsils without pus spots","Sweat","Headache","General body aches","Red throat"],"tongue":"Red tip and edges","tongueCoat":"Thin and white","pulse":"Floating and rapid"},"conditions":[{"condition":"AcuteTonsillitis","name":"Acute tonsillitis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"predominance of Cold-Damp with anhidrosis","modifications":[{"herb":"TianHuaFen","modification":"+ Rx. Trichosanthis"},{"herb":"DanDouChi","modification":"+ Sm. Sojae Preparatum"},{"herb":"JingJie","modification":"+ Hb. Schizonepetae"}]},{"purpose":"a parched throat and dry mouth","modifications":[{"herb":"LuGen","modification":"+ More Rz. Phragmitis"}]},{"purpose":"evident swelling and redness of the tonsils","modifications":[]}]}