{"formula":"NiuCheShenQiWan","names":{"pinyin":"niu che shen qi wan","hanzi":"牛车腎氣丸","english":"achyranthis and plantago formula","commonEnglish":"Achyranthis and Plantago Formula (Pill)","aka":["Tonify Kidney Qi Pill with Achyranthis and Plantago"]},"herbs":[{"herb":"CheQianZi","dosage":"5g","actions":["Nourishes Yin and Blood and tonifies the Kidneys.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Rou Gui, for Kidney Yang Deficiency."]},{"herb":"CheQianZi","dosage":"3g","actions":["Nourishes Kidney Yin and Yang, astringes Yin and stops Excess perspiration.","With Shan Yao, tonifies the Liver and benefits the Spleen."]},{"herb":"CheQianZi","dosage":"3g","actions":["Strengthens the Spleen, stabilizes the Kidneys and nourishes Jing.","With Shu Di Huang and Shan Zhu Yu, for Kidney Deficiency with spermatorrhea, dizziness, tinnitus, lower back pain, impotence and night sweats."]},{"herb":"CheQianZi","dosage":"0.5g","actions":["Tonifies the Ming Men, dispels Cold, eliminates Dampness and tonifies Kidney Yang.","With Shu Di Huang and Rou Gui, for Kidney Yang Deficiency with waning of Ming Men Fire with aversion to Cold, weak and sore back and legs, impotence, and urinary frequency."]},{"herb":"CheQianZi","dosage":"1g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain, leads the Fire back to its source and assists the generation of Qi and Blood.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and Deficiency of Ming Men Fire with impotence or infertility."]},{"herb":"CheQianZi","dosage":"3g","actions":["Promotes urination and prevents Kidney Fire as a result of tonification.","With Mu Dan Pi, for steaming bone disorder, dizziness and vertigo.","With Fu Ling and Mu Dan Pi, regulates the Kidneys, Liver and Spleen, drains and tonifies.",""]},{"herb":"CheQianZi","dosage":"3g","actions":["Clears Heat and Deficiency Fire, cools and harmonizes the Blood, invigorates the Blood and dispels Blood Stasis."]},{"herb":"CheQianZi","dosage":"3g","actions":["Strengthens the Spleen and drains Dampness.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.",""]},{"herb":"NiuXi","dosage":"3g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin and clears Damp-Heat in the Lower Jiao."]},{"herb":"CheQianZi","dosage":"3g","actions":["Promotes urination and clears Damp-Heat.","With Ze Xie, for Lin Syndrome, edema and distention.","With Niu Xi, for Kidney Deficiency edema."]}],"actions":["Nourishes Kidneys Yang","Drains Dampness","Invigorates the Blood"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Aversion to Cold","Watery stools with undigested food","Lower back pain","Weakness of the lower extremities","A cold sensation in the lower half of the body","Tenseness in the lower abdomen","Pain and cramps in the lower abdomen","Panting and irritability to the point of having difficulty lying down","Will breathe most comfortably while leaning against something","Nocturia","May be numbness in the lower abdomen","Urinary difficulty with edema or Spasmodic pain in the lower abdomen","Excessive urination","If severe, may be incontinence of urine","May have persistent diarrhea","Dizziness","Vertigo","Dysuria","May have flushed face (Yang floating upward)","Thirst with frequent, copious urination (Xiao Ke)","Fatigue (severe)","May have severe perspiration (Yang floating upward)","Constipation","Lassitude","Pale face","Edema of the face and feet","Severe edema of the legs (may prevent walking)","Maybe cough","Maybe asthma"],"tongue":"Pale, may be swollen","tongueCoat":"Thin, white and moist","pulse":"Deep, Deep and thready and/or Weak and slow"},"conditions":[{"condition":"BreastCancer","name":"Chemotherapy for breast cancer"},{"condition":"Nephritis","name":"Nephritis"},{"condition":"Urolithiasis","name":"Renal calculi"},{"condition":"RenalTuberculosis","name":"Nephrotuberculosis"},{"name":"Albuminaria"},{"name":"Anuria"},{"condition":"Enuresis","name":"Enuresis"},{"condition":"Arteriosclerosis","name":"Arteriosclerosis"},{"condition":"Hypertension","name":"Hypertension"},{"condition":"Hypotension","name":"Hypotension"},{"condition":"ProstaticHyerptrophy","name":"Benign prostatic hypertrophy"},{"condition":"Diabetes","name":"Diabetes"},{"condition":"Sciatica","name":"Sciatica"},{"name":"Beriberi"},{"name":"Cerebral hemorrhage"},{"name":"Nervous exhaustion"},{"condition":"Forgetfulness","name":"Amnesia"},{"name":"Nocturnal emission"},{"name":"Skin disease"},{"name":"Eye ailments"},{"name":" Ear disorders "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}