{"formula":"NiuHuangShangQingWan","names":{"pinyin":"niu huang shang qing wan","hanzi":"牛黃上清丸","english":"cattle gallstone pill to clear the upper (burner)","commonEnglish":"Cattle Gallstone to Clear the Upper (Burner)","aka":["Cattle Gallstone Pill to Ascend and Clear"]},"herbs":[{"herb":"HuangLian","dosage":"24g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue and rashes."]},{"herb":"HuangQin","dosage":"75g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and calms ascending Liver Yang.","With Huang Lian and Zhi Zi, for acute febrile disease.","With Zhi Zi, for sores due to Heat toxin.","With Huang Lian, Huang Bai and Zhi Zi, for lesions and sores with redness, swelling and pain."]},{"herb":"HuangBai","dosage":"15g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Zhi Zi, resolves constraint and directs Qi downward for clearing Heat and Fire from the Liver channel.","With Huang Lian and Lian Qiao, for skin abscesses and lesions."]},{"herb":"ZhiZi","dosage":"75g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, cools the Blood, relieves toxicity, reduces swelling and activates the Blood.","With Huang Lian, Da Huang and Lian Qiao, for irritability and restlessness with high fever due to Toxic Heat and carbuncles and furuncles with or without abscesses and ulcerations.","With Da Huang, for constipation."]},{"herb":"NiuHuang","dosage":"3g","actions":["Drains Heat and resolves Fire toxicity."]},{"herb":"BingPian","dosage":"15g","actions":["Clears Heat, drains Fire, resolves toxicity, clears the eyes, removes superficial visual obstructions and alleviates itching."]},{"herb":"DaHuang","dosage":"120g","actions":["Drains Heat, purges accumulations, drains Fire, drains Heat from the Blood, invigorates the Blood, dispels Blood Stasis and reduces Fire toxicity.","With Huang Lian and Huang Qi, for whole body Damp-Heat.","With Dang Gui, for Blood Stasis."]},{"herb":"LianQiao","dosage":"75g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat."]},{"herb":"ShiGao","dosage":"120g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst, clears Excess Heat from the Lungs and heals eczema, burns and ulcerated sores and wounds.","With Huang Qin, Huang Lian and Huang Bai, for Toxic Heat with infection."]},{"herb":"JuHua","dosage":"60g","actions":["Disperses Wind, clears Heat, calms the Liver, clears the eyes, calms the Liver Yang, extinguishes Wind and detoxifies.","With Ju Hua, for Wind-Heat patterns with fever, chills, headache, dizziness, sore eyes and sore throat.","With Fang Feng, for Wind-Heat irritating the exterior with slight chills, mild fever, headache and itchy eyes.","With Chuan Xiong, for headache due to Wind-Heat or Liver Yang Rising."]},{"herb":"FangFeng","dosage":"24g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Bo He and Lian Qiao, for Wind-Heat.","With Bo He, Huang Qin, Huang Lian and Lian Qiao, for acne due to Wind-Heat Attacking the upper body."]},{"herb":"JingJie","dosage":"24g","actions":["Releases the Exterior, expels Wind, vents rashes and relieves itching.","With Bo He, disperses Wind in the head, vents rashes and alleviates itching.","With Huang Qin and Ju Hua, for eye inflammation associated with Wind-Heat.","With Fang Feng, for pruritic itching."]},{"herb":"BaiZhi","dosage":"24g","actions":["Expels Wind, eliminates Dampness, unblocks the nasal passages, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Chuan Xiong, for headache.","With Huang Qin, for Wind-Heat headache."]},{"herb":"ChuanXiong","dosage":"24g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"JieGeng","dosage":"24g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus Opens and raises Lung Qi, directing the effects of other herbs to the upper body and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao and Huang Qin, disseminates Lung Qi, expels Phlegm, resolves toxicity, and expels pus for productive cough with hoarseness, pain and swelling of the throat due to Wind-Heat.","With Bai Zhi, for ulcerated abscess where pus is being discharged slowly."]},{"herb":"GanCao","dosage":"15g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"BoHe","dosage":"15g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat, vents rashes and relieves Stagnation of Liver Qi.","With Ju Hua, for headache due to Wind-Heat and headache, pain, redness, and swelling of the eyes due to Liver Fire."]},{"herb":"ChiShao","dosage":"24g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, clears Liver Fire, relieves eye pain, reduces swelling from sores and abscesses and relieves pain.","With Ju Hua, and Huang Qin, for redness, pain and swelling of the eyes."]},{"herb":"DangGui","dosage":"75g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"LianZiXin","dosage":"60g","actions":["Drains Heart Fire and relieves irritability."]},{"herb":"XiongHuang","dosage":"24g","actions":["Relieves toxicity and kills parasites."]}],"actions":["Clears Heat","Relieves toxicity","Releases Wind-Heat from the Exterior"],"syndromes":["Toxic Wind-Heat"],"manifestations":{"symptoms":["Headache","Red eyes","Pain and swelling of the throat and gums","Ulcerations of the mouth and tongue","Dizziness","Tinnitus","Constipation","Toothache"],"tongue":"Red and prickly","tongueCoat":"Yellow","pulse":"Floating and rapid or Rapid"},"conditions":[{"condition":"Blepharitis","name":"Blepharitis"},{"condition":"Conjunctivitis","name":" Conjunctivitis"},{"condition":"Headache","name":"Headache"},{"condition":"AcutePharyngitis","name":"Acute pharyngitis"},{"name":" Sore throat"},{"condition":"Gingivitis","name":"Acute gingivitis"},{"condition":"AcuteTonsillitis","name":"Acute tonsillitis "},{"condition":"Hypertension","name":"Hypertension"},{"condition":"Constipation","name":"Constipation"},{"condition":"HerpesGenitalia","name":"Labial herpes"},{"name":" Mouth ulcer "},{"name":" Stomatitis "},{"name":" Toothache"},{"condition":"Tinnitus","name":"Tinnitus"}],"contra":{"contraindications":["Contraindicated during pregnancy."],"interactions":[""]},"notes":[""],"modifications":[]}