{"formula":"NiuHuangQingXinWan","names":{"pinyin":"niu huang qing xin wan","hanzi":"牛黃清心丸","english":"cattle gallstone pill to clear the heart","commonEnglish":"Cattle Gallstone Pill to Clear the Heart","aka":[""]},"herbs":[{"herb":"NiuHuang","dosage":"0.75g","actions":["Clears the Heart, opens the Orifices aromatically, awakens the Spirit, vaporizes Phlegm, clears the Liver, relieves Fire toxicity, extinguishes Wind, stops tremors, drains Heat and resolves Fire toxicity.","With Huang Lian, Zhi Zi and Zhu Sha, for delirium and irritability due to Heat attacking the Pericardium, as in Ying Stage Heat."]},{"herb":"ZhuSha","dosage":"4.5g","actions":["Sedates the Heart, calms the Spirit, expels Phlegm, sedates jitteriness and convulsions while stopping tremors, clears Heat and relieves toxicity.","With Huang Lian, for disturbances of the Spirit as a result of Heart Fire."]},{"herb":"HuangLian","dosage":"15g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity, stops bleeding, clears Heart Fire and drains Stomach Fire."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood, stops bleeding and calms ascending Liver Yang.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, cough with yellow sputum and epistaxis or hematemesis.","With Huang Lian and Zhi Zi, for acute febrile disease."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, cools the Blood and relieves toxicity."]},{"herb":"YuJin","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears Heat, cools the Blood, clears the Heart and Pericardium and opens the Orifices."]}],"actions":["Clears Heat","Eliminates toxins","Opens the Orifices","Calms the Shen"],"syndromes":["Heat Invading the Pericardium"],"manifestations":{"symptoms":["High fever, worse at night","Anxiety","Restlessness","Dry mouth","Insomnia","Irritability","Mild thirst with no desire to drink","Mental disturbance","Dysphoria","Delirium","Loss of consciousness","Speech disturbance","Red, dry, painful rashes"],"tongue":"Deep red","tongueCoat":"Little or None","pulse":"Thready and rapid"},"conditions":[{"condition":"Fever","name":"High fever "},{"condition":"Delirium","name":"Delirium"},{"condition":"Epilepsy","name":"Childhood convulsion"},{"condition":"Eclampsia","name":"Eclampsia"},{"name":"Coma"},{"condition":"Aphasia","name":"Aphasia"},{"condition":"Epilepsy","name":"Epilepsy"}],"contra":{"contraindications":["Cinnabaris Zhu Sha is toxic and should be substituted for."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"eclampsia","modifications":[]}]}