{"formula":"NiuXiYin","names":{"pinyin":"niu xi yin","hanzi":"牛膝饮","english":"achyranthis drink","commonEnglish":"Achyranthis Drink","aka":[""]},"herbs":[{"herb":"NiuXi","dosage":"9-30g","actions":["Invigorates the Blood and expels Blood Stasis."]},{"herb":"RouGui","dosage":"9-30g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain.","With Dang Gui and Chuan Xiong, for dysmenorrhea, postpartum abdominal pain or amenorrhea due to Deficiency Cold of the Chong and Ren channels."]},{"herb":"ChiShao","dosage":"6-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood and relieves pain.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Tao Ren, for Blood Stasis induced menstrual disorders, especially those characterized by early period, excessive bleeding and thick purple clots.","With Mu Dan Pi, for Blood Stasis disorders."]},{"herb":"DangGui","dosage":"4-15g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"MuXiang","dosage":"6-15g","actions":["Promotes the movement of Qi and alleviates pain."]},{"herb":"MuDanPi","dosage":"6-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and cools and harmonizes the Blood.","With Chi Shao, for irregular menstruation due to Heat and obstruction from Blood Deficiency.","With Gui Zhi, for chest and abdominal pain due to Blood Stagnation."]},{"herb":"YanHuSuo","dosage":"6-15g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Gui Zhi and Dang Gui, for dysmenorrhea due to Cold in the Blood."]},{"herb":"ChuanXiong","dosage":"6-15g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"TaoRen","dosage":"6-15g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]}],"actions":["Invigorates the Blood","Disperses Stasis","Moves Qi in the abdomen","Regulates menstruation"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Scanty menstruation","Irregular menstruation","Palpable masses that may or may not be painful","Lower abdominal pain without palpable masses which is worse with pressure","Lower abdominal distention","Lower back pain","Lower abdominal distention during menstruation","Maybe distention along the flanks","Frequent menstruation (3-5 timer per month)","Spotting","Dark purple menstrual Blood (usually with clots)","Abnormal uterine bleeding with abdominal soreness and pain","Aversion to Cold","Depression","Cold extremities","White vaginal discharge"],"tongue":"Pale or With purple spots","tongueCoat":"White","pulse":"Choppy"},"conditions":[{"condition":"ScantyMenstruation","name":"Hypomenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}