{"formula":"NuShenSan","names":{"pinyin":"nu shen san","hanzi":"女神散","english":"women's spirit powder","commonEnglish":"Women's Spirit Powder","aka":["Dang Gui and Cyperus Formula","Tang-Kuei and Cyperus Formula"]},"herbs":[{"herb":"DangGui","dosage":"3g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses, moistens the Intestines and unblocks the bowels.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"BaiZhu","dosage":"3g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Huang Qin, for Qi Deficiency with Interior Heat."]},{"herb":"HuangLian","dosage":"1.5g","actions":["Clears Heat, drains Dampness and drains Stomach Fire.","With Huang Qin, for nausea in pregnancy with Heat disturbing the fetus."]},{"herb":"XiangFu","dosage":"3g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"DaHuang","dosage":"0.5-1g","actions":["Drains Heat, purges accumulations, invigorates the Blood and dispels Blood Stasis.","With Huang Lian, for a feeling of fullness and distention due to Heat Accumulation.","With Huang Lian and Huang Qi, for whole body Damp-Heat.","With Gui Zhi, for Abdominal fullness and pain.","With Dang Gui, for Blood Stasis.","With Ren Shen and Dang Gui, for Yang Ming Stage With Qi and Blood Deficiency.","With Gan Cao, for vomiting immediately after eating."]},{"herb":"ChuanXiong","dosage":"3g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"MuXiang","dosage":"1.5g","actions":["Promotes the movement of Qi, alleviates pain, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, dispels Damp-Heat and harmonizes the Liver and Spleen.","With Bai Zhu, for anorexia with epigastric and abdominal pain and distention.","With Bing Lang, for Qi Stagnation in the Stomach and Intestines due to Food Stagnation with abdominal distention and fullness, anorexia, aversion to the smell of food, nausea without the ability to vomit and an uncomfortable urge to defecate which is often unsuccessful.","With Bing Lang and Da Huang, for epigastric and abdominal fullness, distention and pain with constipation."]},{"herb":"RenShen","dosage":"2g","actions":["Tonifies Spleen, Heart and Stomach Qi and calms the Spirit.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"BingLang","dosage":"2g","actions":["Regulates Qi, reduces accumulations, drains downward, relieves nausea and unblocks the bowels."]},{"herb":"GuiZhi","dosage":"2g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]},{"herb":"HuangQin","dosage":"2g","actions":["Clears Heat, dries Dampness, calms ascending Liver Yang and calms the fetus.","With Bai Zhu and Dang Gui, for a restless fetus due to Heat.","With Da Huang, for constipation."]},{"herb":"GanCao","dosage":"1.5g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"XiaoHuiXiang","dosage":"1g","actions":["Regulates Qi and harmonizes the Stomach."]}],"actions":["Descends Qi","Reduces Stagnation","Reduces Food Stagnation"],"syndromes":["Qi and Blood Deficiency with Qi Stagnation and Heat"],"manifestations":{"symptoms":["Constipation","Facial flushing","Melancholy","Restlessness","Headache","Vertigo","Tinnitus","Abdominal distention","Acid regurgitation","Vertigo","Stiff shoulders","Neurosis","Fever","Palpitations","Lower back pain","Hot flashes","Belching"]},"conditions":[{"condition":"MenopauseSyndrome","name":"Menopause syndrome"},{"name":"Blood diseases"},{"condition":"Headache","name":"Headache"},{"condition":"LowBackPain","name":"Low back pain"},{"condition":"HotFlashes","name":"Hot flashes"},{"condition":"Vertigo","name":"Vertigo"},{"condition":"Neurosis","name":"Neurosis"},{"condition":"Constipation","name":"Constipation"},{"condition":"Tinnitus","name":"Tinnitus"},{"condition":"Palpitations","name":"Palpitations"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}