{"formula":"NuXiaoSan","names":{"pinyin":"nu xiao san","commonEnglish":"","aka":[""]},"herbs":[{"herb":"HuangLian","dosage":"1.5-10g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and clears Heart Fire.","With Huang Qin and Zhi Zi, for Fire toxin in the three burners.","With Huang Qin and Da Huang, for hematemesis and rectal bleeding due to Blood Heat."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat and dries Dampness, drains Fire, cools the Blood and detoxifies.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs.","With Huang Lian and Zhi Zi, for acute febrile disease."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire and eliminates irritability, drains Damp-Heat, cools and activates the Blood, relieves toxicity and reduces swelling.","With Da Huang and Huang Lian, for retained Heat in the Heart channel."]},{"herb":"GuJingCao","dosage":"4.5-15g","actions":["Disperses Wind-Heat in the Liver channel, brightens the eyes and eliminates superficial visual obstruction.","With Chan Tui, for superficial visual obstruction."]},{"herb":"SheXiang","dosage":"0.03-0.1g","actions":["Activates the Blood, dissipates masses, reduces swellings, detoxifies, opens the channels and alleviates pain."]},{"herb":"MuZei","dosage":"3-12g","actions":["Disperses Wind-Heat, clears the eyes and eliminates superficial visual obstruction."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis and reduces Fire toxicity.","With Huang Lian and Huang Qin, for hematemesis, or epistaxis due to Blood Heat."]},{"herb":"HaiPiaoXiao","dosage":"6-12g","actions":["Restrains, holds in and stops bleeding."]},{"herb":"ChanTui","dosage":"3-10g","actions":["Disperses Wind, clears Heat, clears the eyes and removes superficial visual obstruction."]},{"herb":"SheTui(Pi)","dosage":"1.5-6g","actions":["Dispels Wind, removes superficial visual obstruction and resolves toxins."]}],"actions":["Disperses Wind","Clears Heat","Resolves toxicity","Invigorates the Blood","Removes superficial visual obstruction"],"syndromes":["Heart Fire"],"manifestations":{"symptoms":["Pterygium",""]},"conditions":[{"condition":"Pterygium","name":"Pterygium"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}