{"formula":"PingYingFuFang","names":{"pinyin":"ping ying fu fang","hanzi":"平瘿复方","english":"formula to dissolve goiter","commonEnglish":"Formula to Dissolve Goiter","aka":["&#xA0;"]},"herbs":[{"herb":"MuLi","dosage":"20g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness and dissipates nodules."]},{"herb":"XiaKuCao","dosage":"15g","actions":["Clears Liver Fire, clears Hot Phlegm, dissipates nodules and treats hypertension.","With Zhe Bei Mu, cools and relieves toxicity to disperse and transform Phlegm and treat goiter, scrofula and swollen or inflamed lymph glands.","With Dang Gui, Bai Shao and Xuan Shen, for Liver Fire with Blood Deficiency."]},{"herb":"WaLengZi","dosage":"12g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules.","With Zhe Bei Mu and Xia Ku Cao, for scrofula due to Phlegm-Fire."]},{"herb":"XuanShen","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness and dissipates nodules.","With Mu Li and Zhe Bei Mu, for scrofula, goiter, and other nodules due to Phlegm."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin and calms Liver Yang and Liver Wind.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"MuDanPi","dosage":"12g","actions":["Clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for Kidney Yin Deficiency with steaming bones."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat.","With Xuan Shen, for Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue."]},{"herb":"DangGui","dosage":"12g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"ShanZhuYu","dosage":"9g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang."]},{"herb":"ZheBeiMu","dosage":"9g","actions":["Clears Heat, transforms Phlegm and dissipates nodules.","With Xuan Shen, Mu Li and Xia Ku Cao, for scrofula due to Phlegm-Fire with swelling and pain at multiple sites.","with Xuan Shen and Mu Li, for nodules without abscess."]},{"herb":"QingPi","dosage":"9g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness and transforms Phlegm.","With San Leng and E Zhu, for masses where prolonged Qi Stagnation has led to Blood Stagnation."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"SanLeng","dosage":"9g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain."]},{"herb":"EZhu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With Qing Pi, for Stagnant Qi with chest and abdominal fullness and pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation."]}],"actions":["Nourishes Kidney and Liver Yin","Nourishes Blood","Clears Heat","Cools Blood","Clears Deficiency Fire","Invigorates Blood and Qi","Dissipates accumulations","Pacifies the Heart","Strengthens the Spleen"],"syndromes":["Heart and Liver Yin Deficiency with Phlegm","Yin and Blood Deficiency with Qi and Blood Stagnation with nodulations"],"manifestations":{"symptoms":["Goiter with nodulations","The lump is small or large and relatively soft with a slow onset","Palpitations","Insomnia","Afternoon fever","Night sweats","Hand tremors","Constipation","Urine short and red","Heightened libido","Blurred vision","Pain that is fixed, stabbing and /or severe or","Dry eyes","Blurred vision","Tiredness"],"tongue":"Red","tongueCoat":"Little or none","pulse":"Floating and empty, relatively overflowing on left cun"},"conditions":[{"condition":"Hyperthyroidism","name":"Hyperthyroidism"},{"name":"Scrofula"},{"condition":"Goiter","name":"Goiter"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}