{"formula":"PingGanXieHuoTang","names":{"pinyin":"ping gan xie huo tang","hanzi":"平肝泻火汤","english":"decoction for relieving liver fire","commonEnglish":"Decoction for Relieving Liver Fire","aka":[""]},"herbs":[{"herb":"LongDanCao","dosage":"3g","actions":["Drains Damp-Heat from the Liver and Gallbladder channels, drains and pacifies Excess Liver Fire and inhibits the growth of cancer cells."]},{"herb":"PuGongYing","dosage":"9g","actions":["Reduces abscesses, dissipates nodules, clears the Liver, clears Heat, resolves Dampness, relieves Fire toxicity and inhibits the growth of cancer cells."]},{"herb":"ShanDouGen","dosage":"9g","actions":["Clears Heat, relieves Fire toxicity, disperses swellings, improves the throat and inhibits the growth of cancer cells."]},{"herb":"XuanShen","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, transforms Phlegm-Heat, drains Fire and relieves toxicity.","With sheng Di Huang, for Excess or Deficiency Heat patterns."]},{"herb":"HaiZao","dosage":"15g","actions":["Reduces Phlegm, softens areas of hardness and inhibits the growth of cancer cells."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan Shen, for Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat,especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps and inhibits the growth of cancer cells."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, calms ascending Liver Yang and inhibits the growth of cancer cells.","With Zhi Zi, for Damp-Heat and jaundice."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, cools the Blood, relieves toxicity and inhibits the growth of cancer cells."]},{"herb":"ZhiMu","dosage":"9g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids and clears Deficiency Fire.","With Huang Bai, clears Heat and Drains Fire for Yin Deficiency Fire."]},{"herb":"QingPi","dosage":"9g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm."]},{"herb":"JinYinHua","dosage":"20g","actions":["Clears Heat, resolves Fire toxicity, clears Damp-Heat from the Lower Jiao and inhibits the growth of cancer cells.","With Huang Qin, for suppurating boils that have not ulcerated or have ulcerated but are not discharging pus.","With Lian Qiao, for various Heat disorders.","With Lian Qiao and Huang Qin, for Unremitting high fever."]},{"herb":"HuangBai","dosage":"6g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Deficiency Heat, relieves Fire toxicity and inhibits the growth of cancer cells.","With Zhi Zi, resolves constraint and directs Qi downward for clearing Heat and Fire from the Liver channel.","With Zhi Mu, for Yin Deficiency fever with steaming bones and night sweats and Lower Jiao Damp-Heat."]},{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi, dispels Damp-Heat, harmonizes the Liver and Spleen and alleviates pain.","With Qing Pi, for abdominal pain, distention and belching."]},{"herb":"MangXiao","dosage":"6g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat, reduces swelling and drains Fire."]}],"actions":["Drains Damp-Heat from the Liver and Gallbladder channels","Drains and pacifies Excess Liver Fire","Softens hardness","Nourishes Yin","Moves Qi","Resolves Phlegm","Inhibits the growth of cancer cells"],"syndromes":["Liver Fire"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Severe, splitting headaches with dizziness","Sudden tinnitus or","Sudden deafness","Flushed face","Red, swollen, painful eyes","Irascibility with violent angry outbursts","Dry mouth","Bitter taste in mouth","Thirst","Vomiting sour or bitter liquid","Insomnia","Restlessness","Constipation or dry stools","Maybe rib pain"],"tongue":"Red tip and edges","tongueCoat":"Thick, yellow, dry and rough","pulse":"Wiry, Excess and rapid"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal Cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}