{"formula":"PiYinXuTang","names":{"pinyin":"pi yin xu tang","hanzi":"脾阴虚汤","english":"spleen yin deficiency decoction","commonEnglish":"Spleen Yin Deficiency Decoction","aka":[""]},"herbs":[{"herb":"HuangJing","dosage":"6-30g","actions":["Tonifies Spleen Qi, nurtures Stomach Yin, tonifies the Kidneys, strengthens Jing and relieves wasting and thirsting.","With Shan Yao and Tai Zi Shen, for Qi and Yin Deficiency."]},{"herb":"TaiZiShen","dosage":"9-30g","actions":["Strengthens the Spleen, tonifies Qi, generates Body Fluids and treats chronic febrile disorders.","With Shan Yao and Bai Bian Dou, for Spleen Deficiency with lethargy and reduced appetite."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, tonifies Kidney Yin and astringes Jing."]},{"herb":"BaiBianDou","dosage":"8-30g","actions":["Strengthens the Spleen.","With Tai Zi Shen and Shan Yao, for slight Deficiency of the Spleen and Stomach."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin and adjusts the Ying and Wei."]},{"herb":"ShanZha","dosage":"8-16g","actions":["Reduces and guides out Food Stagnation, transforms accumulations, transforms Blood Stasis, invigorates Blood circulation and dissipates clumps."]},{"herb":"WuMei","dosage":"3-30g","actions":["Astringes leakage of Lung Qi, stops leakage of sweat, generates fluids, alleviates thirst and stops bleeding."]},{"herb":"GeGen","dosage":"4-21g","actions":["Relieves Heat, generates fluids and raises Spleen Yang."]},{"herb":"LianZi","dosage":"6-18g","actions":["Tonifies the Spleen and Kidneys and astringes Jing."]},{"herb":"DaZao","dosage":"10-30g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]}],"actions":["Strengthens the Spleen","Nourishes Yin"],"syndromes":["Spleen Yin Deficiency"],"manifestations":{"symptoms":["Poor appetite","Distension after eating","Dry stools","Dry mouth and throat","Dry lips","Thin body","Dull complexion without luster","Night sweating","Five Sole Heat (only if there is Empty Heat)","Bleeding (in small quantity)"],"tongue":"Normal or Red if there is Empty Heat","tongueCoat":"Little or None","pulse":"Thready"},"conditions":[{"name":"Spleen Yin Deficiency "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}