{"formula":"PuJiXiaoDuYinJIaJIan","names":{"pinyin":"pu ji xiao du yin jia jian","hanzi":"普濟消毒飲加減","english":"modified universal benefit decoction to eliminate toxin","commonEnglish":"Modified Universal Benefit Decoction to Eliminate Toxin","aka":["Modified Scute and Cimicifuga Combination"]},"herbs":[{"herb":"HuangQin","dosage":"6-15g","actions":["Clear Lung Heat, drains Fire, dries Dampness, detoxifies and stops bleeding.","With Jiu Chao Huang Lian, clears and drains toxic Heat from the Upper Jiao."]},{"herb":"HuangLian","dosage":"3-15g","actions":["Drains Fire, relieves toxicity, drains Dampness, clears Heart and Stomach Fire and stops bleeding. It reaches the head and eyes and cools Upper Jiao Fire to treat pain of the eyes, ears, or tongue and mouth ulcers due to pathogenic Fire or Heat.","With Sheng Ma, clear s and drains Heart and Spleen Fire with swelling of the gums, toothache and ulcerations of the mouth and tongue.","With Lian Qiao and Ban Lan Gen, for acute infectious diseases."]},{"herb":"LianQiao","dosage":"3-12g","actions":["Clears Heat, relieves toxicity, dissipates nodules, expels external Wind-Heat.","With Ban Lan Gen for any externally contracted Heat disorder."]},{"herb":"JiangCan","dosage":"1-6g","actions":["Alleviates pain due to Wind-Heat, transforms Phlegm, dissipates nodules and stops itch."]},{"herb":"XuanShen","dosage":"6-10g","actions":["Clears Heat, cools the blood, nourishes Yin, drains Fire, relieves toxicity, softens hardness and dissipates nodules.","With Sheng Ma, Niu Bang Zi and Jie Geng for swollen, painful throat due to Wind-Heat.","With Ma Bo, clears the upper body, restores normal descent, nourishes Yin and stops pain and treats Wind-Heat obstruction leading to swelling and pain of the throat.","With Jie Geng, Ma Bo and Ban Lan Gen for throat pain, with strong fever and chills and redness, swelling and burning pain of the face.","With Jie Geng and Gan Cao, for sore throat with Dryness and pain."]},{"herb":"MaBo","dosage":"3-9g","actions":["Clears Lung Heat, relieves Fire toxicity, improves the throat and stops bleeding.","With Xuan Shen, for Wind-Heat obstruction leading to swelling and pain of the throat."]},{"herb":"BanLanGen","dosage":"3-12g","actions":["Drains Heat, relieves Fire toxicity, cools the Blood and benefits the throat.","With Ma Bo, Jie Geng and Xuan Shen, for throat pain as part of a massive febrile disorder of the head with a strong fever and chills, with redness, swelling and burning pain of the face."]},{"herb":"JieGeng","dosage":"3-9g","actions":["Opens the Lungs, spreads Lung Qi expels Phlegm, expels pus, benefits the throat and directs the effects of other herbs to the upper body.","With Gan Cao and Jiu Chao Huang Qin, for hoarseness, pain and swelling of the throat due to Wind-Heat."]},{"herb":"GanCao","dosage":"1-6g","actions":["Stops cough, clears Heat, relieves Fire toxicity, moderates spasms, alleviates pain and moderates and harmonizes the properties of other herbs.","With Jie Geng, for pain and swelling of the throat."]},{"herb":"ShengMa","dosage":"1.5-6g","actions":["Releases the exterior, vents measles, clears Heat, relieves toxicity, raises Yang, lifts Sunken Qi and guides other herbs upwards."]},{"herb":"DaHuang","dosage":"3-12g","actions":["Drains Heat and purges accumulations Drains Fire Clears Heat, transforms Dampness and promotes urination","With Huang Lian, for a feeling of fullness and distention due to Heat accumulation."]}],"actions":["Clears Heat","Eliminates Fire toxin","Clears Yang Ming Fu","Regulates the throat"],"syndromes":["Acute fever of the head due to Yang Ming Fu"],"manifestations":{"symptoms":["Persistent fever","Very sore throat","Thirst","Difficulty swallowing","Red, swollen tonsils with a whitish area of exudate","Exudate area may link to form a whitish film","Constipation","Halitosis","Reduced dark urination","Restlessness"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Slippery and rapid"},"conditions":[{"condition":"AcuteTonsillitis","name":"Acute tonsillitis "},{"condition":"Fever","name":"Persistent fever"}],"contra":{"contraindications":["Use caution in patients with Yin Deficiency."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"vomiting and diarrhea","modifications":[{"herb":"DaHuang","modification":"- Rx. et Rz. Rhei"},{"herb":"ZhuRu","modification":"+ Caul. Bambusae in Taeniam"}]},{"purpose":"severe constipation","modifications":[{"herb":"MangXiao","modification":"+ Natrii Sulfas"},{"herb":"GuaLou","modification":"+ Fr. Trichosanthis"}]},{"purpose":"parotitis, erysipelas and fever due to Fire injuring Qi and Blood","modifications":[{"herb":"DaHuang","modification":"- Rx. et Rz. Rhei"},{"herb":"NiuBangZi","modification":"+ 9g Fr. Arctii"},{"herb":"BoHe","modification":"+ 3g Hb. Menthae"},{"herb":"ChenPi","modification":"+ 6g Per. Citri Reticulatae"},{"herb":"ChaiHu","modification":"+ 3g Rx. Bupleuri"}]}]}