{"formula":"PuJuLingLianTang","names":{"pinyin":"pu ju ling lian tang","hanzi":"蒲菊苓莲汤","english":"dandelion, wild chrysanthemum, sarsaparilla and barbed skullcap decoction","commonEnglish":"Dandelion, Wild Chrysanthemum, Sarsaparilla and Barbed Skullcap Decoction","aka":[""]},"herbs":[{"herb":"PuGongYing","dosage":"30g","actions":["Reduces abscesses, dissipates nodules, clears Heat, resolves Dampness, relieves Fire toxicity and inhibits the growth of cancer cells.","With Jin Yin Hua and Ye Ju Hua, for sores, lesions and ulcerations of the skin."]},{"herb":"YeJuHua","dosage":"15g","actions":["Drains Fire and resolves toxicity and inhibits the growth of cancer cells."]},{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity, clears Damp-Heat from the Lower Jiao and inhibits the growth of cancer cells."]},{"herb":"TuFuLing","dosage":"30g","actions":["Relieves toxicity, eliminates Dampness, clears Damp-Heat from the skin and inhibits the growth of cancer cells.","With Yi Yi Ren, for joint pain due to Damp-Heat toxin.","With Jin Yin Hua and Ye Ju Hua, for abscesses and boils."]},{"herb":"BanZhiLian","dosage":"30g","actions":["Clears Heat, resolves Fire toxins, invigorates the Blood, reduces swellings, promotes urination, mildly dispels Blood Stasis, stops bleeding and treats various types of cancer."]},{"herb":"YiYiRen","dosage":"30g","actions":["Strengthens the Spleen, resolves Dampness, clears Damp-Heat, expels pus, relieves pain and inhibits the growth of cancer cells."]},{"herb":"YinChen(Hao)","dosage":"30g","actions":["Clears Heat, facilitates the resolution of Dampness and inhibits the growth of cancer cells."]}],"actions":["Clears Heat","Relieves Fire toxins","Reduces abscesses","Invigorates the Blood","Relieves Dampness","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat"],"manifestations":{"symptoms":["Tumor develops quickly","Dirty, foul vaginal discharge like rice water with an offensive odor","High fever","Thirst","Epistaxis","Spots on the skin","Constipation","Scanty, red urine","Hemorrhaging","Loss of consciousness","May be ascites (late stage)","Weakness","Bleeds easily","Low back and lower abdomen aching and pain"],"tongue":"Red","tongueCoat":"Yellow or Greasy and yellow","pulse":"Tight or Thready and rapid"},"conditions":[{"condition":"CervicalCancer","name":"Cervical cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}