{"formula":"QianYangXiFengTang","names":{"pinyin":"qian yang xi feng tang","hanzi":"潜阳熄風湯","english":"anchor yang and extinguis wind decoction","commonEnglish":"Anchor Yang and Extinguish Wind Decoction","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes the Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, activates and harmonizes the Blood, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"HeShouWu","dosage":"9g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and expels Wind from the skin by nourishing the Blood."]},{"herb":"ZiBeiChi","dosage":"30g","actions":["Calms the Liver, anchors Yang, clears the Liver and cools Heat."]},{"herb":"CiShi","dosage":"15g","actions":["Anchors Liver Yang, calms the Spirit, benefits Yin, nourishes the Kidneys and augments the Liver.","With Long Gu and Mu Li, for dizziness and vertigo associated with Yin Deficiency with Yang Rising."]},{"herb":"LongGu","dosage":"15g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang."]},{"herb":"MuLi","dosage":"15g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Bai Shao, for anxiety, palpitations, insomnia, and dream disturbed sleep and headache, dizziness and tinnitus and other symptoms associated with Yin Deficiency with Yang Rising."]},{"herb":"DaiZheShi","dosage":"15g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire, cools the Blood and stops bleeding."]},{"herb":"ZhenZhuMu","dosage":"30g","actions":["Calms the Liver, anchors the Yang, drains Liver Fire, promotes healing and reduces itching of the skin."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, softens the Liver, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood.","With Long Gu and Mu Li, for spontaneous sweating and night sweats due to Yin Deficiency.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]}],"actions":["Nourishes the Blood","Moistens Dryness","Extinguishes Wind","Stops itching"],"syndromes":["Blood Deficiency with Wind Dryness"],"manifestations":{"symptoms":["Thick (lichenified), dry lesions","Some scaling","Severe itching, worse at night"],"tongue":"Red","tongueCoat":"Thin","pulse":"Thready"},"conditions":[{"condition":"Neurodermatitis","name":"Neurodermatitis"},{"name":""}],"contra":{"contraindications":["Haematitum Dai Zhe Shi is toxic, use only for a short time. For long-term use, eliminate it."],"interactions":[""]},"notes":["With Haematitum Dai Zhe Shi: Take one dose every day for five consecutive days. Resume after three days rest with a reduced dosage of one dose every other day.","Without Haematitum Dai Zhe Shi: Take one dose every day."],"modifications":[]}