{"formula":"QianJinZhiDaiWan","names":{"pinyin":"qian jin zhi dai wan","hanzi":"千金止帶丸","english":"gold leukorrhea pill","commonEnglish":"Gold Leukorrhea Pill","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"5g","actions":["Tonifies the Middle Jiao and augments Qi.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"BaiZhu","dosage":"5g","actions":["Tonifies the Spleen,augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"BaiShao","dosage":"5g","actions":["Nourishes the Blood and regulates menstruation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems."]},{"herb":"XiangFu","dosage":"20g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain."]},{"herb":"MuXiang","dosage":"5g","actions":["Promotes the movement of Qi, dispels Damp-Heat, harmonizes the Liver and Spleen and alleviates pain."]},{"herb":"ShaRen","dosage":"5g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen and warms the Middle.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen.","With Bai Zhu and Dang Shen, for abdominal pain and diarrhea due to Dampness Obstructing the Spleen and Stomach."]},{"herb":"XiaoHuiXiang","dosage":"5g","actions":["Warms the Liver and Kidneys, expels Cold, regulates Qi, harmonizes the Stomach and alleviates pain.","With Bu Gu Zhi, for Kidney and Spleen Yang Deficiency."]},{"herb":"YanHuSuo","dosage":"5g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Xiang Fu, treats a wide range of applications from Liver Qi Stagnation to deep Blood Stasis and a wide variety of pain anywhere in the body.","With Xiang Fu and Dang Gui, for dysmenor-rhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Dang Gui, Bai Xiao, Chuan Xiong and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation."]},{"herb":"DuZhong","dosage":"5g","actions":["Tonifies Kidney Yang and aids the smooth flow of Qi and Blood.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels."]},{"herb":"XuDuan","dosage":"5g","actions":["Tonifies the Liver and Kidneys, stops uterine bleeding, promotes the movement of Blood and alleviates pain."]},{"herb":"BuGuZhi","dosage":"5g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, astringes urine and tonifies and warms Spleen Yang.","With Xiao Hui Xiang, for Kidney Yang Deficiency with clear, frequent, profuse urination or spermatorrhea or dysmenorrhea with lower back ache, late periods and coldness in the lower abdomen."]},{"herb":"JiGuanHua","dosage":"20g","actions":["Restrains and holds to stop bleeding and vaginal discharge, clears Heat, cools the Blood and consolidates Jing."]},{"herb":"QingDai","dosage":"5g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood and disperses Stagnation."]},{"herb":"ChunPi","dosage":"20g","actions":["Clears Heat, astringes the Intestines, dries Dampness, stops diarrhea and stops bleeding."]},{"herb":"MuLi","dosage":"5g","actions":["Prevents leakage of fluids."]}],"actions":["Restores Qi","Arrests excessive leukorrhea","Regulates menstruation"],"syndromes":["Deficiency of the Spleen and Kidney with Damp-Heat","Imbalance of the Chong and Ren channels with Damp-Heat"],"manifestations":{"symptoms":["Morbid leukorrhea","Menstrual disorders","Aching in the back","Abdominal pain"]},"conditions":[{"condition":"VaginalDischarge","name":"Vaginal discharge"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Qi, Blood and Yang Deficiency","modifications":[{"herb":"BaiShao","modification":"- Rx. Paeoniae Alba"},{"herb":"ShanYao","modification":"+ Rx. Dioscoreae"},{"herb":"MuLi","modification":"+ Concha Ostreae"}]},{"purpose":"Qi, Blood and Yang Deficiency in winter","modifications":[{"herb":"BaiShao","modification":"- Rx. Paeoniae Alba"},{"herb":"ShanYao","modification":"+ Rx. Dioscoreae"},{"herb":"MuLi","modification":"+ Concha Ostreae"},{"herb":"GanCao","modification":"+ Rx. Glycyrrhizae Preparata"},{"herb":"GanJiang","modification":"+ Rz. Zingiberis"},{"herb":"HuangBai","modification":"+ Cx. Phellodendri"}]},{"purpose":"Qi, Blood and Yang Deficiency with abdominal pain","modifications":[{"herb":"BaiShao","modification":"- Rx. Paeoniae Alba"},{"herb":"ShanYao","modification":"+ Rx. Dioscoreae"},{"herb":"MuLi","modification":"+ Concha Ostreae"},{"herb":"ShaRen","modification":"+ Fr. Amomi"}]}]}