{"formula":"QianJinFang","names":{"pinyin":"qiang jin fang","hanzi":"千金方","english":"thousand ducat formula","commonEnglish":"Thousand Ducat Formula","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, relieves numbness and pain and inhibits the growth of cancer cells."]},{"herb":"HaiPiaoXiao","dosage":"10g","actions":["Restrains, holds in and stops bleeding, secures Jing and stops discharge.","With Huang Qi and Qian Cao Gen, for excessive uterine bleeding."]},{"herb":"EJiao","dosage":"10g","actions":["Nourishes the Blood and stops bleeding.","With Zhi Gui Ban and Mu Li, for muscular spasms and contractures due to Yin Deficiency."]},{"herb":"QianCaoGen","dosage":"15g","actions":["Cools the Blood and stops bleeding, invigorates the Blood, dispels Blood Stasis and inhibits the growth of cancer cells.","With Hai Piao Xiao, for excessive uterine bleeding.","With Zhi Huang Qi, for Qi Deficient uterine bleeding."]},{"herb":"ZiHeChe","dosage":"15g","actions":["Tonifies the Liver and Kidneys, strengthens Jing, tonifies Qi, nourishes the Blood and inhibits the growth of cancer cells."]},{"herb":"YuBiao(Jiao)","dosage":"15g","actions":["Nourishes Yin, subdues Yang, nourishes the Liver and Kidneys, stops bleeding, dissipates Blood Stasis and resolves swelling."]},{"herb":"GuiBan","dosage":"15g","actions":["Benefits the Kidneys, nourishes the Blood, enriches Yin, stabilizes the Chong and Ren channels, cools the Blood and stops uterine bleeding.","With Lu Jiao Jiao, for weakness and debility due to Kidney Deficiency.","With Mu Li, for irregular uterine bleeding."]},{"herb":"LuRong","dosage":"15g","actions":["Tonifies the Kidneys, strengthens Yang, nourishes and tonifies Qi and Blood and stops bleeding."]},{"herb":"XueYuTan","dosage":"10g","actions":["Astringes leakage of Blood, eliminates Blood Stasis and stops bleeding."]},{"herb":"MuLi","dosage":"30g","actions":["Prevents the leakage of fluids, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"SangPiaoXiao","dosage":"30g","actions":["Tonifies the Kidneys, assists Yang, retains Jing and astringes urine."]}],"actions":["Benefits the Kidneys","Nourishes Jing","Tonifies Kidney Yang","Stops bleeding","Invigorates the Blood","Breaks up Stasis","Softens hardness","Inhibits the growth of cancer cells"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Cold limbs","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Lassitude","Withdrawn, subdued behavior","Knees feel cold and aching","Dizziness","Tinnitus","Impotence","Spermatorrhea","Premature ejaculation","Low libido","Female infertility (\"uterus cold and infertile\")","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white","pulse":"Deep and thready - maybe slow"},"conditions":[{"condition":"CervicalCancer","name":"Cervical cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a powder and make into boluses with honey. Take 9g twice a day with hot water. One course of treatment is seven days."],"modifications":[]}