{"formula":"QiangHuoTang","names":{"pinyin":"qiang huo tang","hanzi":"羌活汤","english":"notopterygium decoction","commonEnglish":"Notopterygium Decoction","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Qin Jiao, for Wind-Damp Bi with spasms of the tendons or numbness of the limbs and pain due to Wind-Dampness in patients with Blood Deficiency."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals."]},{"herb":"WuJiaPi","dosage":"4.5-15g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys and strengthens sinews and bones."]},{"herb":"MuGua","dosage":"2-12g","actions":["Relaxes the sinews, invigorates the Blood, unblocks the channels and transforms Dampness."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain."]},{"herb":"HaiFengTeng","dosage":"6-20g","actions":["Dispels Wind-Dampness, unblocks the channels, disperses Cold and stops pain."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints."]},{"herb":"XiXin","dosage":"0.5-5g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Qiang Huo and Fang Feng, for Wind-Cold."]}],"actions":["Expels Wind-Dampness","Strengthens the sinews and bones","Opens the channels","Unblocks painful obstruction","Tonifies the Liver and Kidneys","Invigorates the Blood","Expels Blood Stasis","Alleviates pain"],"syndromes":["Wind-Cold-Damp"],"manifestations":{"symptoms":["Low back pain","The pain is accompanied by Cold and heavy sensations in the low back as if sitting in water and carrying some weight","The sensations are aggravated by col-Damp weather and alleviated by warmth","There may be body heaviness and numbness","The joints may feel sore and inhibited when bending or stretching","No thirst","Loose stools"],"tongue":"Pale","tongueCoat":"Slimy and white","pulse":"Soft and moderate"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}