{"formula":"QiangHuoBaiDuSan","names":{"pinyin":"qiang huo bai du san","hanzi":"羌活敗毒散","english":"notopterygium powder to overcome toxins","commonEnglish":"Notopterygium Powder to Overcome Toxins","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Fang Feng, for pain due to External Wind-Dampness. .","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Du Huo, for Wind-Dampness.","With Fang Feng, Bai Zhi and Cang Zhu, for Wind-Cold.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Expels Wind, alleviates pain, invigorates the Blood and promotes the movement of Qi."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"DuHuo","dosage":"3-10g","actions":["Disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain, especially in the low back and legs.","With Fang Feng, for numbness in the legs.","With Qiang Huo, for joint pain and numbness."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi and relieves Stagnation."]},{"herb":"BaiZhi","dosage":"3-10g","actions":["Expels Wind, eliminates Dampness, dispels Cold and alleviates pain.","With Chuan Xiong, for a headache.","With Qiang Huo, for Wind-Cold-Dampness causing fever, chills and headaches.","With Fang Feng and Qiang Huo, for Wind-Cold with a headache and a stuffy nose."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Jing Jie, for exterior patterns in any season.","With Cang Zhu, for pain due to Wind-Damp Bi with aching joints, heavy limbs and generalized aching and discomfort.","With Jing Jie and Qiang Huo, for Wind-Cold."]},{"herb":"QianHu","dosage":"3-10g","actions":["Expels Wind-Heat, expels Phlegm and descends Qi."]},{"herb":"JingJie","dosage":"3-10g","actions":["Releases the Exterior, expels Wind and relieves muscle spasms."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dispels Wind","Warms Cold","Eliminates Dampness"],"syndromes":["Cold Dampness in the Lower Jiao","Tai Yang Cold-Damp"],"manifestations":{"symptoms":["Chronic cold pain in the lower back and body with a heavy sensation","A preference for warmth","Pain worse in Damp weather","Pain radiating downward and to the lower limbs","Limited movement of the lower spine","Severe hardness and stiffness in the lumbar area with obvious tenderness","A cord-like, swollen sensation of the supraspinous ligament on palpation","A movable cord-like sensation at the origin of the sacro-spinal muscle","Pain and other symptoms worsen gradually","A long-lasting course of illness","A heavy sensation in the head","The lower back region feels Cold to the touch","The pain is a deep, unremitting ache","The pain may be occasionally be severe","Twisting and bending are difficult","The pain is aggravated by cold weather","Lying down provides no improvement","Stiffness which is worse on rainy days","Aversion to Cold","Cold extremities","Sciatica","Copious urination","Extreme heavy sensation in the lower back","Absence of thirst","Maybe headaches","Nausea","Loose stools","A poor appetite","Maybe general body aches","Spontaneous contracture of the limbs","Maybe a feverish sensation in the upper body","Craves hot drinks and compresses","Dizziness","Vomiting","Profuse, purulent leukorrhea with a foul odor"],"tongue":"Pale","tongueCoat":"White or Greasy and white at the root","pulse":"Deep, thready and moderate or Deep and slow or Moderate or Slippery and slow"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}