{"formula":"QiFuYin","names":{"pinyin":"qi fu yin","commonEnglish":"","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"YuanZhi","dosage":"15g","actions":["Calms the Spirit, sedates the Heart and clears the channel joining the Heart and Kidney.","With Suan Zao Ren, Bai Zhu and Dang Gui, for palpitations and insomnia due to Qi Deficiency."]},{"herb":"ShuDiHuang","dosage":"25g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"SuanZaoRen","dosage":"15g","actions":["Nourishes Heart Yin, tonifies Liver Blood and calms the Spirit.","With Yuan Zhi, balances the contracting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"RenShen","dosage":"15g","actions":["Tonifies Heart Qi and calms the Spirit.","With Shu Di Huang, for Qi and Yin Deficiency.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"GanCao","dosage":"5g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"DangGui","dosage":"20g","actions":["Tonifies, invigorates and harmonizes the Blood."]}],"actions":["Reinforces and Benefits the Heart and Spleen","Supports Yang"],"syndromes":["Heart Blood and Spleen Qi Deficiency"],"manifestations":{"symptoms":["Inability to get or maintain an erection","Performance anxiety","The impotence may be worse with fatigue","The patient may be able to get erections during sleep or masturbation","A pale, lusterless complexion","Fatigue","A low sperm count","Palpitations","May be anxiety","Panic attacks","Nervousness","Insomnia","Much dreaming","Easily startled","Poor memory","Four limbs tired and lethargic","Clammy palms","Loss of appetite","Distention and fullness of the epigastrium and abdomen","Weak limbs","Loose stools","Sallow complexion"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Thready and weak or Weak and slow or Deep and weak"},"conditions":[{"condition":"Impotence","name":"Impotence"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}