{"formula":"QiHaiYaoFang","names":{"pinyin":"qi hai yao fang","hanzi":"气海要方","english":"sea of qi formula","commonEnglish":"Sea of Qi Formula (Golden Flower)","aka":[""]},"herbs":[{"herb":"TuSiZi","dosage":"12g","actions":["Strengthens Yang, Benefits the Kidneys and Spleen and astringes diarrhea, Jing and urine.","With Shan Yao, Fu Ling and Ren Shen, for anorexia, loose watery stools or diarrhea from Deficient Spleen and Kidneys."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat.","With Gan Jiang and Ren Shen, for Spleen and Stomach Deficiency Cold.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"ShanYao","dosage":"9g","actions":["Tonifies the Spleen, tonifies Kidney Yin and astringes Jing.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools.","With Ren Shen and Bai Zhu, for decreased appetite and lack of energy due to Spleen Deficiency."]},{"herb":"ShanZhuYu","dosage":"9g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids and strengthens Kidney Yang."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination and leaches out Dampness.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"GanJiang","dosage":"7.5g","actions":["Warms the Middle and expels Cold.","With Gan cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Fu Ling, Gan Cao and Bai Zhu, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]},{"herb":"BuGuZhi","dosage":"7.5g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, astringes urine, tonifies and warms Spleen Yang and stops diarrhea."]},{"herb":"ChenPi","dosage":"7g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"RenShen","dosage":"5.5g","actions":["Tonifies Spleen and Stomach Qi.","With Ren Shen, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"GanCao","dosage":"5.5g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"MuXiang","dosage":"5g","actions":["Promotes the movement of Qi, alleviates pain, strengthens the Spleen and prevents Stagnation.","With Bai Zhu, for anorexia with epigastric and abdominal pain and distention."]},{"herb":"RouGui","dosage":"4.5g","actions":["Warms the Kidneys, Spleen and Heart and strengthens the Yang and Ming Men Fire.","With Gan Jiang, Bai Zhu and Chen Pi, for chronic diarrhea."]}],"actions":["Warms the Middle Jiao","Tonifies the Middle Jiao","Warms the Kidneys","Tonifies Qi and Yang","Strengthens Spleen and Kidney Yang"],"syndromes":["Kidney and Spleen Yang Deficiency"],"manifestations":{"symptoms":["Asthenia","Cold intolerance","Cough with white phlegm","Diarrhea","Dizziness","Excessive urination","Fatigue","Impotence","Lethargy","Pallor","Poor appetite","Prolonged menstruation","Urinary incontinence","Weakness of the limbs"],"tongue":"Pale (may be swollen)","tongueCoat":"White","pulse":"Weak and slow"},"conditions":[{"condition":"IrritableBowelSyndrome","name":"Irritable bowel syndrome "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}