{"formula":"QingReXiaoFengTangJiaJian","names":{"pinyin":"qing re xiao feng tang jia jian","hanzi":"清热消風汤加減","english":"modified decoction for eliminating heat and wind","commonEnglish":"Modified Decoction for Eliminating Heat and Wind","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Expels Wind, invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ShengDiHuang","dosage":"21g","actions":["Clears Heat, cools the Blood and nourishes Yin."]},{"herb":"JingJie","dosage":"6g","actions":["Releases the Exterior, expels Wind, vents rashes and relieves itching.","With Dang Gui and Chuan Xiong, for itching and tremors of the hands and feet from Wind due to Blood Deficiency."]},{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior and expels External Wind.","With Jing Jie, expels Wind and stops itching for pruritic rashes."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhu Ru and Huang Lian, for vomiting due to Phlegm-Heat."]},{"herb":"RuXiang","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling and generates flesh."]},{"herb":"NiuBangZi","dosage":"9g","actions":["Disperses Wind-Heat, relieves toxicity and vents rashes.","With Lian Qiao, unblocks and drains Heat toxin, disperses clumps and swellings for sore, swollen throat, swellings like mumps, boils and other Heat toxin lesions and ulcerations and abscesses of the tongue and mouth."]},{"herb":"JinYinHua","dosage":"31g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat.","With Lian Qiao, for various Heat disorders.","with Lian Qiao and Niu Bang Zi, for Wei Stage and Qi Stage Heat.","With Gan Cao, for toxic swellings and sores.","With Mu Dan Pi and Sheng Di Huang, for Ying Stage and Xue Stage Heat."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat, clears Blood Heat and relieves toxicity.","With Jin Yin Hua, for initial-stage Wind-Heat."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for Ying and Xue Stage Heat with a high fever, scarlet tongue, thirst, a rash all over the body, epistaxis and hemoptysis."]},{"herb":"ShiGao","dosage":"15g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and heals eczema, burns and ulcerated sores and wounds.","With Sheng Di Huang, for excessive Fire with injured fluids."]},{"herb":"HeShouWu","dosage":"12g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and Jing and expels Wind from the skin by nourishing the Blood."]},{"herb":"GanCao","dosage":"6g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Expels Wind","Clears Heat","Nourishes Yin and Blood"],"syndromes":["Wind-Heat with Blood Dryness"],"manifestations":{"symptoms":["The lesions have a slightly erythematous base","The scales are dry and powdery","The scales may be very thick on the scalp"]},"conditions":[{"condition":"SeborrheicDermatitis","name":"Seborrheic dermatitis"},{"condition":"SeborrheicDermatitis","name":"Seborrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}