{"formula":"QingChuangYinJiaJIan","names":{"pinyin":"qing chuang yin jia jian","hanzi":"清疮饮加減","english":"modified clear the sores drink","commonEnglish":"Modified Clear the Sores Drink","aka":[""]},"herbs":[{"herb":"PuGongYing","dosage":"9-30g","actions":["Reduces abscesses, dissipates nodules, relieves Fire toxicity and promotes lactation."]},{"herb":"JinYinHua","dosage":"9-15g","actions":["Clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","With Gan Cao, for toxic swellings and sores."]},{"herb":"LianQiao","dosage":"9-15g","actions":["Clears Heat, especially in the Upper Jiao,relieves toxicity, reduces abscesses and dissipates clumps."]},{"herb":"GanCao","dosage":"3-9g","actions":["Resolves Phlegm, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Pu Gong Ying, for internally or externally for abscesses or other toxic swellings.","With Jin Yin Hua and Pu Gong Yin, for Yang sores marked by redness, swelling and pain."]},{"herb":"TianHuaFen","dosage":"9g","actions":["Relieves toxicity, expels pus and reduces swelling.","With Jin Yin Hua, Zhe bei Mu and Zao Jiao Ci, reduces swelling and pus.","With Chuan Shan Jia, Zao Jiao Ci and JIn Yin Hua, for Yang type breast or Intestinal abscesses."]},{"herb":"ZheBeiMu","dosage":"9g","actions":["Clears Heat and dissipates nodules.","With Lian Qiao, clears Heat toxin, transforms turbid Phlegm, opens Stagnation and disperses clumped swellings.","With Tian Hua Fen, Pu Gong Yin and Lian Qiao, for carbuncles, abscesses and breast lumps."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue.","With Zhe Bei Mu, Chuan Shan Jia, Jin Yin Hua, Chi Shao and Tian Hua Feng, for redness, swelling and burning toxic sores."]},{"herb":"ZaoJiaoCi","dosage":"6-9g","actions":["Draws out toxicity, discharges pus, invigorates the Blood and reduces swelling.","With Jin Yin Hua, for the initial stages of abscesses and boils."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood, and reduces swelling from sores and abscesses.","With Ru Xiang, Mo Yao, Jin Yin Hua and Lian Qiao, for pain and swelling associated with boils and abscesses.","With Jin Yin Hua, Zao Jiao Ci and Ru Xiang, for sores and abscesses."]},{"herb":"RuXiang","dosage":"3-6g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling and generates flesh."]},{"herb":"MoYao","dosage":"6-9g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, reduces swelling, generates flesh and promotes healing.","With Ru Xiang, for swollen, painful sores and sores that are hard but not painful."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle and relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"ChuanShanJia","dosage":"9-15g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks menstruation, promotes lactation, reduces swelling and promotes the discharge of pus.","With Zao Jiao Ci, for suppurative, inflamed skin lesions that have pustulated but remain closed."]}],"actions":["Clears Heat","Eliminates toxins","Reduces swelling","Softens hardness","Activates Blood circulation","Stops pain"],"syndromes":["Late-stage breast abscess due to Toxic Heat"],"manifestations":{"symptoms":["Breast abscess","Hard, red lump, with Heat on skin","The lump may also have a soft center (pus)","When pressed, there is a wavelike sensation","May feel pulse on the lump","High-fever"],"tongue":"Red","tongueCoat":"Slimy and yellow","pulse":"Wiry, slippery and rapid"},"conditions":[{"condition":"Mastitis","name":"Mastitis"},{"condition":"Mastitis","name":"Breast abscess "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}