{"formula":"QingGanHuaTanWan","names":{"pinyin":"qing gan hua tan wan","hanzi":"清氣化痰丸","english":"clear the liver and transform phlegm pill","commonEnglish":"Clear the Liver and Transform Phlegm Pill","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling."]},{"herb":"HaiZao","dosage":"6-16g","actions":["Reduces Phlegm and softens areas of hardness.","With Ku Bu, for goiter and scrofula."]},{"herb":"ZheBeiMu","dosage":"6-12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules.","With Lian Qiao, clears Heat toxin, transforms turbid Phlegm, opens Stagnation and disperses clumped swellings to treat scrofula and goiter from Phlegm-Fire."]},{"herb":"KunBu","dosage":"6-15g","actions":["Resolves Phlegm and softens Phlegm nodules."]},{"herb":"ChaiHu","dosage":"6-12g","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion."]},{"herb":"XiaKuCao","dosage":"6-18g","actions":["Clears Liver Fire, clears Hot Phlegm and dissipates nodules.","With Chai Hu, for neck nodules due to Liver Qi Stagnation.","with Zhe Bei Mu, cools and relieves toxicity to disperse and transform Phlegm and treat goiter, scrofula and swollen or inflamed lymph glands."]},{"herb":"JiangCan","dosage":"6-10g","actions":["Transforms Phlegm, softens hardness, eliminates toxins and dissipates nodules."]},{"herb":"DangGui","dosage":"6-15g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses and dissipates clumps."]},{"herb":"ZhiZi","dosage":"6-12g","actions":["Clears Heat, reduces Fire, reduces swelling and invigorates the Blood.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood."]}],"actions":["Clears Heat","Transforms Phlegm","Dissipate nodules"],"syndromes":["Phlegm-Heat"],"manifestations":{"symptoms":["Swollen, painful glands that have not suppurated","Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"CervicalLymphadenopathy","name":"Cervical lymphadenopathy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}