{"formula":"QingReJieDuHuaYuTang","names":{"pinyin":"qing re jie du hua yu tang","hanzi":"淸熱解毒化郁湯","english":"heat clearing, toxin eliminating, blood stasis transforming decoction","commonEnglish":"Heat Clearing, Toxin Eliminating Blood Stasis Transforming Decoction","aka":[""]},"herbs":[{"herb":"YuXingCao","dosage":"18-30g","actions":["Drains Damp-Heat, promotes urination, clears Heat, relieves toxicity, reduces swellings and abscesses and expels pus."]},{"herb":"TuFuLing","dosage":"18-30g","actions":["Relieves toxicity, eliminates Dampness, promotes normal urination and dispels Heat from the Lower Jiao.","With Chuan Xiong, raises the clear Yang while directing turbid Qi downward, moves Qi, invigorates the Blood, clears Heat and removes Dampness."]},{"herb":"RenDongTeng","dosage":"15-18g","actions":["Clears Heat, resolves toxicity, cools the Blood, relieves abdominal pain due to inflammation and clears Damp-Heat from the Lower Jiao."]},{"herb":"YiYiRen","dosage":"18-30g","actions":["Strengthens the Spleen, clears Damp-Heat, clears Heat and expels pus."]},{"herb":"DangGui","dosage":"9-12g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"ChiShao","dosage":"9-12g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Tao Ren, for Blood Stasis induced menstrual disorders.","With Xiang Fu, for flank pain, abdominal pain, and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"XiangFu","dosage":"9-12g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis."]},{"herb":"LianQiao","dosage":"9-12g","actions":["Clears Heat, relieves toxicity, reduces abscesses, dissipates clumps, clears Blood Heat and promotes urination."]},{"herb":"TaoRen","dosage":"9-12g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines, unblocks the bowels and drains abscesses."]},{"herb":"EZhu","dosage":"9-12g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain."]},{"herb":"ZhiKe(Qiao)","dosage":"6-9g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"ChuanXiong","dosage":"6-9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GanCao","dosage":"3-6g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Clears Damp-Heat from the Uterus","Activates the Blood"],"syndromes":["Lingering Damp-Heat and Blood Stagnation in the Uterus"],"manifestations":{"symptoms":["Chronic or recurrent lower abdominal pain and distention","Low grade fever or","Afternoon fever","Lumbar soreness and pain worse with menstruation and fatigue","Sacral soreness and pain worse with menstruation and fatigue","Prolonged menstrual cycle","Heavy periods","Yellowish, malodorous vaginal discharge","Dry mouth with no desire to drink","Constipation or","Diarrhea","Scanty, dark urine"],"tongue":"Red","tongueCoat":"Greasy, yellow","pulse":"Wiry and rapid or Soft and rapid"},"conditions":[{"condition":"AbdominalPain","name":"Abdominal pain"},{"condition":"LowerAbdominalPain","name":"Lower abdominal pain "},{"condition":"PuerperalFever","name":"Puerperal fever"},{"name":"Uterine pain"},{"condition":"VaginalDischarge","name":"Vaginal discharge"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe pain","modifications":[{"herb":"YanHuSuo","modification":"+ 12g Rz. Corydalis"},{"herb":"RuXiang","modification":"+ 6g Olibanum"},{"herb":"MoYao","modification":"+ 6g Myrrh"}]},{"purpose":"postpartum alternating chills and fever","modifications":[{"herb":"HuangQin","modification":"+ Rx. Scutellariae"},{"herb":"ChaiHu","modification":"+ Rx. Bupleuri"}]}]}