{"formula":"QingXueSouDuWan","names":{"pinyin":"qing xue sou du wan","hanzi":"清血搜毒丸","english":"clear the blood and collect the toxin pill","commonEnglish":"Clear the Blood and Collect the Toxin Pill","aka":[""]},"herbs":[{"herb":"XueJie","dosage":"60g","actions":["Invigorates the Blood, dispels Blood Stasis, stops bleeding, protects the surface of ulcers, prevents decay, generates flesh and alleviates pain."]},{"herb":"MuXiang","dosage":"30g","actions":["Promotes the movement of Qi, dispels Damp-Heat, harmonizes the Liver and Spleen and alleviates pain."]},{"herb":"QingMuXiang","dosage":"30g","actions":["Promotes the flow of Qi, alleviates pain, resolves edema, clears Heat and removes toxicity."]},{"herb":"DingXiang","dosage":"30g","actions":["Warms the Middle Jiao, relieves pain, descends Qi, warms the Kidneys and assists Yang."]},{"herb":"ErCha","dosage":"30g","actions":["Drains Dampness, absorbs suppuration, stops bleeding, generates flesh, clears Heat, clears the Lungs and transforms Phlegm."]},{"herb":"BaDou","dosage":"18g","actions":["Warmly unblocks and vigorously purges accumulated Cold, drives out water, reduces edema and promotes the healing of abscesses and ulcers."]}],"actions":["Invigorates the Blood","Dispels Blood Stasis","Promotes the movement of Qi","Dispels Damp-Heat","Warms the Middle Jiao","Warms the Kidneys and assists Yang","Warmly unblocks and purges accumulated Cold","Promotes the healing of abscesses and ulcers"],"syndromes":["Blood Stagnation with Internal Cold"],"manifestations":{"symptoms":["Latent Stage: Begins about 1 year after infection. Relapses may occur. After the second year new lesions are rare. This stage may last several years or for the remainder of the patient's life. In untreated cases, about one-third of those infected develop Late-Stage or Tertiary syphilis which may show up after many years.","Tertiary or Late-Stage: Lesions develop between 3 and 10 years after infection. The typical lesion is a rubbery, chronic, localized inflammation characterized by centralized gray-white necrosis, surrounded by granulized tissue. They increase slowly in size, heal gradually and leave scars. They may affect an organ or tissue. Often they occur in Submucosal tissue such as the: Palate Nasal septum Pharynx Larynx They lead to tissue degeneration with perforation of the palate, or septum. They occur in areas with good blood supply such as the: Leg below the knee Upper trunk Face Scalp Eyes Stomach Lungs Liver Testicles"]},"conditions":[{"condition":"Syphilis","name":"Tertiary syphilis "},{"condition":"Syphilis","name":"Latent syphilis "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a fine powder. Mix with water to form a paste. Make into small pills the size of mung beans. Administer 5-10 pills twice daily with water."],"modifications":[]}