{"formula":"QingGanLiShiTang","names":{"pinyin":"qing gan li shi tang","hanzi":"清肝李時汤","english":"li shi's clear the liver decoction","commonEnglish":"Li Shi's Clear the Liver Decoction","aka":[""]},"herbs":[{"herb":"HuangBai","dosage":"12g","actions":["Drains Damp-Heat especially from the Lower Jiao.","With Che Qian Zi, for burning, painful, hesitant urination.","With Zhi Zi, eliminates pathogenic Dampness from the Liver/Gallbladder.","With Bian Xu and Qu Mai, for Lin syndrome.","With Bian Xu, Hua Shi and Mu Tong, for dysuria."]},{"herb":"HuangQin","dosage":"12g","actions":["Clears Heat, dries Dampness and calms ascending Liver Yang.","With Chai Hu, for Heat in the Shao Yang with alternating chills and fever and nausea.","With Zhi Zi, for Damp-Heat and jaundice.","With Mu Tong and Che Qian Zi, for burning dysuria."]},{"herb":"QuMai","dosage":"12g","actions":["Drains Damp-Heat from the Urinary Bladder,","promotes urination and unblocks painful urinary dysfunction.","With Bian Xu, for Lin Syndrome.","With Zhi Zi, for Lower Jiao Damp-Heat with burning, painful, dribbling urination."]},{"herb":"BianXu","dosage":"12g","actions":["Drains Damp-Heat from the Urinary Bladder, promotes urination and unblocks painful urinary dysfunction.","With Qu Mai and Che Qian Zi, for Damp-Heat in the Lower Jiao or Stone Lin with urinary discomfort.","With Mu Tong, Che Qian Zi, Zhi Zi and Hua Shi, for Damp-Heat dysuria.","With Yin Chen Hao and Zhi Zi, for Damp-Heat jaundice.",""]},{"herb":"HuaShi","dosage":"12g","actions":["Promotes urination, drains Heat from the Urinary Bladder and expels Damp-Heat.","With Zhi Zi and Mu Tong, for Lin Syndrome with hot, painful urinary dribbling and scanty, dark, painful urination.","With Mu Tong, for Heat Lin."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability and drains Damp-Heat.","With Hua Shi, Bian Xu and Che Qian Zi, for urinary tract infection."]},{"herb":"CheQianZi","dosage":"9g","actions":["Promotes urination, clears Damp-Heat, clears Liver Heat and clears the eyes.","With Mu Tong and Hua Shi, for Lin Syndrome.","With Mu Tong, Hua Shi and Zhi Zi, for Damp-Heat dysuria."]},{"herb":"MuTong","dosage":"6g","actions":["Promotes urination and unblocks painful urinary dysfunction.","With Zhi Zi, for painful urinary dysfunction due to Damp-Heat in the Urinary Bladder."]},{"herb":"ChaiHu","dosage":"6g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi and relieves Stagnation.","With Huang Qi, restores the normal functioning of the Liver and Gallbladder."]},{"herb":"YinChen(Hao)","dosage":"10g","actions":["Clears Damp-Heat from the Liver and Gallbladder and relieves jaundice.","With Zhi Zi, strongly relieves Damp-Heat jaundice."]},{"herb":"SheChuangZi","dosage":"10g","actions":["Dries Dampness, warms and tonifies the Kidneys and strengthens Yang."]},{"herb":"WangBuLiuXing","dosage":"10g","actions":["Promotes the movement of Blood and invigorates the channels."]},{"herb":"ShenJinCao","dosage":"15g","actions":["Dispels Wind, eliminates Dampness, relaxes the sinews, invigorates the collaterals and invigorates the Blood."]}],"actions":["Spreads Liver Qi","Clears Dampness","Purges Heat from Liver and Gallbladder","Invigorates the Blood"],"syndromes":["Damp-Heat in the Liver Channel"],"manifestations":{"symptoms":["Impotence","Vexation","Irascibility","Easily angered","Pain and fullness in the chest, ribs and flanks","Maybe pain in the right hypochondrium","Bitter taste in mouth","Nausea","Vomiting sour and bitter fluids","Anorexia","Maybe alternating chills and fever","Concentrated, dark urine","Loose stools","Abdominal distention and fullness","Lack of strength","Excessive dreams","Dizziness","Tinnitus","Numb extremities","Edema"],"tongue":"Slightly swollen with teethmarks","tongueCoat":"Yellow and greasy or sticky","pulse":"Wiry and rapid or Slippery and rapid"},"conditions":[{"condition":"Impotence","name":"Impotence"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}