{"formula":"QingHaiFengTengTang","names":{"pinyin":"qing hai feng teng tang","hanzi":"青海风藤汤","english":"sinomenium and piperis kadsura decoction","commonEnglish":"Sinomenium and Piperis Kadsura Decoction","aka":[""]},"herbs":[{"herb":"JiXueTeng","dosage":"15g","actions":["Invigorates and tonifies the Blood, activates the channels and relaxes the sinews."]},{"herb":"NiuXi","dosage":"9g","actions":["Invigorates the Blood, expels Blood Stasis, strengthens the sinews and bones and benefits the joints.","With Du Zhong, for low back and extremity pain and weakness due to Bi pain or Kidney Deficiency."]},{"herb":"DuZhong","dosage":"9g","actions":["Tonifies Kidney Yang, strengthens the sinews and bones and aids the smooth flow of Qi and Blood.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees."]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain.","With Du Zhong and Niu Xi, for Deficient Kidneys or Cold-Damp Bi causing low back and leg pain and weakness and contracture of the leg muscles."]},{"herb":"Individualherbsupdate/FengYenCao","dosage":"9g","actions":["Eliminates Wind, invigorates the Blood and expels Dampness."]},{"herb":"QingFengTeng","dosage":"9g","actions":["Dispels Wind-Damp Bi, unblocks the channels and collaterals and relieves pain."]},{"herb":"HaiFengTeng","dosage":"9g","actions":["Dispels Wind-Dampness, unblocks the channels, disperses Cold and stops pain.","With Gui Zhi, for pain, impaired joint movement and spasms of the sinews due to Wind-Damp Bi."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"ShuDiHuang","dosage":"9g","actions":["Nourishes the Blood.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"HuangQi","dosage":"9g","actions":["Tonifies Qi and Blood, tonifies Wei Qi, stabilizes the Exterior and relieves numbness and pain.","With Dang Gui, for Qi and Blood Deficiency with painful obstruction and paresthesia.","with Gui Zhi, for Qi and Blood Deficiency and Ying and Wei Deficiency with numbness and painful obstruction of the musculature."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood and harmonizes the Ying and Wei.","With Shu Di Huang and Dang Gui, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis.","With Gui Zhi, harmonizes the Ying and Wei.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]}],"actions":["Dispels Wind-Cold-Damp","Tonifies Qi","Strengthens Yang","Warms the channels","Strengthens the tendons","Nourishes and Invigorates the Blood","Breaks up Blood Stasis","Eliminates Damp","Stops pain"],"syndromes":["Wind Cold Damp Bi with Blood Stasis and Qi, Blood and Yang Deficiency"],"manifestations":{"symptoms":["Attacks of severe acute joint pain which is fixed in location, worse with Cold and better with warmth","Aversion to Wind, Cold and Dampness","Stiff and painful muscles and joints","Limited movement","Pain aggravated by Wind","Sensitive to climatic changes","Numbness of muscles","Pain aggravated by Dampness","Cold joints","Possible deformation and hardening of the joint with restricted movement","Maybe joint swelling without redness or Heat","Pain worse at night","Low back pain or soreness","Lumbago","Fatigue","Heaviness of the body","Heaviness of the muscles","Preference for warmth","Weak joints","Palpitations","Pale face","Preference for dry weather","Anemia","Uterine bleeding","Cold extremities","Pale or sallow face","Dizziness","General fatigue","Coarse skin","Nocturnal emissions","Weak knees","Fatigue","Dyspnea","Night sweats","Irregular menstruation","Insomnia","Intolerance of Cold","Decreased eyesight after a prolonged illness","Anxiety","Intermittent fever","Jaundice","Deficient cough","Shortness of breath","Anorexia","Listlessness","Lassitude","Spontaneous sweating","Spermatorrhea","Continuous spotting","Leukorrhea","Weak legs and knees"],"tongue":"Pale or Purplish","tongueCoat":"Thin and white or Thin, white and greasy","pulse":"Thready and weak or Thready and slippery or Deep, slippery and wiry or Soft, moderate and wiry"},"conditions":[{"condition":"Gout","name":"Gout"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}