{"formula":"QingShuTang","names":{"pinyin":"qing shu tang","hanzi":"清暑汤","english":"clear summerheat decoction","commonEnglish":"Clear Summerheat Decoction","aka":[""]},"herbs":[{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat, relieves toxicity, reduces abscesses, dissipates clumps, promotes urination and Clears Blood Heat.","With Jin Yin Hua, for Initial-stage Wind-Heat."]},{"herb":"PuHuang","dosage":"12g","actions":["Stops bleeding by astringing, invigorates the Blood, dispels Blood Stasis and promotes urination."]},{"herb":"HuaShi","dosage":"12g","actions":["Promotes urination, drains Heat from the Urinary Bladder, expels Damp-Heat, releases Summeheat and resolves Dampness.","With Gan Cao, for Summerheat causing painful urinary dysfunction, thirst, irritability and fever."]},{"herb":"JinYinHua","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity and disperses Summerheat.","With Lian Qiao, for various Heat disorders.","With Gan Cao, for toxic swellings and sores."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses.","With Che Qian Zi and Huan Shi, for burning dysuria."]},{"herb":"CheQianZi","dosage":"9g","actions":["Promotes urination, expels Phlegm and clears Damp-Heat.","With Ze Xie, for edema and distention."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination and leaches out Dampness.","With Hua Shi and Che Qian Zi, for Damp-Heat Lin."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Clears Summerheat","Dispels toxins"],"syndromes":["Swelling due to Summerheat"],"manifestations":{"symptoms":["Boils occur around the face, head, neck and hips","At the onset, they may be hard nodes","Localized redness and swelling","Pain and Heat","Later the may become soft with a whitish-yellowish exudate","A suppurating in-sized lesion may appear at the top","The adjacent lymph nodes may be enlarged","Fever and chills, fever more pronounced or","Tidal fever","Abdominal distention","Thirst","Sweat","Stifling sensation in the chest","Restlessness","Gastric disturbances: Heaviness Nausea Severe diarrhea","Scanty urine"],"tongue":"Red tip and edges","tongueCoat":"Greasy white or yellow","pulse":"Rapid and soft"},"conditions":[{"condition":"Furuncles","name":"Boils"},{"condition":"Furuncles","name":" Furuncles"},{"name":"Pyeoderma"},{"name":"Impetigo"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}