{"formula":"QingChangYin","names":{"pinyin":"qing chang yin","hanzi":"清肠饮","english":"clear the intestines drink","commonEnglish":"Clear the Intestines Drink","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"90g","actions":["Clears Heat, resolves Fire toxicity and clears Damp-Heat from the Lower Jiao.","With Di Yu and Huang Qin, for bleeding Intestinal abscess or bleeding dysenteric disorder due to Damp-Warm febrile disease.","With Gan Cao, for toxic swellings and sores.","With Gan Cao and Xuan Shen, for sloughing ulcers from Heat toxicity.","with Huang Qi, for suppurating boils that have not ulcerated, or have ulcerated but are not discharging pus."]},{"herb":"DangGui","dosage":"60g","actions":["Tonifies, activates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue.","With Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"DiYu","dosage":"30g","actions":["Cools the Blood, stops bleeding, clears Toxic Heat, astringes Fluids and generates flesh."]},{"herb":"XuanShen","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin, softens hardness, dissipates nodules, drains Fire and relieves toxicity.","With Jin Yin Huan and Dang Gui, for recalcitrant, ulcerated, and painful sores due to toxic obstruction leading to Blood Stasis.","With Jin Yin Hua and Gan Cao, for boils, carbuncles and furuncles."]},{"herb":"MaiMenDong","dosage":"30g","actions":["Nourishes Stomach Yin, generates Fluids, moistens the Intestines, clears the Heart and eliminates irritability."]},{"herb":"GanCao","dosage":"9g","actions":["Moistens the Lungs, moderates spasms and alleviates pain, clears Heat and relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"YiYiRen","dosage":"15g","actions":["Strengthens the Spleen, resolves Dampness, clears Heat and expels pus."]},{"herb":"HuangQin","dosage":"6g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and stops bleeding.","With Di Yu, for bloody stool due to Intestinal Wind."]}],"actions":["Drains Excess Fire","Enriches Yin","Resolves toxicity"],"syndromes":["Early-stage Intestinal Abscess"],"manifestations":{"symptoms":["Acute, intermittent, spasmodic lower abdominal pain","The pain is usually in the left or right iliac fossa","The pain may be quite severe and is worse with pressure","There may be rebound pain","The abdominal muscles over the site of pain may be tight","The pain may have begun over the navel","Chills and fever","Aversion to Wind","Spontaneous sweating","Pain in the groin that is relieved by flexing the hip and knee and is aggravated by extending the hip","Dry, scaly skin","A dry mouth and tongue","Qi Stagnation predominant: The pain may move around","Blood Stagnation predominant: The pain is fixed","Abdominal distention","Belching","Loss of appetite","Nausea","Maybe vomiting","Maybe constipation","Maybe a mild fever","Maybe chills and fever"],"tongue":"Red","tongueCoat":"Thin and white or Thin and yellow","pulse":"Wiry or Tight"},"conditions":[{"name":"Intestinal abscess"},{"condition":"Diverticulitis","name":"Diverticulitis"},{"name":"Postpartum women with Damp and Blood stagnation"},{"name":"Acute and chronic appendicitis"},{"condition":"AbdominalPain","name":"Abdominal pain associated with menstruation"}],"contra":{"contraindications":["Contraindicated for those without damage to Yin and Blood.","Contraindicated for late-stage appendicitis where Heat symptoms are not pronounced."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"a stronger effect in reducing inflammation","modifications":[{"herb":"PuGongYing","modification":"+ Hb. Taraxaci"},{"herb":"ZiHuaDiDing","modification":"+ Hb. Violae"}]},{"purpose":"reduced urination","modifications":[{"herb":"FuLing","modification":"+ Poria"},{"herb":"LianQiao","modification":"+ Fr. Forsythiae"}]},{"purpose":"dry stools","modifications":[{"herb":"TaoRen","modification":"+ Sm. Persicae"},{"herb":"HuoMaRen","modification":"+ Sm. Cannabis"},{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"}]},{"purpose":"severe fever","modifications":[{"herb":"MuDanPi","modification":"+ Cx. Moutan"}]}]}