{"formula":"QingLiangYin","names":{"pinyin":"qing liang yin","hanzi":"清凉饮","english":"clearing and cooling decoction","commonEnglish":"Clearing and Cooling Decoction","aka":[""]},"herbs":[{"herb":"HuangQin","dosage":"6g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and calms ascending Liver Yang."]},{"herb":"HuangLian","dosage":"6g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and drains Stomach Fire.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos."]},{"herb":"BoHe","dosage":"4.5g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat, vents rashes and relieves Stagnation of Liver Qi."]},{"herb":"XuanShen","dosage":"4.5g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and Relieves toxicity."]},{"herb":"DangGui","dosage":"4.5g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"4.5g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood and treats abdominal pain due to disharmony between the Liver and Stomach.","With Huang Qi, for dysenteric disorders with abdominal pain due to Heat entering the Interior.","With Huang Lian and Huang Qin, for Damp-Heat dysenteric disorders."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Heat from the Upper and Middle Jiaos"],"syndromes":["Heat in the Upper and Middles Jiaos"],"manifestations":{"symptoms":["Thirst","Restlessness","Foul breath","A dry throat"],"tongue":"Dry"},"conditions":[{"name":"Stomatitis"},{"name":"Canker sores"},{"condition":"HerpesGenitalia","name":"Oral herpes"},{"condition":"BadBreath","name":"Bad breath"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"constipation caused by Excess Heat","modifications":[{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"}]}]}