{"formula":"QingReXaioYuTang","names":{"pinyin":"qing re xiao yu tang","hanzi":"清热消瘀湯","english":"clear heat and eliminate stagnation decoction","commonEnglish":"Clear Heat and Eliminate Stagnation Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Bai Shao and Dang Gui, for dysmenorrhea from Liver Qi Stagnation and Blood Deficiency."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation, stops pain, conducts Heat out from below and stops pain.","With Yan Hu Suo, for intermittent epigastric and hypochondriac pain, hernia pain or menstrual pain with irritability due to Liver Stagnation with Heat."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Disperses Wind-Heat, spreads Liver Qi and relieves Stagnation.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Zhi Ke, for a stifling sensation in the chest, abdominal pain, poor appetite and irregular bowel movements.","With Bo He, for emotional depression, a stifling sensation in the chest and irregular menstruation due to Liver Blood Stagnation and Deficiency.","With Bai Shao, Dang Gui and Bo He, for Liver Qi Stagnation with stress and emotional distress."]},{"herb":"HongTeng","dosage":"9-30g","actions":["Clears Heat, resolves toxicity, invigorates the Blood, disperses Stasis and stops pain."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Chuan Lian Zi, for flank, upper right quadrant, epigastric and abdominal pain."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"YuJin","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears Heat, cools the Blood and alleviates pain.","With Zhi Ke, for Liver Qi Stagnation with a stifling sensation in the chest and fullness in the epigastrium and abdomen with Heat signs.","With Chai Hu, for Liver Qi and Blood Stagnation with flank pain and distention, dysmenorrhea and irregular menstruation."]},{"herb":"HuaShi","dosage":"9-18g","actions":["Promotes urination and drains Heat from the Urinary Bladder."]},{"herb":"GanCao","dosage":"3-14g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, Dang Gui and Chai Hu, for hypochondriac pain due to Liver Qi Stagnation."]},{"herb":"BoHe","dosage":"3-6g","actions":["Disperses Wind-Heat and relieves Stagnation of Liver Qi.","With Bai Shao, Chai Hu and Dang Gui, for Liver Qi Stagnation with chest and flank distention or pain."]}],"actions":["Clears Heat","Disperses Stasis"],"syndromes":["Stagnant Heat"],"manifestations":{"symptoms":["Scanty menstruation","The Blood is purplish red with clots","Distention and pain in the lower abdomen","Distention and pain in the flanks","Refuses palpation","Emaciation","A long history of lower back pain","Distention and pain of the hypochondrium"],"tongue":"Red","tongueCoat":"Thin","pulse":"Wiry and rapid"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}