{"formula":"QingTanYin","names":{"pinyin":"qing tan yin","hanzi":"淸痰饮","english":"clear phlegm drink","commonEnglish":"Clear Phlegm Drink","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"10g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Chen Pi, for a productive cough and a stifling sensation in the chest due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, Dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiTianNanXing","dosage":"10g","actions":["Dries Dampness, expels Phlegm, reduces swelling and alleviates pain."]},{"herb":"TianHuaFen","dosage":"10g","actions":["Clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus and reduces swelling."]},{"herb":"ZhiZi","dosage":"10g","actions":["Clears Heat, reduces Fire, eliminates irritability in the San Jiao, clears Heat, resolves Dampness, reduces swelling and invigorates the Blood."]},{"herb":"ShiGao","dosage":"15g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Excess Heat from the Lungs."]},{"herb":"HuangQin","dosage":"10g","actions":["Clears Heat and dries Dampness.","With Zhi Zi, powerfully clears and drains lurking Heat from the Lungs with fever, fullness in the chest, coughing with yellow sputum and epistaxis or hematemesis."]},{"herb":"FuLing","dosage":"10g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"ZhiKe(Qiao)","dosage":"6g","actions":["Promotes the movement of Qi and reduces distention and pressure."]},{"herb":"QingDai","dosage":"5g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, disperses Stagnation and reduces swelling."]}],"actions":["Transforms Phlegm","Clears Heat"],"syndromes":["Phlegm-Fire Blocking the Orifices"],"manifestations":{"symptoms":["Dilation of the pupils","Blurred vision","Distending pain in the eyeballs, forehead and supra-orbital bone","Fever","Thirst","Vomiting with foamy vomitus"],"tongue":"Red","tongueCoat":"Slimy","pulse":"Wiry and slippery"},"conditions":[{"name":"Midriasis"},{"name":"Blurred vision"},{"condition":"EyePain","name":"Eye pain"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}