{"formula":"QingGanYinJingTang","names":{"pinyin":"qing gan yin jing tang","hanzi":"清氣阴精汤","english":"clear the liver and sexual fluids decoction","commonEnglish":"Clear the Liver and Sexual Fluids Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies the Blood and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood for Blood Deficiency Heat. ."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver, calms Liver Yang and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Huang Qin, cools Heat and nourishes the Blood.","With Huang Qin, Huang Lian and Mu Dan Pi, for menstrual disorders with Heat signs such as profuse, fresh red Blood, Heat sensations or early menstruation."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat.","With Mu Dan Pi, for Ying and Xue Stage Heat with a high fever, scarlet tongue, thirst, a rash all over the body, epistaxis and hemoptysis."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood and clears Deficiency Fire."]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Cools the Blood, relieves toxicity and stops bleeding by astringing.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Cools the Blood and stops bleeding."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation, conducts Heat out from below and stops pain."]},{"herb":"QianCaoGen","dosage":"6-16g","actions":["Cools the Blood and stops bleeding."]},{"herb":"LuGen","dosage":"15-30g","actions":["Clears Heat and irritability from the Lungs and Stomach and generates fluids.","With Zhi Zi, for irritability."]},{"herb":"HuangLian","dosage":"3-10g","actions":["Clears Heat and stops bleeding.","With Sheng Di Huang, for insomnia and delirium due to unremitting Heat injuring the Ying level.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease."]}],"actions":["Clears Heat","Cools the Blood","Nourishes Yin"],"syndromes":["Blood Heat"],"manifestations":{"symptoms":["Sudden epistaxis or hemoptysis one to two days prior to the onset of menstruation","Menstruation is reduced or clotted","Painful abdomen","Thirst","Flushed face","Insomnia due to heartburn"],"tongue":"Red","tongueCoat":"Little","pulse":"Thready and rapid"},"conditions":[{"condition":"VicariousMenstruation","name":"Vicarious menstruation"},{"condition":"Hemoptysis","name":"Hemoptysis"},{"condition":"Epistaxis","name":"Epistaxis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}