{"formula":"QingGanJieYuTang","names":{"pinyin":"qing gan jie yu tang","hanzi":"清肝解郁湯","english":"decoction for clearing the liver and relieving stagnation","commonEnglish":"Decoction for Clearing the Liver and Relieving Stagnation","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chen Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, softens the Liver and relieves pain.","With Gan Cao, for Epigastric, hypochon-driac or flank pain.","with Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, dries Dampness and transforms Phlegm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction."]},{"herb":"ZhiBanXia.htm","dosage":"3-14g","actions":["Dries Dampness, transforms Phlegm, dissipates nodules, reduces Stagnation, treats sores, skin ulcerations and carbuncles and reduces swelling.","With Chen Pi, for Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Zhe Bei Mu, for scrofula or Phlegm-Dampness induced cough."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi.","With Dang Gui, tonifies the Blood and moves Qi.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis."]},{"herb":"ZheBeiMu","dosage":"3-12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules."]},{"herb":"FuLing","dosage":"9-18g","actions":["Strengthens the Spleen and transforms Phlegm.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation."]},{"herb":"YuanZhi","dosage":"3-15g","actions":["Reduces abscesses and dissipates swellings."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Expels pus.","With Gan Cao, for Lung abscess with expectoration of pus and pain in the chest and flanks.","With Zhi Ban Xia, for long-standing Phlegm-Dampness."]},{"herb":"ZiSuYe","dosage":"3-10g","actions":["Releases the Exterior, disperses Cold promotes the movement of Spleen and Stomach Qi, improves Lung function and expands the chest.","With Dang Gui and Chuan Xiong, harmonizes the Blood and disperses Blood Stasis.","With Xiang Fu and Chen Pi, for Wind-Cold with Qi Stagnation and chest congestion"]},{"herb":"ZhiZi","dosage":"3-12g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, cools and activates the Blood, relieves toxicity and reduces swelling."]},{"herb":"MuTong","dosage":"3-10g","actions":["Promotes lactation and unblocks Blood vessels.","With Dang Gui, promotes the circulation of Blood and stops pain."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Clears the Liver","Drains Fire","Eliminate Stagnation","Resolve Phlegm"],"syndromes":["Liver Qi Stagnation with Heat"],"manifestations":{"symptoms":[":Large breast lump like a heap, adhering to the skin","Inverted nipple","Orange-skin effect","Irritability","Dry mouth","Bitter taste","Headache","Red face"],"tongue":"Red","tongueCoat":"Dry-yellow","pulse":"Wiry and rapid"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}