{"formula":"QingShuYiQiTangJiaJian","names":{"pinyin":"qing shu yi qi tang jia jian","hanzi":"清暑益氣湯加減","english":"modified clear summerheat and augment qi decoction","commonEnglish":"Modified Clear Summerheat and Augment Qi Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"3g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, promotes urination and generates Body Fluids.","With Ren Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"RenShen","dosage":"2g","actions":["Tonifies Spleen and Stomach Qi and tonifies Qi in Deficiency patients with Exterior conditions.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Huang Qi, for Qi Deficiency with general debility, anorexia and spontaneous sweat."]},{"herb":"CangZhu","dosage":"3g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Huang Bai, for Pain, swelling, and weakness of the lower extremities or skin lesions due to Wind-Dampness.","With Da Zao, for chronic accumulation of Dampness in the Spleen with hypochondriac pain, acid reflux and anorexia."]},{"herb":"ZeXie","dosage":"2g","actions":["Promotes urination, leaches out Dampness and drains Damp-Heat from the lower Jiao.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"ChenPi","dosage":"2g","actions":["Regulates Descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and helps prevent Stagnation from tonic herbs.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi and Cold-Dampness Obstructing the Middle with nausea and hiccup.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"DangGui","dosage":"1g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Huang Qi, for Qi and Blood Deficiency."]},{"herb":"QingPi","dosage":"7g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm."]},{"herb":"HuangBai","dosage":"6g","actions":["Drains Damp-Heat especially from the Lower Jiao.","With Cang Zhu, eliminates Dampness and clears Heat for: Lower Jiao Damp-Heat with pain, swelling and weakness in the lower limbs and Damp-Heat vaginal discharge."]},{"herb":"WuWeiZi","dosage":"9g","actions":["Tonifies Qi, astringes leakage of Lung Qi, tonifies the Kidneys, astringes Jing, stops diarrhea and spermatorrhea, astringes sweat and generates fluids.","With Ren Shen and Mai Men Dong, for Exhaustion of Qi and Yin with shortness of breath, cough and thirst.","With Huang Qi, for Yang Deficiency with spontaneous sweat."]},{"herb":"DaZao","dosage":"3g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, treats External Wind-Cold, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, prevents tonics from generating Dampness in the Middle Jiao, prevents Phlegm accumulation, nourishes the Blood and enhances the effects of other Qi and Blood tonifying herbs by facilitating their digestion and absorption."]},{"herb":"ShengMa","dosage":"3g","actions":["Releases the Exterior, clears Heat, relieves toxicity, raises Yang and lifts sunken Qi.","With Ge Gen, unblocks the pores to vent rashes and treat Wind-Heat patterns in which Heat toxin has injured the Fluids of the Stomach with fever, chills, headache and thirst.","With Dang Gui, raises the clear Qi, allowing turbidity to descend and moistening the Intestines."]},{"herb":"ShenQu","dosage":"2g","actions":["Moves Qi, reduces Food Stagnation, promotes digestion and harmonizes the Stomach.","With Bai Zhu, for Food Stagnation and diarrhea due to Spleen Deficiency."]},{"herb":"BaiZhu","dosage":"2g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating.","With Cang Zhu, for Damp Cold Painful Obstruction."]},{"herb":"MaiMenDong","dosage":"1g","actions":["Nourishes Lung and Stomach Yin and generates Fluids."]},{"herb":"GeGen","dosage":"6g","actions":["Discharges Exterior conditions, relieves Heat, raises Spleen Yang and stops diarrhea."]},{"herb":"ShengJiang","dosage":"3g","actions":["Releases the Exterior, induces perspiration, disperses Cold, releases the Exterior, induces perspiration, disperses Cold, warms the Lungs, normalizes the flow of Qi at the center and reduces the toxicity of other herbs."]},{"herb":"GanCao","dosage":"1g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Summerheat and Dampness","Tonifies Qi"],"syndromes":["Summerheat and Dampness with Qi Deficiency"],"manifestations":{"symptoms":["Tidal fever or","A low-grade fever that appears mostly after exertion or","A normally low temperature but is occasionally high","Abdominal distention","Thirst","Sweat","Stifling sensation in the chest","Restlessness","Heaviness","Nausea","Scanty urine","Fatigue","Loose stools","Anorexia","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion"],"tongue":"Pale or Red tip and edges","tongueCoat":"Greasy white or yellow","pulse":"Empty or Rapid and soft"},"conditions":[{"condition":"Fever","name":"Fever "},{"condition":"Anorxia","name":"Anorexia"},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Fatigue","name":"Fatigue"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}