{"formula":"QingChangTang","names":{"pinyin":"qing chang tang","hanzi":"清肠汤","english":"clear the intestines decoction","commonEnglish":"Clear the Intestines Decoction","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"6-20g","actions":["Clears Heat, resolves Fire toxicity and clears Damp-Heat from the Lower Jiao.","With Lian Qiao, for various Heat disorders.","With Di Yu and Huang Qin, for bleeding Intestinal abscess or bleeding dysenteric disorder due to Damp-Warm febrile disease."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps, clears Blood Heat and promotes urination."]},{"herb":"HuaiHuaMi","dosage":"4.5-16g","actions":["Cools the Blood and stops bleeding."]},{"herb":"DiYu","dosage":"6-16g","actions":["Cools the Blood, stops bleeding, clears Toxic Heat, astringes Fluids and generates flesh.","With Gan Cao, for bleeding dysentery with rectal tenesmus, mucus and lower abdominal pain."]},{"herb":"PuGongYing","dosage":"9-30g","actions":["Clears Heat, resolves Dampness, reduces abscesses, dissipates nodules, relieves Fire toxicity and clears Heat in the Blood."]},{"herb":"ChunPi","dosage":"3-15g","actions":["Clears Heat, astringes the Intestines, dries Dampness, stops diarrhea and stops bleeding."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and stops bleeding.","With Huang Lian, Lian Qiao and Pu Gong Ying, for general Heat toxins with External or internal sores and abscesses.","With Di Yu, for bloody stool due to Intestinal Wind."]},{"herb":"XianHeCao","dosage":"6-16g","actions":["Astringes leakage of Blood, stops bleeding, astringes diarrhea and dysentery, reduces swelling and eliminates pus.","With Huai Hua Mi, for hemafecia.","With Di Yu, for bloody diarrhea or dysenteric disorders."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, activates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"YuLiRen","dosage":"3-12g","actions":["Moistens the Intestines, unblocks the bowels, promotes urination and reduces edema."]},{"herb":"HeZi","dosage":"3-10g","actions":["Astringes the Intestines and stops diarrhea."]},{"herb":"WuWeiZi","dosage":"6-9g","actions":["Tonifies the Kidneys, astringes Jing and stops diarrhea and spermatorrhea."]}],"actions":["Clears Damp-Heat","Eliminates toxins","Stops bleeding","Regulates bowel movements"],"syndromes":["Damp-Heat in the Lower Jiao"],"manifestations":{"symptoms":["Swollen, severely painful hemorrhoids","Possible protrusion which looks dull red in color and ulcerated","Discharge of turbid, colored Blood","Difficult defecation","A hot, burning distended feeling in the anus, which is worse during defecation","Itchy anus","Tenesmus","Abdominal distention","Poor appetite","A heavy body","Fatigue"],"tongue":"Normal","tongueCoat":"Slimy and yellow","pulse":"Slippery and rapid"},"conditions":[{"condition":"Hemorrhoids","name":"Hemorrhoids"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}