{"formula":"QinJiaoBieJiaHeYueHuaWanJiaJian","names":{"pinyin":"qin jiao bie jia he yue hua wan jia jian","hanzi":"秦艽鳖甲合月華丸加減","english":"modified gentiana macrophyllae and carapax trionycis decoction","commonEnglish":"Modified Gentiana Macrophyllae and Carapax Trionycis Decoction","aka":[""]},"herbs":[{"herb":"BieJia","dosage":"15g","actions":["Nourishes Yin and anchors Yang.","With Sheng Di Huang, Zhi Mu and Qing Hao, for injured Yin in the aftermath of a febrile disease with fever and night sweats followed by a sense of cooling in the morning.","With Di Gu Pi, Qin Jiao and Yin Chai Hu, for afternoon fevers, night sweats and steaming bone disorder due to Yin Deficiency."]},{"herb":"DiGuPi","dosage":"12g","actions":["Cools the Blood, drains Yin Deficiency Fire, clears and drains Heat in the Lung, cools the Blood and stops bleeding.","With Yin Chai Hu, Zhi Mu, and Qin Jiao, for Blood Deficiency, steaming bone disorder or other types of recurrent afternoon fever.","With Zhi Mu and Bie Jia, for Blood Heat with Yin Deficiency.","With Zhi Mu, Qin Jiao and Bie Jia, for steaming bone sensation with tidal fever and night sweats caused by Yin Deficiency and Heat."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood Nourishes Yin and generates fluids.","With E Jiao, for coughing, hematemesis, epistaxis, and uterine hemorrhage due to Heat from Deficiency.","With Zhi Mu, Qing Hao and Bie Jia, for late stage Ying or Xue Stage Heat in the Yin areas of the body with night fever, morning coolness, emaciation, and a red tongue.","With Mai Men Dong, Bei Sha Shen and Nan Sha Shen, for a dry mouth, thirst, dry lips and a red tongue due to Stomach Yin Deficiency."]},{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Lung Yin,d clears Lung Heat and tonifies Liver and Kidney Yin.","With Chuan Bei Mu, Zhi Mu and Bie Jia, for hemoptysis due to Yin Deficiency and Heat from consumption.","With Mai Men Dong, for a dry cough with little Phlegm and a parched throat due to Lung Dryness or Heat injuring the Lung Yin and a dry throat, constipation, thirst and a red tongue with little coat due to pathogenic Warmth or Heat injuring the Stomach Yin or long-term Yin Deficiency.","With Sheng Di Huang and Mai Men Dong, for a dry, parched throat and thirst after a warm pathogen disease injuring Stomach Yin.","With Mai Men Dong, Chuan Bei Mu, Zhi Mu, Bie Jia and Di Gu Pi, for a dry cough with scanty, yellow, difficult-to-expectorate sputum.","With Chuan Bei Mu, Zhi Mu, Bie Jia and Di Gu Pi, for Lung Yin Deficiency with Dryness and Rising Deficient Fire."]},{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Yin, moistens the Lungs, dispels Phlegm and stops coughing.","With Chuan Bei Mu and Zhi Mu, for a dry cough with sputum that is difficult to expectorate due to Lung Yin Deficiency.","With Tian Men Dong, Sheng Di Huang, Chuan Bei Mu, Bai Bu and E Jiao, a chronic dry cough with no sputum due to Lung Yin Deficiency."]},{"herb":"BaiBu","dosage":"12g","actions":["Moistens the Lungs and stops coughing.","With Bei Sha Shen and Nan Sha Shen, for coughing due to Lung Heat injuring the Qi and fluids or Lung consumption.","With Chuan Bei Mu, for coughing and chest pain due to Phlegm Heat.","With Chuan Bei Mu, Bei Sha Shen and Nan Sha Shen, for pertussis.",""]},{"herb":"QingHao","dosage":"9g","actions":["Clears Deficiency fevers, cools the Blood and stops bleeding.","With Yin Chai Hu and Zhi Mu, for chronic low-grade fever with a sensation of Heat in the bones and a body that feels warm to the touch.","With Bie Jia and Sheng Di Huang, for fevers due to Heat in the Yin regions of the body.","With Bie Jia, for the final stages of a Warm febrile disease when the Yin Fluids have already been damaged and the pathogen still lurks deep within the Yin level with night fever with chills in the morning, the fever recedes without sweating, emaciation, rapid pulse and a red tongue with little coating.","With Zhi Mu, Qin Jiao and Bie Jia, for Yin Deficient Heat."]},{"herb":"ZhiMu","dosage":"9g","actions":["Clears Heat, drains Fire from the Lungs and Stomach, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst.","With Bie Jia, for Steaming Bone disorder."]},{"herb":"MaiMenDong","dosage":"9g","actions":["Moistens the Lungs, nourishes Yin and stops coughing.","With Tian Men Dong, for Lung and Kidney Yin Deficiency with consumptive coughing and occasional hemoptysis.","With Bei Sha Shen and Nan Sha Shen, for a dry cough with little Phlegm and a parched throat due to Lung Dryness or Heat injuring the Lung Yin.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"TianMenDong","dosage":"9g","actions":["Nourishes Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, generates Fluids and resolves Phlegm."]},{"herb":"EJiao","dosage":"9g","actions":["Tonifies and nourishes the Blood, stops bleeding, nourishes and moistens Yin and moistens the Lungs and Large Intestine.","With Mai Men Dong, Bei Sha Shen and Nan Sha Shen, for a dry cough with Blood streaked sputum due to Lung Yin Deficiency.","With Tian Men Dong, for fire or Dryness in the Lungs and Kidneys with emaciation, afternoon fever, parched throat and a dry cough with blood streaked-sputum."]},{"herb":"QinJiao","dosage":"6g","actions":["Clears Deficiency Heat.","With Bie Jia, Qing Hao, Di Gu Pi and Zhi Mu, for bone steaming fever and afternoon fever or other low grade fevers due to Yin Deficiency as a result of long term illness.","With Bie Jia, vents the muscle layer and cools tidal fevers associated with consumption, especially Wind consumption with steaming bones."]},{"herb":"YinChaiHu","dosage":"6g","actions":["Clears Deficiency Heat, cools the Blood and stops bleeding.","With Bie Jia, for febrile disorders with tidal fevers, a thin body and dry skin and nails.","With Di Gu Pi, Qing Hao and Bie Jia, for Yin Deficiency Heat with night sweats and steaming bone sensations."]},{"herb":"ChuanBeiMu","dosage":"6g","actions":["Clears Heat, transforms Phlegm, clears Heat, stops coughing and nourishes and moistens the Lungs.","With Zhi Mu, for coughing with scanty, difficult to expectorate sputum due to Yin Deficiency Fire burning the Lungs."]}],"actions":["Nourishes Yin","Subdues Fire"],"syndromes":["Kidney Yin Deficiency with Fire Flaring"],"manifestations":{"symptoms":["Dizziness","Tinnitus or deafness","Poor memory","Aching, soreness or weakness of the low back","Spermatorrhea or","Premature ejaculation","Aching in the bones","Bone-steaming tidal fever","Aching in the leg and heel","Dry mouth, nose, lips and throat","Dry skin","Thirst","Night sweats","Five Sole Heat","Malar flush","Emaciation","Low grade fever in the afternoon","Dry throat, maybe recurrent sore throat","Dry cough with no Phlegm or","Dry cough with scanty, thick, yellow Phlegm","Recurrent episodes of hacking copious amounts of fresh Blood","Dry stools and/or","Constipation","Urine short and red","Heightened libido","Insomnia","Frequent dreams","Palpitations","Dizziness","Blurred vision","Easily angered","Cramping pain in the chest, ribs and flanks"],"tongue":"Red","tongueCoat":"Little or None","pulse":"Thready and rapid"},"conditions":[{"condition":"PulmonaryTuberculosis","name":"Pulmonary tuberculosis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe night sweats","modifications":[{"herb":"QingHao","modification":"- Hb. Artemisiae Annuae"},{"herb":"FuXiaoMai","modification":"+ 30g Fr. Tritici Levis"},{"herb":"MuLi","modification":"+ 15-30g Concha Ostreae"},{"herb":"LongGu","modification":"+ 15-30 g Fossilia Ossis Mastodi"},{"herb":"WuWeiZi","modification":"+ 9g Fr. Schisandrae"},{"herb":"GeQiao(HaiGeKe)","modification":"+ 12g Concha Cyclinae"},{"herb":"GuaLouRen","modification":"+ 9g Sm. Trichosanthis"},{"herb":"MaDouLing","modification":"+ 6g Fr. Aristolochiae"}]},{"purpose":"seminal emissions","modifications":[{"herb":"GuiBan","modification":"+ 15g Plastrum Testudinis"},{"herb":"HuangBai","modification":"+ 9g Cx. Phellodendri"}]},{"purpose":"irritability, agitation and insomnia","modifications":[{"herb":"YeJiaoTeng","modification":"+ 30g Caulis Polygoni Multiflori"},{"herb":"SuanZaoRen","modification":"+ 12g Sm. Zizyphi Spinosae`"}]},{"purpose":"thick, sticky, yellow Phlegm","modifications":[{"herb":"ZhiZi","modification":"+ 9g Fr. Gardeniae"}]},{"purpose":"hacking up Blood","modifications":[{"herb":"BaiMaoGen","modification":"+ 15g Rz. Imperatae"},{"herb":"BaiJi","modification":"+ 15g Rz. Bletillae"}]}]}