{"formula":"QinLianJieDuTang","names":{"pinyin":"qin lian jie du tang","hanzi":"芩連解毒湯","english":"scutellaria and coptis decoction to relieve toxicity","commonEnglish":"Scutellaria and Coptis Decoction to Relieve Toxicity","aka":[""]},"herbs":[{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Huang Lian and Zhi Zi, for acute febrile disease.","With Zhi Zi, for sores due to Heat toxin."]},{"herb":"HuangLian","dosage":"6g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos.","With Huang Qin and Zhi Zi, for a high fever, irritability, a dry mouth and throat and dark urine due to Fire toxin in the three burners."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, invigorates, cools and harmonizes the Blood, dispels Blood Stasis, drains pus and reduces swelling."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes."]},{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","with Lian Qiao and Huang Qin, for unremitting high fever.","With Gan Cao, for toxic swellings and sores.","With Huang Qin, for suppurating boils that have not ulcerated or have ulcerated but are not discharging pus."]},{"herb":"LianQiao","dosage":"9g","actions":["Clears Heat, relieves toxicity, reduces abscesses and dissipates clumps."]},{"herb":"ZhiZi","dosage":"6g","actions":["Clears Heat, reduces Fire, drains Damp-Heat, cools and invigorates the Blood, relieves toxicity and reduces swelling."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Clears Heat","Relieves Toxicity"],"syndromes":["Toxic Heat"],"manifestations":{"symptoms":["Local inflammation with pus","Deep-rooted, hard and painful boils","Erythema","Swelling","Heat","Carbuncles","Furuncles","Fever and chills","Pain","Blisters","The lesions appear on the head, face and extremities","The lesions are grain-like with a hard base","The lesions are yellowish-purplish in color","A tingling sensation","Fistulae"],"tongue":"Red","tongueCoat":"Yellow and greasy","pulse":"Rapid"},"conditions":[{"condition":"Furuncles","name":"Furuncles"},{"condition":"Erythema","name":"Erythema"},{"condition":"Furuncles","name":"Boils"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}