{"formula":"QiQiaoShouGongWan","names":{"pinyin":"qi qiao shou gong wan","commonEnglish":"","aka":[""]},"herbs":[{"herb":"GeJie","dosage":"7pcs","actions":["Tonifies Jing and Blood, controls and stabilizes Kidney Qi and stabilizes Ming Men Fire."]},{"herb":"TuBieChong","dosage":"7pcs","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation and disperses lumps and masses."]},{"herb":"MoYao","dosage":"2.1g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling."]},{"herb":"Individualherbsupdate/HongNiangZi","dosage":"7pcs","actions":["Disperses stagnant Blood and removes toxin."]},{"herb":"QiCao","dosage":"7pcs","actions":["Invigorates the Blood, breaks up Blood Stasis, disperses clumps, resolves Fire toxicity and stops pain."]},{"herb":"RuXiang","dosage":"2.1g","actions":["Invigorates the Blood, promotes the movement of Qi, invigorates the channels and alleviates pain.","With Mo Yao, for Blood Stasis obstructing the channels with epigastric, flank abdominal and joint pain."]},{"herb":"XiongHuang","dosage":"2.1g","actions":["Relieves toxicity, dries Dampness, expels Phlegm and kills parasites."]}],"actions":["Breaks up and drives out Blood Stasis","Invigorates Blood circulation","Disperses lumps and masses","Resolves Fire toxicity"],"syndromes":["Blood Stagnation with Heat"],"manifestations":{"symptoms":["Sharp, stabbing epigastric pain with fixed location","Epigastric or abdominal pain and distention","The pain may start intermittently but becomes more constant","Pain is severe after eating","The pain may radiate to the back","Dislike of pressure and Heat on the epigastrium","Pain predominates over distention or","Pain but no distention","Dysphagia","Epigastric rumbling","May be abdominal or epigastric lumps or masses","Nausea","Vomiting purple/black blood or \"coffee grounds\"","Indeterminate gnawing hunger","Anorexia","Weight loss","Weakness","Dry stools with blood like tar (melaena)","Hemafecia with dark, purple Blood or mixed dark and fresh Blood","Constipation","Dry, rough skin","Darkish, purplish or a blotchy complexion, lips and conjunctiva","Dark rings around the eyes","Spider naevi on the cheeks, epigastrium, trunk and around the inner ankle and knee","Maybe hemorrhoids","Maybe irregular menstruation with dark, purple, clotted Blood","With significant Deficiency from chronic Blood loss: A pale or sallow complexion Dizziness"],"tongue":"Dark purple with purple spots or dots and dark, distended sublingual veins","tongueCoat":"White or Grayish white or Yellow","pulse":"Wiry and choppy or Wiry or Choppy or Thready and choppy or Deep and thready"},"conditions":[{"condition":"StomachCancer","name":"Stomach cancer "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a powder, mix with honey for pills the size of a green bean. Take 1 pill three times a day. Take more depending on the severity."],"modifications":[]}