{"formula":"QiRebellion1`","names":{"pinyin":"qi rebellioan #1","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, and cools Heart Fire.","With Shui Niu Jiao,. for Toxic Heat in the Blood.","With Shui Niu Jiao and Mu Dan Pi, for rashes due to Blood Heat.","With Xuan Shen, for Excess or Deficiency Heat patterns.","With Xuan Shen and Shui Niu Jiao, for Heat in the Ying Stage.","With Mu Dan Pi and Chi Shao, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"CeBaiYe","dosage":"15g","actions":["Cools the Blood, stops bleeding, stops coughing and asthma and expels Phlegm.","With Sheng Di Huang, for all types of bleeding due to Heat in the Blood.","With Sheng Di Huang, He Ye and Ai Ye, for hemorrhage due to Blood Heat.","With Pu Huang, for Heat-induced uterine bleeding."]},{"herb":"AiYe","dosage":"3g","actions":["Warms the channels, stops bleeding, resolves Phlegm and stops coughing and asthma.","With Sheng Di Huang, He Ye and Ce Bai Ye, for epistaxis, hemoptysis or hematemesis due to Blood Heat."]},{"herb":"HeYe","dosage":"9g","actions":["Relieves Summerheat, raises and clears Spleen Yang, removes Stagnation and stops bleeding."]},{"herb":"XuanShen","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Mu Dan Pi, for erysipelas and purplish rashes.","With Sheng Di Huang, for Kidney Yin Deficiency with Fire Blazing with soreness and swelling in the throat, dry mouth and a parched tongue."]},{"herb":"NiuXi","dosage":"9g","actions":["Invigorates the Blood, expels Blood Stasis and descends Blood and Fire.","With Sheng Di Huang, powerfully clears Deficiency Fire Blazing Upward with pain and swelling of the gums, epistaxis, hematemesis and other hemorrhage in the upper body."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Chi Shao, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes.","With Chi Shao and Sheng Di Huang, for hematemesis and epistaxis due to Heat in the Xue level."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, cools the Blood, relieves toxicity, stops bleeding by astringing and invigorates the Blood.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood.","With Ce Bai Ye and Sheng Di HUang, for Heat induced hemorrhage such as hematemesis and epistaxis."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Mu Dan Pi and Sheng Di Huang, for Heat entering the Xue Stage causing maculae or hemorrhage.","With Mu Dan Pi, for Blood Stasis disorders."]},{"herb":"PuHuang","dosage":"9g","actions":["Stops bleeding by astringing, invigorates the Blood and dispels Blood Stasis."]},{"herb":"JiangXiang","dosage":"2.4g","actions":["Disperses Blood Stasis, stops bleeding, invigorates the Blood, promotes the movement of Qi, alleviates pain, harmonizes the Middle Jiao and relieves nausea."]},{"herb":"ShuiNiuJiao","dosage":"30g","actions":["Clears Heat from the Ying and Xue stages,","relieves Fire toxicity, cools the Blood and stops bleeding.","With Sheng Di Huang, for loss of consciousness and delirium, with epistaxis, hematemesis, or purpura due to Blood Heat."]}],"actions":["Calms the Shen","Opens the Channels","Descends Qi","Transforms Stasis","Clears Heat","Cools the Blood","Stops bleeding"],"syndromes":["Qi Rebellion Damaging the Channels"],"manifestations":{"symptoms":["Bleeding gums","Spasmatic cough","Radiating chest and lateral-costal pain","Red tinged Phlegm","A dry mouth","Irritating Heat","Epistaxis","Abdominal glomus and pain","Black colored stools","Dizziness","Tidal fever","Short, red urination"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Wiry and rapid"},"conditions":[{"condition":"Gingivitis","name":"Gingivitis"},{"condition":"Cough","name":"Cough"},{"condition":"Epistaxis","name":"Epistaxis"},{"condition":"Hematuria","name":"Hematuria"},{"condition":"AbdominalPain","name":"Abdominal pain"},{"condition":"Dizziness","name":"Dizziness"},{"condition":"Fever","name":"Fever"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}