{"formula":"QiWeiCangBaiSan","names":{"pinyin":"qi wei cang bai san","hanzi":"七味苍柏散","english":"seven","commonEnglish":"Seven-Ingredient Powder with Atractylodes and Phellodendron","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Huang Bai, for pain, swelling, and weakness of the lower extremities or skin lesions due to Wind-Dampness.","With Bai Zhu, for musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Damp-Heat especially from the Lower Jiao and drains Kidney Fire."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and aids the smooth flow of Qi and Blood."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood,d promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction."]}],"actions":["Clears Heat","Resolves Dampness","Tonifies the Kidneys","Strengthens the lower back"],"syndromes":["Damp-Heat in the Lower Jiao with Kidney Deficiency"],"manifestations":{"symptoms":["The lower back feels hot either to the patient or practitioner","Chronic pain in the low back and knees, with possible acute exacerbations","The pain is aggravated by Heat, humid or rainy weather and is not improved by rest","Limited lumbar movement","Maybe inability to move forward and backward","Slight swelling and redness in the back area","Obvious tenderness at the sides of the spinous processes or in the sacroiliac joint","The low back feels sore and heavy","The pain may radiate to the lower abdomen","Aches and pains in the bones and sinews","Weakness or atrophy of lower extremities","Painful and/or scanty yellow urine","Red, hot, swollen and painful feet or knees","Edema in lower legs","Leukorrhea (thick, yellow, foul-smelling)","Poor memory","Sores on lower extremities due to Damp","Redness, swelling and pain of the knees with burning sensations","Oliguria","Eczema","Irritability","Feverishness","Spontaneous sweat","A bitter taste in the mouth","Nausea","Vomiting","Diarrhea","Thirst","Loose stools or","Discharge of purulent, bloody stools","Yellowish or reddish urine","Painful urination"],"tongue":"Normal or Red","tongueCoat":"Yellow and greasy","pulse":"Soft and rapid or Slippery and rapid"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}