{"formula":"QiXueXuTang","names":{"pinyin":"qi xue xu tang","hanzi":"气血虚汤","english":"qi and blood deficiency decoction","commonEnglish":"Qi and Blood Deficiency Decoction","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia.","With Shu Di Huang and He Shou Wu, for Blood Deficiency."]},{"herb":"HuangQi","dosage":"12g","actions":["Tonifies Qi and Blood, strengthens the Spleen and raises Spleen Yang."]},{"herb":"DangGui","dosage":"12g","actions":["Tonifies the Qi of the Blood and activates and harmonizes the Blood.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes the Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood and calms Liver Yang.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"EJiao","dosage":"9g","actions":["Tonifies and nourishes the Blood.","With Dang Shen and Dang Gui, for Blood Deficiency with dizziness and palpitations.","With Dang Gui, Bai Shao and Shu Di Huang, for anemia.","With Dang Gui, Bai Shao, Huang Qi and Shu Di Huang, for anemia with Qi Deficiency."]},{"herb":"BieJia","dosage":"15g","actions":["Nourishes Yin, anchors Yang and activates the Blood."]},{"herb":"HeShouWu","dosage":"12g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and nourishes Jing.","With Dang Gui and Bai Shao, for Irregular menstruation and uterine bleeding from exhausted Liver and Kidneys."]}],"actions":["Tonifies Qi","Nourishes the Blood"],"syndromes":["Qi and Blood Deficiency"],"manifestations":{"symptoms":["A low-grade fever that appears mostly after exertion or","A normally low temperature but is occasionally high and accompanied by Vertigo Weakness Spontaneous sweating Catches cold easily Shortness of breath that makes speech difficult Anorexia Soft stools","Fatigue","Loose stools","Poor appetite","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Scanty periods","Maybe chills and fever or","Low grade fever"],"tongue":"Pale or Pale, thin and dry","tongueCoat":"Thin and white","pulse":"Weak or Thin and choppy or Thready and weak"},"conditions":[{"condition":"Fever","name":"Low-grade Fever"},{"condition":"Fatigue","name":"Fatigue"},{"condition":"Forgetfulness","name":"Forgetfulness"},{"condition":"Palpitations","name":"Palpitations"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"low-grade fever due to Qi and Blood Deficiency with spontaneous sweating","modifications":[{"herb":"MuLi","modification":"+ Concha Ostreae"},{"herb":"LongGu","modification":"+ Fossilia Ossis Mastodi"}]},{"purpose":"low-grade fever due to Qi and Blood Deficiency with spontaneous sweating and aversion to Cold","modifications":[{"herb":"GuiZhi","modification":"+ Ram. Cinnamomi"},{"herb":"ChiShao","modification":"+ Rx. Paeoniae Rubra"}]},{"purpose":"low-grade fever due to Qi and Blood Deficiency with Dampness","modifications":[{"herb":"CangZhu","modification":"+ Rz. Atractylodis"},{"herb":"FuLing","modification":"+ Poria"},{"herb":"HouPo","modification":"+ Cx. Magnoliae Officinalis"}]}]}