{"formula":"QiYangYuXinDan","names":{"pinyin":"qi yang yu xin dan","hanzi":"起阳豫心丹","english":"arouse yang and please the heart special pill","commonEnglish":"Arouse Yang and Please the Heart Special Pill","aka":[""]},"herbs":[{"herb":"SuanZaoRen","dosage":"18g","actions":["Nourishes Heart Yin, tonifies Liver Blood and calms the Spirit.","With Yuan Zhi, balances the contracting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"FuLing","dosage":"12g","actions":["Quiets the Heart, calms the Spirit and soothes the nerves."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, regulates menstruation and calms Liver Yang.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"TuSiZi","dosage":"12g","actions":["Strengthens Yang, nourishes Yin, astringes Jing, benefits the marrow, tonifies the Kidneys and Liver and improves vision."]},{"herb":"ShenQu","dosage":"9g","actions":["Reduces Food Stagnation, promotes digestion and harmonizes the Stomach.","With Bai Zhu, for Food Stagnation and diarrhea due to Spleen Deficiency."]},{"herb":"ChaiHu","dosage":"9g","actions":["Spreads Liver Qi, relieves Stagnation and raises the Clear Qi of the Stomach and Gallbladder.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, activates and harmonizes the Blood.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"RenShen","dosage":"6g","actions":["Tonifies Heart Qi and calms the Spirit.","With Yuan Zhi, Fu Shen and Shi Chang Pu, for confusion and forgetfulness."]},{"herb":"YuanZhi","dosage":"6g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidney, expels Phlegm and opens the Orifices.","With Fu Shen and Suan Zao Ren, for irritability, disorientation, palpitations, anxiety and insomnia due to Heart Blood Deficiency or Qi Stagnation.","With Suan Zao Ren, Bai Zhu and Dang Gui, for palpitations and insomnia due to Qi Deficiency.","With Ren Shen, Fu Shen and Shi Chang Pu, calms the Spirit."]},{"herb":"ShiChangPu","dosage":"6g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen and promotes the movement of Qi."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi."]},{"herb":"ShaRen","dosage":"6g","actions":["Promotes the movement of Qi.","With Bai Zhu and Ren Shen, for Spleen and Stomach Deficiency."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ren Shen, relieves palpitations and anxiety."]}],"actions":["Benefits the Heart, Gallbladder and Kidneys","Supports Yang","Calms the Shen"],"syndromes":["Heart and Gallbladder Qi Deficiency"],"manifestations":{"symptoms":["Palpitations","Anxiety","Apprehension","Constant worry","Poor concentration","Timidity","Shyness","Easily startled","Nervousness","Irritability","Restless sleep","Insomnia","Inability to get or maintain an erection","Dizziness","Emaciation","Shortness of breath","Constipation","Dry mouth and throat","Numbness","Dry cough","Cough with little or no sputum","Cough with blood streaked sputum","Spontaneous perspiration","Night sweats","Five Sole Heat due to stress","Early menses","Restlessness","Dry tongue","Pale copious menstrual flow","Weakness","Memory loss","Excess dreams","Fright","Physical and mental fatigue","Dry, hard stool","Coarse skin","Dry throat","A skinny appearance","A pale complexion"],"tongue":"Pale and shiny or Red","tongueCoat":"Thin and white or None or Thin and greasy","pulse":"Knotted or Intermittent or Minute, forceless and Deficient or Thready and rapid or Wiry and thready"},"conditions":[{"condition":"Impotence","name":"Impotence"},{"condition":"AnxietyNeurosis","name":"Anxiety neurosis"},{"condition":"Forgetfulness","name":"Forgetfulness"},{"condition":"Fatigue","name":"Fatigue"},{"condition":"NightSweats","name":"Night sweats"},{"condition":"Dyspnea","name":"Dyspnea"},{"condition":"PostTraumaticStressDisorder","name":"Post-traumatic shock disorder (PTSD)"},{"condition":"Stress","name":"Stress"},{"condition":"Weakness","name":"Weakness"},{"condition":"Palpitations","name":"Palpitations"},{"condition":"Perspiration","name":"Perspiration"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}