{"formula":"QiZhenSan","names":{"pinyin":"qi zhen san","hanzi":"起枕散","english":"raising the pillow powder","commonEnglish":"Raising the Pillow Powder","aka":[""]},"herbs":[{"herb":"RouGui","dosage":"3g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms and unblocks the channels and vessels and alleviates pain.","With Dang Gui and Chuan Xiong, for dysmenorrhea, postpartum abdominal pain or amenorrhea due to Deficiency Cold of the Chong and Ren channels."]},{"herb":"DangGui","dosage":"6g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses."]},{"herb":"ChiShao","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses.","With Chuan Xiong, Dang Gui and Pu Huang, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Rou Gui, for irregular menstruation with Cold in the Blood."]},{"herb":"MuDanPi","dosage":"4.5g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Chi Shao, for Blood Stasis disorders."]},{"herb":"PuHuang","dosage":"6g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Wu Ling Zhi, for Blood Stasis causing menstrual irregularity, dysmenorrhea and lochioschesis with chest and abdominal pain.","With Wu Ling Zhi and Yan Hu Suo, for dysmenorrhea."]},{"herb":"WuLingZhi","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, transforms Stasis and stops bleeding.","With Yan Hu Suo and Mo Yao, for chest, epigastric and abdominal pain due to Qi Stagnation and Blood Stasis."]},{"herb":"YanHuSuo","dosage":"6g","actions":["Invigorates the Blood, circulates Qi, stops pain and disperses extravasation.","With Wu Ling Zhi, for chest and abdominal pain due to Blood Stagnation.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation."]},{"herb":"MoYao","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling."]},{"herb":"BaiZhi","dosage":"3g","actions":["Reduces swelling, eliminates toxins, expels pus, expels Dampness, alleviates discharge and treats leukorrhea and diarrhea.","With Chuan Xiong, for headaches.","With Dang Gui, for vaginal infections."]}],"actions":["Warms the Uterus","Expels Cold","Invigorates the Blood"],"syndromes":["Retention of lochia due to Blood Stasis due to Cold"],"manifestations":{"symptoms":["Absent or scanty dark lochial discharge","Small stringy clots","Abdominal pain","Pain alleviated by warmth and aggravated by Cold","Generalized cold limbs"],"tongue":"Bluish purple","tongueCoat":"White","pulse":"Deep, tight and slow"},"conditions":[{"condition":"Lochioschesis","name":"Lochioschesis"},{"condition":"PostpartumConvulsions","name":"Postpartum convulsions"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}