{"formula":"QuFengDaoTanTang","names":{"pinyin":"qu feng dao tan tang","hanzi":"驱风導痰湯","english":"expel wind and guide out phlegm decoction","commonEnglish":"Expel Wind and Guide out Phlegm Decoction","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"9g","actions":["Releases the Exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"FangFeng","dosage":"6g","actions":["Releases the Exterior, expels Wind-Cold-Dampness, stops pain, expels Internal Wind, stops spasms, moves Qi and tonifies Spleen.","With Zhi Tian Nan Xing, for headaches, generalized body aches and numbness due to Wind-Phlegm Obstructing the channels."]},{"herb":"FuLing","dosage":"12g","actions":["Strengthens the Spleen, harmonizes the Middle Jiao, transforms Phlegm and dries Dampness.","With Zhi Ban Xia, Chen Pi and Sheng Jiang, for congested Fluids in the Stomach manifesting as nausea and vomiting.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Sheng Jiang, Zhu Ru and Zhi Ban Xia, for congested fluids in the Stomach causing nausea and vomiting."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends rebellious Qi, harmonizes the Stomach, stops vomiting and reduces distention.","With Chen Pi, for Stomach Qi Disharmony with epigastric and abdominal distention or pain.","\\With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose, watery stools."]},{"herb":"ChenPi","dosage":"6g","actions":["Dries Dampness, transforms Phlegm, regulates Qi and adjusts the Middle Jiao.","With Sheng Jiang, for Cold-Dampness Obstructing the Middle with nausea and hiccups","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sheng Jiang, Zhu Ru and Zhi Ban Xia, for nausea and vomiting due to rebellious Stomach Qi."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ZhiTianNanXing","dosage":"6g","actions":["Dries Dampness, expels Phlegm, disperses Wind-Phlegm in the channels, stops spasms and alleviates pain.","With Zhi Ban Xia, Chen Pi and Zhi Shi, for Phlegm-Dampness Obstruction that will not dissipate, with fainting from Wind-stroke, coughing with copious sputum, a cold upper back, a stifling sensation in the chest and a thick, gummy nasal discharge."]},{"herb":"ZhiShi","dosage":"9g","actions":["Disperses Wind-Phlegm in the channels, dries Dampness and expels Phlegm.","With Ban Xia, Chen Pi, and Zhi Shi, for Phlegm-Damp Obstruction.","With Bai Zhu, for vomiting due to Cold, thin mucus.","With Chen Pi, strengthens the Middle Jiao.","With Zhu Ru, for Phlegm-Heat obstructing the flow of Qi with focal distention in the chest and epigastrium, hiccup, dry retching, nausea and acid regurgitation.",""]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Zhi Shi, for Spleen Deficiency and Qi Stagnation with anorexia and epigastric focal distention and fullness."]},{"herb":"ZhuRu","dosage":"6g","actions":["Clears Heat, transforms Hot Phlegm and stops vomiting."]},{"herb":"ShengJiang","dosage":"12g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting and adjusts the Ying and Wei.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold.","With Zhu Ru, for vomiting due to Heat in patients with Stomach Qi Deficiency."]}],"actions":["Expels Wind","Disperses Phlegm","Moves Qi","Stops spasms"],"syndromes":["Phlegm Obstruction"],"manifestations":{"symptoms":["Spasms, cramps and stiffness in the limbs, neck and back","Convulsions","Diffuse headache","Heaviness","Fogginess or fullness in the head","Visual disturbances","Double vision","Loss of sight","Dizziness","Vertigo","Fullness and discomfort in the chest and epigastrium","Nausea","Vomiting"],"tongue":"Normal","tongueCoat":"Greasy and white","pulse":"Soft, slippery and/or wiry"},"conditions":[{"condition":"NeckPain","name":"Neck and shoulder stiffness and pain"},{"condition":"Epilepsy","name":"Spasms and convulsions"},{"condition":"Headache","name":"Headache"},{"name":"Cerebral tumor, cyst or abscess"},{"name":"Cysticercosis"},{"condition":"Dizziness","name":"Dizziness"},{"condition":"Vertigo","name":"Vertigo"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"name":"Sarcoidosis"},{"name":"Echinococcsosis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Heat","modifications":[{"herb":"ZhiTianNanXing","modification":"- Rz. Arisaematis"},{"herb":"HuangLian","modification":"- Rz. Coptidis"},{"herb":"DanNanXing","modification":"+ 3g Arisaemae cum Bile"},{"herb":"HuangQin","modification":"+ 9g Rx. Scutellariae"},{"herb":"GuaLouRen","modification":"+ 9g Sm. Trichosanthis"}]}]}