{"formula":"QuFengZhiBaoDan","names":{"pinyin":"qu feng zhi bao dan","hanzi":"祛风至宝丹","english":"greatest treasure pill to dispel wind","commonEnglish":"Greatest Treasure Pill to Dispel Wind","aka":[""]},"herbs":[{"herb":"HuaShi","dosage":"45g","actions":["Promotes urination, drains Heat from the Urinary Bladder, releases Summeheat and resolves Dampness.","With Gan Cao, for Summerheat causing painful urinary dysfunction, thirst, irritability, and fever."]},{"herb":"ChuanXiong","dosage":"37.5g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness, and paralysis.","With Fang Feng and Jing Jie, for headache due Wind-Cold Invasion.","With Xi Xin. for Wind-Cold headaches."]},{"herb":"DangGui","dosage":"37.5g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GanCao","dosage":"30g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Jie Geng, for pain and swelling of the throat.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]},{"herb":"BaiShao","dosage":"21g","actions":["Nourishes the Blood, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis.","With Huang Qin and Huang Lian, for Damp-Heat dysenteric disorders.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"FangFeng","dosage":"21g","actions":["Releases the exterior, expels External Wind, expels Wind-Dampness, alleviates pain, expels Internal Wind and stops spasms.","With Jing Jie, for Exterior patterns in any season.","With Bo He and Lian Qiao, for Wind-Heat.","With Qiang Huo, for Wind-Dampness.","With Jing Jie and Qiang Huo, for Wind-Cold.","With Jing Jie, Bo He, Huang Qin and Lian Qiao, for Wind-Heat.","With Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi.","With Jing Jie, Lian Qiao and Bo He, for Wind-Heat with red eyes and a sore throat.","With Ma Huang, dispels Wind-Cold from the Exterior."]},{"herb":"BaiZhu","dosage":"19.5g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"ShiGao","dosage":"15g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability and quenches thirst.","With Shu Di Huang, for headache, toothache, and thirst due to raging fire caused by devastated Yin.","With Ma Huang, for Wind-edema.","With Ren Shen, for excessive Heat with Qi Deficiency.","With Huang Qin, Huang Lian and Huang Bai, for Toxic Heat with infection."]},{"herb":"HuangQin","dosage":"15g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies and calms ascending Liver Yang.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]},{"herb":"JieGeng","dosage":"15g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm.","With Gan Cao, for disseminates Lung Qi, expels Phlegm, resolves toxicity.","With Gan Cao and Huang Qin, for Hoarseness, pain and swelling of the throat due to Wind-Heat."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow.","With Dang Gui and Huang Lian, for Blood Deficiency with Heat."]},{"herb":"TianMa","dosage":"15g","actions":["Extinguishes Wind, calms the Liver, stops spasms and tremors, subdues Rising Liver Yang, disperses Wind-Damp Bi and alleviates pain.","With Chuan Xiong, for overwhelming attacks of Wind leading to migraines and dizziness so severe that the person feels as if they are about to fall over.","With Bai Zhu and Quan Xie, for chronic childhood convulsions."]},{"herb":"RenShen","dosage":"15g","actions":["Tonifies Qi, generates Body Fluids and stops thirst.","With Shu Di Huang, for Qi and Yin Deficiency.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Ma HUang, for Wind-Cold with underlying Qi Deficiency."]},{"herb":"QiangHuo","dosage":"15g","actions":["Releases the exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction, guides Qi to the Tai Yang and Du channels and alleviates pain.","With Chuan Xiong, for headache and generalized body aches and pains associated with the common cold or painful obstruction.","With Jing Jie and Fang Feng, for occipital headache from Wind-Cold without perspiration."]},{"herb":"DuHuo","dosage":"15g","actions":["Dispels Wind-Dampness, disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain.","With Fang Feng, for numbness in the legs.","With Qiang Huo, for joint pain and numbness.","With Ma Huang, for Wind-Cold with anhidrosis, and body aches and pains.","With Xi Xin, for joint pain due to Wind-Cold-Dampness."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, clears Heat, resolves Dampness, reduces swelling and activates the Blood."]},{"herb":"LianQiao","dosage":"7.5g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity and clears Blood Heat.","With Zhi Zi, for Heat entering the Pericardium."]},{"herb":"JingJie","dosage":"15g","actions":["Releases the exterior, expels Wind, dispels Wind and relieves muscle spasms.","With Bo He, releases the Exterior to induce sweating and disperses Wind in the head.","With Bo He, Lian Qiao and Jie Geng, for Wind-Heat."]},{"herb":"BoHe","dosage":"15g","actions":["Disperses Wind-Heat and relieves Stagnation of Liver Qi.","With Gou Teng and Jing Jie, prevents convulsions in febrile children.","With Hua Shi and Gan Cao, for Summerheat."]},{"herb":"MaHuang","dosage":"15g","actions":["Induces sweating, releases the Exterior and warms and disperses Cold pathogens.","With Shu Di Huang, warms and unblocks the channels and collaterals."]},{"herb":"DaHuang","dosage":"15g","actions":["Drains Heat, purges accumulations, Drains Fire, drains Heat from the Blood, invigorates the Blood, dispels Blood Stasis, clears Heat and eliminates Phlegm.","With Huang Lian, for a feeling of fullness and distention due to Heat accumulation.","With Huang Lian and Huang Qi, for whole body Damp-Heat.","With Zhi Zi, Huang Qin and Lian Qiao, for strong pathogenic Heat in the Upper and Middle Jiaos and upward Flaring of Heat attacking the head.","With Dang Gui, for Blood Stasis.","With Mang Xiao,eliminates obstruction in the Intestines for severe constipation with passage of liquid but no solid stool.","With Ren Shen and Dang Gui, for Yang Ming Stage with Qi and Blood Deficiency.","With Ren Shen and Gan Cao, for Constipation with Spleen Yang Deficiency and Accumulation of Cold."]},{"herb":"MangXiao","dosage":"15g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat and drains Fire.","With Da Huang and Gan Cao, for moderate constipation due to accumulation of Excess Heat.","With Da Huang, Huang Qin and Zhi Zi, for Heat in the Lungs and Stomach."]},{"herb":"HuangLian","dosage":"15g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Huang Qin and Zhi Zi, for high fever, irritability, dry mouth and throat, and dark urine due to Fire toxin in the three burner.","With Huang Qin and Da Huang, for hematemesis and rectal bleeding due to Blood Heat."]},{"herb":"HuangBai","dosage":"15g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Xi Xin, for Urinary frequency, urgency, discomfort, and pain.","With Zhi Zi, resolves constraint and directs Qi downward for clearing Heat and Fire from the Liver channel."]},{"herb":"XiXin","dosage":"15g","actions":["Releases Exterior Wind and Cold, disperses Wind-Cold and Internal Cold, alleviates pain, warms the Lungs and transforms Phlegm and Thin Mucus.","With Ma Huang, alleviates Wind-Cold-Damp Bi pain.","With Chuan Xiong, Jing Jie, Fang Feng and Qiang Huo, for Wind headache.","With Chuan Xiong and Fang Feng, for Bi syndrome."]},{"herb":"QuanXie","dosage":"15g","actions":["Extinguishes Wind, stops tremors and convulsions, tracks down Wind, unblocks the collaterals and stops pain."]}],"actions":["Calms Wind","Clears Heat","Unblocks the bowels"],"syndromes":["Wind-Stroke with internally-generated Wind-Heat"],"manifestations":{"symptoms":["Facial asymmetry","Hemiplegia","Paraplegia","Altered consciousness","Constipation","Sudden loss of consciousness"],"tongue":"Scarlet","tongueCoat":"Yellow","pulse":"Wiry and rapid"},"conditions":[{"condition":"Stroke","name":"Cerebrovascular accident"},{"name":"Loss of consciousness "},{"condition":"FacialParalysis","name":"Facial paralysis"},{"condition":"PostStrokeParalysis","name":"Hemiplegia"},{"condition":"Parylysis","name":"Paraplegia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}