{"formula":"RanGanLiPiTang","names":{"pinyin":"ran gan li pi tang","hanzi":"然肝肝脾汤","english":"correct the liver and encourage the spleen decoction","commonEnglish":"Correct the Liver and Encourage the Spleen Decoction","aka":[""]},"herbs":[{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Ren Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools.","With Bai Zhu and Tian Ma, for Phlegm accumulation with vertigo."]},{"herb":"RenShen","dosage":"1-9g","actions":["Tonifies Spleen and Stomach Qi.","With Bai Zhu, for tonifies the transformation and transportation functions of the Spleen."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"GanCao","dosage":"6-14g","actions":["Tonifies the Spleen,augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"TianMa","dosage":"3-10g","actions":["Extinguishes Wind, calms the Liver, stops spasms and tremors, subdues Rising Liver Yang and alleviates pain."]},{"herb":"GouTeng","dosage":"6-16g","actions":["Extinguishes Wind, alleviates spasms, drains Liver Heat and pacifies Liver Yang.","With Tian Ma, calms the Liver and extinguishes Wind.","With Tian Ma, Shi Jue Ming and Ju Hua, for dizziness and vertigo due to Liver Wind.","With Sang Ye, Shi Jue Ming and Ju Hua, for dizziness and vertigo due to Liver Wind."]},{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels."]},{"herb":"ShiJueMing","dosage":"9-30g","actions":["Drains Liver Fire, pacifies the Liver, anchors and sedates Liver Yang and calms Internal Wind.","With Ju Hua, for eye redness, swelling, and pain due to Liver Yang Rising.","With Jue Ming Zi, cools the Liver to improve vision in either Excess (Liver Fire) or Deficiency (Liver Yin Deficiency with Yang Rising) conditions."]},{"herb":"SangYe","dosage":"4.5-14g","actions":["Disperses, scatters Wind-Heat, calms the Liver and clears the eyes.","With Ju Hua, for vertigo and dizziness from Liver Yang Rising."]},{"herb":"JuHua","dosage":"4.5-20g","actions":["Disperses Wind, clears Heat, calms the Liver Yang and extinguishes Wind."]}],"actions":["Strengthens the Spleen","Promotes urination","Leaches out Dampness","Extinguishes Wind","Stops spasms and tremors","Calms the Liver","Subdues Rising Liver Yang"],"syndromes":["Spleen Deficiency with Liver Wind"],"manifestations":{"symptoms":["Spasms","Tremors","Tics"]},"conditions":[{"condition":"TouretteSyndrome","name":"Tourette syndrome "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}