{"formula":"RenShenChuanJiaoTang","names":{"pinyin":"ren shen chuan jiao tang","hanzi":"人參川椒湯","english":"ginseng and zanthoxli decoction","commonEnglish":"Ginseng and Zanthoxyli Decoction","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"1.5g","actions":["Tonifies Spleen, Stomach and Lung Qi.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"BaiZhu","dosage":"5g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Ren Shan and Gan Jiang, for Deficiency Cold of the Middle Jiao with abdominal pain, distention, vomiting and diarrhea.","With Gan Jiang, eliminates Cold Dampness in the Spleen."]},{"herb":"FuLing","dosage":"6g","actions":["Strengthens the Spleen, resolves Dampness and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"WuMei","dosage":"2g","actions":["Expels roundworms, astringes leakage of Lung Qi, stops leakage of sweat, stops coughs, astringes the Intestines, stops diarrhea and alleviates pain."]},{"herb":"ChuanJiao","dosage":"1.5","actions":["Kills parasites, warms the Middle Jiao, disperses Cold, dispels Dampness, relieves diarrhea and alleviates abdominal pain.","With Fu Ling, for Cold from Deficiency of the Lungs and Kidneys with lower back pain, icy cold feet and wheezing."]},{"herb":"GanJiang","dosage":"1.5g","actions":["Warms the Middle, expels Cold, warms the Lungs and transforms thin mucus.","With Bai Zhu, for diarrhea due to Spleen Deficiency.","With Ren Shen and Gan Jiang, for Spleen Yang Deficiency with a cold abdomen, vomiting and diarrhea.","With Fu Ling and Bai Zhu, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]}],"actions":["Kills parasites","Warms the Middle Jiao","Dispels Dampness","Alleviates pain"],"syndromes":["Ascariasis with Stomach Deficiency Cold"],"manifestations":{"symptoms":["Pulmonary phase: Cough Dyspnea Allergies Urticaria Asthma Eosinophilia","Intestinal phase: Abdominal discomfort Abdominal pain Occasional vomiting","Mild constant epigastric pain; relieved by warmth and pressure","Anorexia","Abdominal pain and fullness after meals","Nausea","Vomiting","Loose, unformed stools","Excessive salivation","Cold limbs","Lassitude","Weakness","Sallow or pale, dull complexion","Maybe edema","Maybe scanty urination","Maybe clear, watery, copious vaginal discharge"],"tongue":"Pale","tongueCoat":"White and greasy","pulse":"Deep, thready and forceless"},"conditions":[{"condition":"Parasites","name":"Roundworms"},{"condition":"Anorxia","name":"Anorexia"},{"condition":"Parasites","name":"Ascariasis"},{"condition":"Urticaria","name":"Urticaria"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}