{"formula":"RouGanHuaYuWan","names":{"pinyin":"rou gan hua yu wan","hanzi":"韖肝化瘀囊","english":"bolus for soothing the liver and removing blood stasis","commonEnglish":"Bolus for Soothing the Liver and Removing Blood Stasis","aka":[""]},"herbs":[{"herb":"DaHuang","dosage":"15g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis and inhibits the growth of cancer cells."]},{"herb":"TuBieChong","dosage":"30g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation, disperses lumps and masses and inhibits the growth of cancer cells.","With Da Huang, breaks up fixed abdominal masses from Blood Stasis.","With Da Huang and Tao Ren, for menstrual pain or postpartum abdominal pain due to Blood Stasis."]},{"herb":"ShuiZhi","dosage":"30g","actions":["Breaks up and drives out Blood Stasis, reduces fixed masses and inhibits the growth of cancer cells.","With Da Huang, regulates Yin and Yang to quickly attack and break up Blood Stasis."]},{"herb":"TaoRen","dosage":"30g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation such as dysmenorrhea, amenorrhea with abdominal pain, clotting and scanty flow, swollen painful sores and chest pain due to Blood Stasis.","With Da Huang, for severe abdominal infections."]},{"herb":"HongHua","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation, alleviates pain and inhibits the growth of cancer cells."]},{"herb":"EZhu","dosage":"15g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations, alleviates pain and inhibits the growth of cancer cells."]},{"herb":"YuJin","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores and alleviates pain.","With Dan Shen, for Heat with Blood Stasis causing chest Bi."]},{"herb":"DanShen","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces abscesses and inhibits the growth of cancer cells."]}],"actions":["Invigorates the Blood","Breaks up Stasis","Inhibits the growth of cancer cells"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Hypochondriac pain","Chest distention","Abdominal pain","Poor appetite","Fatigue","Pain that is fixed, stabbing and /or severe","Pain is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots","Maybe jaundice"],"tongue":"Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a powder, make into a bolus with honey. Take 3g twice daily."],"modifications":[]}