{"formula":"RuXianAiTangErShiSanHao","names":{"pinyin":"ru xian ai tang er shi san hao","hanzi":"乳腺癌湯二十三号","english":"breast cancer decoction #23","commonEnglish":"Breast Cancer Decoction #23","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"10g","actions":["Spreads Liver Qi, relieves Stagnation, resolves Shao Yang disorders and reduces fever.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"QingPi","dosage":"10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, reduces Food Stagnation, dries Dampness and transforms Phlegm.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"ZhiZi","dosage":"10g","actions":["Clears Heat, reduces Fire, reduces swelling, invigorates the Blood and inhibits the growth of cancer cells.","With Mu Dan Pi, resolves Qi Level Stagnation leading to Heat and Heat in the Blood."]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, clears Liver Fire, drains pus and reduces swelling.","With Chai Hu and Zhi Zi, for Fire from constraint leading to Liver Fire or Liver Yang Rising."]},{"herb":"GuaLou","dosage":"15g","actions":["Regulates Qi, transforms Hot Phlegm, reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"SiGuaLuo","dosage":"15g","actions":["Resolves toxicity, reduces swelling and unblocks the channels and collaterals in the breast."]},{"herb":"MaiYa","dosage":"15g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi."]},{"herb":"PuGongYing","dosage":"15g","actions":["Reduces abscesses, dissipates nodules, clears the Liver, clears Heat, relieves Fire toxicity and inhibits the growth of breast cancer cells."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm Dries Dampness and transforms Phlegm."]}],"actions":["Spreads Liver Qi","Relieves Stagnation","Clears Heat","Reduces Fire toxicity","Reduces abscesses","Invigorates the Blood","Inhibits the growth of cancer cells"],"syndromes":["Liver Qi Stagnation Transforming into Fire"],"manifestations":{"symptoms":["Large breast lump like a heap, adhering to the skin","Inverted nipple","Orange-skin effect","Irritability","Dry mouth","Bitter taste","Headache","Red face"],"tongue":"Red","tongueCoat":"Dry-yellow","pulse":"Wiry and rapid"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}