{"formula":"RuYongYanFangJiaJian","names":{"pinyin":"ru yong yan fang jia jian","hanzi":"乳痈验方加減","english":"modified breast welling abscess experiential formula","commonEnglish":"Modified Breast Welling Abscess Experiential Formula","aka":[""]},"herbs":[{"herb":"PuGongYing","dosage":"9-30g","actions":["Reduces abscesses, dissipates nodules, relieves Fire toxicity and promotes lactation."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With Wang Bu Liu Xing, Chuan Shan Jian and Pu Gong Ying, for breast abscess."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Qing Pi for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"ChuanShanJia","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks menstruation, promotes lactation, reduces swelling and promotes the discharge of pus.","With Wang Bu Liu Xing, for Insufficient lactation or lack of lactation.","With Pu Gong Ying, for inflammatory lesions of the skin that have not yet pustulated."]},{"herb":"ChuanBeiMu","dosage":"3-12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel.","With Gan Cao, for upper right quadrant pain."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Clears Heat, relieves Fire toxicity, resolves Phlegm and moderates and harmonizes the harsh properties of other herbs.","With Pu Gong Ying, for abscesses or other toxic swellings."]},{"herb":"GuaLou","dosage":"9-30g","actions":["Reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Chai Hu, for Qi Stagnation and menstrual irregularity.","With Chai Hu, Wang Bu Liu Xing, Chuan Shan Jia and Qing Pi, for breast distention or breast nodules."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Expels pus and Phlegm.","With Gan Cao, for Lung abscess with expectoration of pus and pain in the chest and flanks."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain.","With Xiang Fu, tonifies the Blood and moves Qi."]},{"herb":"LouLu","dosage":"3-14g","actions":["Clears Heat, resolves toxicity, drains abscesses and swellings, expels pus and promotes lactation.","With Gua Lou, promotes lactation due to Qi Stagnation transforming into Heat.","With Gua Lou, Chuan Bei Mu and Pu Gong Ying, for red, painful and swollen breasts.","With Wang Bu Liu Xing and Chuan Shan JIa, for insufficient milk production or obstruction of milk flow due to Heat."]},{"herb":"WangBuLiuXing","dosage":"4-30g","actions":["Promotes the movement of Blood, promotes lactation, invigorates the channels, reduces swelling and drains abscesses.","With Pu Gong Ying and Guan Lou, for breast abscess."]}],"actions":["Move Qi","Open the breasts","Scatter nodulation","Clears Heat","Eliminates pus"],"syndromes":["Breast milk Accumulation with Heat brewing pus"],"manifestations":{"symptoms":["Postpartum swollen lumps in the breast","The lumps begin soft and gradually harden","Stagnant breast milk","Chest oppression","Vexation","Agitation","Localized redness, swelling, aching and pain","Fever","Thirst","Reddish urination","Dry stools"],"tongue":"Red","tongueCoat":"Slimy and yellow","pulse":"Deep, wiry and rapid"},"conditions":[{"condition":"Mastitis","name":"Mastitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}