{"formula":"SangZhiShiGaoZhiMuTang","names":{"pinyin":"sang zhi shi gao zhi mu tang","hanzi":"桑枝石膏知母汤","english":"mulberry twig, gypsum and anemarrhea decoction","commonEnglish":"Mulberry Twig, Gypsum and Anemarrhena Decoction","aka":[""]},"herbs":[{"herb":"SangZhi","dosage":"9-15g","actions":["Dispels Wind-Dampness, unblocks the channels and collaterals, benefits the joints and stops spasms."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire, nourishes Yin and moistens Dryness.","With Huang Bai, clears Heat and Drains Fire for Yin Deficiency Fire.","With Shi Gao, cools Heat in the Yang Ming or Qi Level while protecting Stomach fluids to treat high fever, profuse sweating, insatiable thirst, a red face, aversion to Heat and a large, strong pulse."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating and expels Wind-Dampness.","With Shi Gao, for Warm-Damp febrile disease with fever, profuse sweating and generalized body aches.","With Huang Bai, for pain, swelling, and weakness of the lower extremities or skin lesions due to Wind-Dampness."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Zhi Mu, for Lower Jiao Damp-Heat."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and alleviates pain."]},{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Du Huo, for Dampness.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"ShiGao","dosage":"15-60g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability and quenches thirst"]},{"herb":"DuHuo","dosage":"3-10g","actions":["Dispels Wind-Dampness and alleviates pain.","With Qiang Huo, for joint pain and numbness."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain."]},{"herb":"HanFangJi","dosage":"3-12g","actions":["Expels Wind-Dampness, alleviates pain and purges Damp-Heat."]},{"herb":"YiYiRen","dosage":"9-30g","actions":["Expels Wind-Dampness, relieves pain, strengthens the Spleen, resolves Dampness and clears Damp-Heat."]},{"herb":"LuoShiTeng","dosage":"6-16g","actions":["Dispels Wind-Dampness and unblocks the channels and collaterals."]},{"herb":"WuJiaPi","dosage":"4.5-15g","actions":["Dispels Wind-Dampness, nourishes the Liver and Kidneys, strengthens the sinews and bones, transforms Dampness and reduces swelling.","With Wei Ling Xian, Qiang Huo and Qin Jiao, for Wind-Damp Bi causing muscle spasms and pain."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat and cools the Blood and relieves pain."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]}],"actions":["Dispels Wind-Dampness","Clears Heat","Unblocks the channels and collaterals","Relieves pain"],"syndromes":["Wind-Damp-Heat Bi"],"manifestations":{"symptoms":["Burning sensations","Generalized body aches and pains","Irritability","Heavy sensation in the shoulder and back","Discomfort or a constricted sensation in the area of the chest and diaphragm","Multiple sores, carbuncles furuncles or abscesses","Redness","Itching","Persistent swelling","Chest pain","Fever","Thirst","Aching and painful extremities","Aching and painful joints","Unbearable swelling and pain of the lower extremities","Shoulder stiffness"],"tongue":"Normal","tongueCoat":"Greasy and slightly yellow","pulse":"Wiry and rapid or Soft and moderate or Soft, superficial and slow or Slippery and rapid or Deep and tight"},"conditions":[{"name":"Rheumatic arthritis"},{"condition":"Osteoarthritis","name":"Arthritis"},{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"Gout","name":"Gout "},{"condition":"Fibromyalgia","name":"Fibromyalgia"},{"condition":"PainfulObstruction","name":"Painful obstruction"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}