{"formula":"SanJuTang","names":{"pinyin":"san ju tang","hanzi":"散聚汤","english":"the prescription of san ju tang","commonEnglish":"The Prescription of San Ju Tang","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"3-15g","actions":["Dries Dampness, transforms Phlegm, dissipates nodules and reduces Stagnation.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Hou Po, for Phlegm-Dampness with Qi Stagnation."]},{"herb":"BingLang","dosage":"6-15g","actions":["Regulates Qi, reduces accumulations, drains downward and unblocks the bowels."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Chen Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with cough, wheezing, nausea marked by profuse and salty sputum."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia, Fu Ling and Hou Po, enhances the Phlegm transforming, Spleen strengthening properties."]},{"herb":"XingRen","dosage":"3-10g","actions":["Stops cough and calms wheezing."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees for Deficiency of Ming Men Fire with impotence or infertility.","With Dang Gui and Chuan Xiong, for dysmenorrhea, postpartum abdominal pain or amenorrhea due to Deficiency Cold of the Chong and Ren channels.","With Wu Zhu Yu, for Cold hernial disorders with abdominal pain."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, transforms Phlegm, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Zhi Ban Xia, for Phlegm, thin mucus and turbid Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Fu Ling, for Lower body edema and dysuria."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Rou Gui, for irregular menstruation with Cold in the Blood."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"HouPo","dosage":"3-10g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, dries Dampness and transforms Phlegm.","With Zhi Ke, for Abdominal distention due to Qi and Food Stagnation.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi.","With Xing Ren, for Upper and Middle Jiao Dampness with a stifling sensation in the chest and epigastric and abdominal distention with a feeling of fullness."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi, relieves Stagnation in the Liver channel and alleviates pain."]}],"actions":["Eliminates Dampness","Resolves Phlegm","Dissipates nodulations and abdominal masses","Warms the Lower Jiao"],"syndromes":["Phlegm-Dampness"],"manifestations":{"symptoms":["Uterine myoma","Abdominal pain","Abdominal distention"]},"conditions":[{"condition":"UterineMyoma","name":"Uterine myoma"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"constipation","modifications":[{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"}]}]}