{"formula":"SanXinDaoChiSanJiaJIan","names":{"pinyin":"san xin dao chi san jia jian","hanzi":"三心導赤散加減","english":"modified three","commonEnglish":"Modified Three-Pith Guide out the Red Powder","aka":[""]},"herbs":[{"herb":"LianQiao","dosage":"1g","actions":["Clears Heat especially in the Upper Jiao, relieves toxicity and clears Blood Heat (used when Heat enters the Pericardium)."]},{"herb":"RouGui","dosage":"1g","actions":["Assists the Heart Yang and assists communication between the Heart and Kidneys."]},{"herb":"LianZiXin","dosage":"2g","actions":["Drains Heart Fire and relieves irritability."]},{"herb":"XuanShen","dosage":"2g","actions":["Clears Heat. cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Sheng Di Huang, for Excess or Deficiency Heat patterns."]},{"herb":"ShengDiHuang","dosage":"2g","actions":["Cools Heart Fire, nourishes Yin, cools Blood and generates Fluids."]},{"herb":"FuLing","dosage":"2g","actions":["Clears Dampness and Heat."]},{"herb":"FuLing","dosage":"2g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"ShanYao","dosage":"3g","actions":["Tonifies the Spleen, nourishes Stomach Yin, tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing."]},{"herb":"CheQianZi","dosage":"3g","actions":["Promotes urination, clears Damp-Heat, clears the Lungs and expels Phlegm."]},{"herb":"ShaShen","dosage":"4g","actions":["Nourishes Lung, Stomach, Liver and Kidney Yin, clears Lung Heat and generates fluids."]},{"herb":"MuTong","dosage":"0.5gg","actions":["Clears Heat from the Heart channel and clears Heat and promotes urination through the Small Intestine channel."]}],"actions":["Clears Heat from the Heart","Guides out reddish urine","Supports the Spleen","Nourishes Yin","Removes moisture","Reduces itching"],"syndromes":["Fetal Heat"],"manifestations":{"symptoms":["Particularly in thin, weak, undernourished babies with a yellow complexion","Main sites involved: Scalp Face Neck May spread to the trunk and limbs","Lesions: Papules Large pale red or dark red erythematous patches covered by oily scales or crusts Often small lesions covered with lichens form thin white scales The skin is rough and itchy, disturbing sleep No clear boundaries Scratching will cause slight bleeding or result in the formation of bloody crusts"],"tongue":"Additional Symptoms: Indigestion Vomiting of milk shortly after feeding Loose stools possibly with undigested food Itching Insomnia These babies are pale Poor appetite.  Pale red or Red or A red tip C: Scant or Thin and white P: Moderate or Rapid"},"conditions":[{"condition":"AtopicDermatitis","name":"Atopic dermatitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}