{"formula":"ShenShouWeiShengTang","names":{"pinyin":"shen shou wei sheng tang","hanzi":"qiang huo and haliotis combination","commonEnglish":"Qiang Huo and Haliotis Combination","aka":[""]},"herbs":[{"herb":"QiangHuo","dosage":"1.5g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain."]},{"herb":"HongHua","dosage":"2g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"DangGui","dosage":"2g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"BaiZhi","dosage":"2g","actions":["Expels Wind, eliminates Dampness, dispels Cold, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Qiang Huo, for Wind-Cold Dampness causing fever, chills and headaches.","With Jin Yin Hua, Chuan Shan Jia and Tian Hua Fen, for abscesses and swelling."]},{"herb":"FuLing","dosage":"2g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"LianQiao","dosage":"2g","actions":["Clears Heat, relieves toxicity, reduces abscesses, dissipates clumps and promotes urination."]},{"herb":"ShiJueMing","dosage":"2g","actions":["Drains Liver Fire, pacifies the Liver, anchors and sedates Liver Yang, clears Stomach Fire and stops pain and bleeding."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat, relieves Fire toxicity, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"TianHuaFen","dosage":"3g","actions":["Drains Heat, generates Fluids, relieves toxicity, expels pus and reduces swelling."]},{"herb":"ChuanShanJia","dosage":"2g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling, promotes the discharge of pus and expels Wind-Dampness from the channels.","With Zao Jiao Ci, for suppurative, inflamed skin lesions that have pustulated but remain closed."]},{"herb":"JinYinHua","dosage":"3g","actions":["Clears Heat, resolves Fire toxicity and clears Damp-Heat from the Lower Jiao.","With Lian Qiao, for various Heat disorders.","With Gan Cao, for Toxic swellings and sores.","With Dang Gui, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"RuXiang","dosage":"1.5g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling,","generates flesh and alleviates pain."]},{"herb":"ChenXiang","dosage":"2g","actions":["Promotes movement of Qi, descends Qi, regulates the Middle, dispels Cold, warms the Spleen, Kidneys and Stomach, stops vomiting and alleviates pain."]},{"herb":"ZaoJiaoCi","dosage":"3g","actions":["Draws out toxicity, discharges pus, invigorates the Blood and reduces swelling.","With Jin Yin Hua, for initial stages of abscesses and boils.","With Bai Zhi, for un-ulcerated abscesses or those with difficulty discharging pus."]},{"herb":"DaHuang","dosage":"6g","actions":["Drains Heat, purges accumulations, transforms Dampness, promotes urination, invigorates the Blood, dispels Blood Stasis, reduces Fire toxicity and eliminates Phlegm.","With Dang Gui, for Blood Stasis."]}],"actions":["Dispel Wind-Dampness,","Promotes urination","Clears Heat","Resolves toxicity","Invigorates the Blood","Dispels Stasis","WArms Cold"],"syndromes":["Toxic Heat with Blood Stagnation and Dampness"],"manifestations":{"symptoms":["Hematuria","Decreased urination or","Interrupted urination or","Constant urination or","Anuria","Blood clots causing pain on urination","Pain in the pubic and perineal areas","Pain at the end of the penis","Lower abdominal fullness","Lower abdominal pain which may radiate to the genitals","Anal pain","Low back and waist pain and aching","Polyuria","Oliguria","Frequent urination","Local redness","Swelling and pain","Tumor formation","Maybe fever and chills"],"tongue":"Red or Dark purple","tongueCoat":"Thin white or yellow","pulse":"Rapid and forceful or Slow and choppy or Thin or Deep and choppy"},"conditions":[{"condition":"BladderCancer","name":"Bladder cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}