{"formula":"ShenShiTang","names":{"pinyin":"shen shi tang","hanzi":"渗湿汤","english":"leach out dampness decoction","commonEnglish":"Leach out Dampness Decoction","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"10g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao.","With Bai Zhu, for musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen","With Bai Zhu, for Strengthens the Spleen and resolves Dampness."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat."]},{"herb":"GanJiang","dosage":"10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao, rescues Devastated Yang and expels Interior Cold.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Fu Ling, Bai Zhu and Gan Cao, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drink."]},{"herb":"DingXiang","dosage":"3g","actions":["Warms the Middle Jiao, relieves pain, descends Qi, warms the Kidneys and assists Yang.","With Bai Zhu, for Spleen Qi Deficiency."]}],"actions":["Dries Dampness","Transforms Phlegm"],"syndromes":["Phlegm-Damp"],"manifestations":{"symptoms":["Anorexia","Edema","Abdominal distention","Chest and hypochondriac distention","Dizziness","Nausea","Vomiting","Vertigo","Thirst with no desire to drink","Maybe no thirst","Palpitations","Shortness of Breath","Lower back pain"],"tongue":"Normal","tongueCoat":"Thick and slippery","pulse":"Slippery, full and maybe wiry"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"condition":"LowBackPain","name":"Lumbago"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}