{"formula":"ShengYangYiWeiTang","names":{"pinyin":"sheng yang qi wei tang","hanzi":"升阳益胃汤","english":"raise the yang and augment the stomach decoction","commonEnglish":"Raise the Yang and Augment the Stomach Decoction","aka":["Astragalus and Pinellia Combination"]},"herbs":[{"herb":"HuangQi","dosage":"12-60g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, promotes urination, reduces edema and relieves numbness and pain.","With Ren Shen or Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Bai Zhu and Fang Feng, for Wei Qi Deficiency with spontaneous sweat."]},{"herb":"ZhiBanXia.htm","dosage":"6-30g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools.","With Ren Shen, for vomiting due to Stomach Deficiency."]},{"herb":"RenShen","dosage":"9-30g","actions":["Tonifies Spleen and Stomach and Lung Qi and tonifies Qi in Deficiency patients with Exterior conditions."]},{"herb":"DangShen","dosage":"(10g)","actions":["(Substitutes for Ren Shen)"]},{"herb":"GanCao","dosage":"3-30g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ren Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi.","With Bai Shao, for moderates spasms and alleviates pain, for painful spasms of the leg or abdomen.","(With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.)"]},{"herb":"DuHuo","dosage":"6-15g","actions":["Dispels Wind-Dampness, alleviates pain, releases the Exterior and disperses Wind-Cold-Dampness.","With Fang Feng, for numbness in the legs.","with Qiang Huo, for joint pain and numbness."]},{"herb":"FangFeng","dosage":"6-15g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness, relieves diarrhea, stops bleeding and alleviates pain.","With Chen Pi, Bai Shao and Bai Zhu, for diarrhea with abdominal pain."]},{"herb":"BaiShao","dosage":"6-15g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Fang Feng, Bai Zhu and Chen Pi, for painful diarrhea and borborygmus.","With Huang Qi and Ren Shen, restrains sweating from Deficiency.","With Huang Qi, Ren She and Bai Zhu, for menstrual disorders with Qi Deficiency signs such as fatigue, weakness and pale, scanty menstrual Blood."]},{"herb":"QiangHuo","dosage":"6-15g","actions":["Releases the Exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"ChenPi","dosage":"6-12g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, descends Qi, dries Dampness and transforms Phlegm and helps prevent Stagnation from tonic herbs.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi and Cold-Dampness Obstructing the Middle with nausea and hiccups.","With Bai Zhu, Fang Feng and Bai Shao, for borborygmus, abdominal pain and diarrhea due to Liver Attacking the Spleen.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Fu Ling and Zhi Ban Xia, for Cough due to accumulation of Dampness and Phlegm."]},{"herb":"FuLing","dosage":"10-12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools.","With Zhi Bai Xia, Bai Zhu and Chen Pi, for congested fluids in the Stomach causing nausea and vomiting."]},{"herb":"ChaiHu","dosage":"6-9g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi, relieves Stagnation and raises Yang Qi.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Bai Shao, Ren Shen and Bai Zhu, fortifies Qi.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi."]},{"herb":"ZeXie","dosage":"6-9g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Zhi Ban Xia, for Turbid Dampness in the Middle Jiao causing epigastric and abdominal distention.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"BaiZhu","dosage":"9-10g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating.","With Huang Qi and Fang Feng, for spontaneous sweat with aversion to Wind due to Wei Qi Deficiency.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"HuangLian","dosage":"3g","actions":["Clears Heat, drains Dampness and drains Stomach Fire.","With Zhi Ban Xia, for Cold and Heat in the Middle Jiao with abdominal fullness, nausea and vomiting."]},{"herb":"ShengJiang","dosage":"6g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting, warms the Lungs, stops cough, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Da Zao, for External Wind-Cold.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold and a productive cough due to Phlegm-Dampness."]},{"herb":"DaZao","dosage":"6g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, Fu Ling and Bai Shao, for weakness and lassitude due to Spleen and Stomach Deficiency.","With Sheng Jiang, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen; prevents tonics from generating Dampness in the Middle Jiao; prevents Phlegm accumulation; nourishes the Blood and prevents injury from harsh Blood movers; assists the movement of Qi and enhances the effects of other Qi and Blood tonifying herbs by facilitating their digestion and absorption."]}],"actions":["Strengthens the Spleen","Tonifies Qi","Raises Yang","Leaches out Dampness","Dispels Wind and Dampness"],"syndromes":["Spleen and Stomach Qi Deficiency with Damp-Heat flowing into the Lower Jiao","Spleen and Stomach Qi Deficiency with and Attack of Wind-Dampness"],"manifestations":{"symptoms":["Loss of taste","Anorexia","Abdominal fullness and distention","Irregular bowel movements","Fatigue","Lethargy","A sensation of heaviness in the body","Joint pain","Chills","Aversion to Wind","A stuffy nose with mucus","Sweating","Sore limbs","Dizziness","Tinnitus","Scanty, dark urination","Frequent urination","Leukorrhea","Borborygmus","A shiny, pale complexion","A dry mouth and tongue","A bitter taste in the mouth"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Floating, large and slow or Slippery and empty"},"conditions":[{"name":"Chronic inflammatory bowel disease"},{"condition":"Gastritis","name":"Atrophic gastritis"},{"condition":"Cholecystitis","name":"Chronic cholecystitis"},{"name":"Chronic pelvic inflammatory disease"},{"name":"Pulmonary tuberculosis"},{"condition":"Emphysema","name":"Emphysema complicated pulmonary infection"},{"name":"Irritable bowels "},{"condition":"VaginalDischarge","name":"Vaginal discharge"},{"condition":"Anorxia","name":"Anorexia"},{"name":"Inflammatory disease"},{"condition":"Fever","name":"Fever of unknown origin"},{"condition":"Gingivitis","name":"Periodontal disease"},{"condition":"Urticaria","name":"Urticaria"},{"condition":"Gastroenteritis","name":"Chronic gastroenteritis"},{"condition":"ChronicPancreatitis","name":"Chronic pancreatitis"},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Tinnitus","name":"Tinnitus"},{"condition":"Fatigue","name":"Fatigue"}],"contra":{"contraindications":["Contraindicated for those who have Excess Dampness without Middle Jiao Qi Deficiency.","Poria Fu Ling and Rz. Alismatis Ze Xie must be removed unless there obstruction of the Lower Jiao symptoms such as in painful urinary dysfunction."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"diarrhea with perianal burning due to Damp-Heat in the Large Intestine","modifications":[{"herb":"QiangHuo","modification":"- Rz. et Rx. Notopterygii"},{"herb":"HuangQin","modification":"+ Rx. Scutellariae"},{"herb":"HuangLian","modification":"- Rz. Coptidis"}]},{"purpose":"body aches that are not serious","modifications":[{"herb":"DuHuo","modification":"- Rx. Angelicae Pubescentis"}]},{"purpose":"patterns without a dry mouth","modifications":[]},{"purpose":"normal urination","modifications":[{"herb":"FuLing","modification":"- Poria"}]},{"purpose":"fever due to Qi and Blood Deficiency with Damp-Heat","modifications":[{"herb":"ZeXie","modification":"- Rz. Alismatis"},{"herb":"DuHuo","modification":"- Rx. Angelicae Pubescentis"},{"herb":"QiangHuo","modification":"- Rz. et Rx. Notopterygii"},{"herb":"FangFeng","modification":"- Rx. Saposhnikoviae"},{"herb":"ChenPi","modification":"- Per. Citri Reticulatae"}]}]}