{"formula":"ShenXiaoGuaLouSan","names":{"pinyin":"shen xiao gua lou san","hanzi":"神效栝楼散","english":"spirit","commonEnglish":"Spirit-Like Effect Trichosanthis Powder","aka":[""]},"herbs":[{"herb":"GuaLou","dosage":"9-30g","actions":["Transforms Hot Phlegm, reduces abscesses, dissipates nodules and eliminates pus.","With Ru Xiang, invigorates Qi and Blood to disperse swellings and clumps and treat puerperal breast disorders with accumulation, Stagnation, distention and pain such as insufficient lactation from obstruction or early-stage breast abscess With Ru Xiang and Mo Yao, for Lung abscess marked by irritability, stifling sensation in the chest, and coughing up of pus and blood."]},{"herb":"GanCao","dosage":"6-14g","actions":["Clears Heat, resolves Phlegm and relieves Fire toxicity."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"RuXiang","dosage":"3-15g","actions":["Invigorates the Blood, promotes the movement of Qi, reduces swelling, generates flesh and alleviates pain.","With Mo Yao, for chronic, ulcerated and non-healing sores."]},{"herb":"MoYao","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, reduces swelling, generates flesh and promotes healing.","With Ru Xiang, for swollen, painful sores and sores that are hard but not painful."]}],"actions":["Reduces abscesses","Dissipates nodules","Eliminates pus","Clears Heat","Relieves Fire toxicity","Tonifies, invigorates and harmonizes the Blood","Alleviates pain"],"syndromes":["Toxic sores"],"manifestations":{"symptoms":[],"tongue":"Suppurative Stage: Discharge of pus from the breast Gradual return of normal body temperature Relief from severe aversion to Cold Relief from fever Disappearance of swelling and pain Gradual healing of the superficial lesions May still be redness of the breast with pain * If there are lesions, there may be a thick, yellowish exudate with itch around the affected (this is a sign of healing) *If there are multiple lesions with heartburn, nausea and vomiting, recovery may be difficult * If there are ulcerous lesions surrounded by dark flesh with pain radiating to the Heart and a thin, weak constitution, the condition may be critical  Pink C: Thin and yellow P: Rapid or Weak"},"conditions":[{"condition":"Mastitis","name":"Mastitis"},{"condition":"BreastCancer","name":"Breast cancer "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Take as a decoction with one teacup of aged wine."],"modifications":[{"purpose":"the initial stage of mastitis","modifications":[{"herb":"QingPi","modification":"+ Per. Citri Reticulatae Viride"},{"herb":"DangShen","modification":"+ Rx. Codonopsis"}]},{"purpose":"the suppurative stage of mastitis as an alternative to surgery","modifications":[{"herb":"XiaKuCao","modification":"+ Spica Prunella"},{"herb":"ChuanShanJia","modification":"+ Squama Manitis"},{"herb":"HuangQi","modification":"+ Rx. Astragali"}]}]}