{"formula":"ShengYangShengShiTang","names":{"pinyin":"sheng yang sheng shi tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat, raises Yang Qi and resolves Phlegm and congestion.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","with Qiang Huo and Fang Feng, for Spleen Deficiency Dampness.","With Huang Qi and Sheng Ma, for Central Qi Sinking."]},{"herb":"QiangHuo","dosage":"3-10g","actions":["Releases the Exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Fang Feng, for pain due to External Wind-Dampness.","With Du Huo, for Wind-Dampness.","With Cang Zhu, for a heavy-headed sensation."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Sheng Ma,raises the Yang Qi of the Spleen, allowing turbid Yin to descend and be eliminated, treating chronic diarrhea, a dragging sensation in the abdomen, fatigue, shortness of breath, uterine bleeding and prolapses."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, promotes urination, reduces edema and relieves numbness and pain."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Cang Zhu, for Wind-Cold-Dampness with chills, anhidrosis, headache, heavy head, lethargy, heavy limbs and stifling fullness in the chest and abdomen, pain due to Wind-Dampness Bi with aching joints, heavy limbs and generalized aching discomfort and diarrhea due to Wind-Cold in patients with Spleen Dampness.","With Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi."]},{"herb":"ShengMa","dosage":"3-9g","actions":["Releases the Exterior, raises Yang and lifts sunken Qi.","With Chai Hu, for chronic dysenteric disorders, rectal prolapse and uterine prolapse due to Yang Deficiency.","With Dang Gui, raises the clear Qi, allowing turbidity to descend.","With Chai Hu and Huang Qi, for prolapse of internal organs."]},{"herb":"DuHuo","dosage":"3-10g","actions":["Dispels Wind-Dampness, releases the Exterior, disperses Wind-Cold-Dampness and alleviates pain.","With Fang Feng, for numbness in the legs.","With Qiang Huo, for Joint pain and numbness.","With Qiang Huo, Gao Ben and Fang Feng, for Wind-Cold-Dampness with headaches, chills and fever and muscle and joint pain.",""]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses and disperses Cold.","With Huang Qi, for Qi and Blood Deficiency.","With Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"GaoBen","dosage":"2-10g","actions":["Expels Wind and Cold, dispels Wind-Dampness and alleviates pain.","With Cang Zhu, for abdominal pain due to Cold and Dampness.","With Qiang Huo, for headaches and stiffness of the nape of the neck due to Wind-Dampness in the Du channel.","With Fang Feng and Qiang Huo, for External Wind-Cold-Dampness."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Harmonizes and Tonifies Qi and Blood","Expels Wind-Cold-Dampness","Disperses Internal Dampness"],"syndromes":["Wind-Cold-Dampness with Qi and Blood Deficiency"],"manifestations":{"symptoms":["Vaginal discharge","Bones and joints sore and painful","Worse with movement","Face is dull yellow","Spasms or contractures of muscles and sinews","Palpitations","Asthenia","Shortness of breath","Spontaneous sweating","Weight loss","Poor appetite","Diarrhea"],"tongue":"Pale","tongueCoat":"None or White","pulse":"Soggy and Weak or Thin and faint"},"conditions":[{"condition":"VaginalDischarge","name":"Vaginal discharge"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}