{"formula":"ShengDiFang","names":{"pinyin":"sheng di fang","hanzi":"生地方","english":"rehmannia formula","commonEnglish":"Rehmannia Formula","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"9g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"BaiMaoGen","dosage":"30g","actions":["Cools the Blood and stops bleeding.","With Shi Gao, for later stages of a Warm febrile disease with remnants of fever, thirst and dark urine.","With Sheng Di Huang, cools the Blood, draws out toxicity and reduces searing Heat for Ying Stage Heat with fever, thirst, a scarlet tongue and rashes and bleeding due to Heat in the Blood."]},{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat, resolves Fire toxicity and vents and disperses External Wind-Heat.","With Gan Cao, for toxic swellings and sores."]},{"herb":"PuGongYing","dosage":"15g","actions":["Reduces abscesses, dissipates nodules and relieves Fire toxicity."]},{"herb":"DiFuZi","dosage":"30g","actions":["Expels Dampness, stops itching and clears Wind-Heat.","With Sheng Di Huang and Bai Xian Pi, for Damp-Heat or Wind-Heat causing eczema and itching."]},{"herb":"ChanTui","dosage":"6g","actions":["Disperses Wind, clears Heat, vents rashes and relieves itching.","With Jing Jie, Fang Feng and Ku Shen, for weepy red skin lesions in patients with pre-existing Damp-Heat."]},{"herb":"JingJie","dosage":"6g","actions":["Releases the Exterior, expels Wind, vents rashes, relieves itching and stops bleeding.","With Chi Xiao Dou, clears heat, promotes the flow of Blood, reduces rashes and alleviates itching for itchy Wind-Rashes and swollen, toxic sores."]},{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Jing Jie, expels Wind and stops itching, for pruritic rashes.","With Jing Jie and Chan Tui, for dermatological disorders with rashes, irritability and itching."]},{"herb":"ChiXiaoDou","dosage":"30g","actions":["Clears Damp Heat, disperses Blood Stasis, reduces swelling, reduces Fire toxicity and dispels pus."]},{"herb":"GanCao","dosage":"9g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Expels Wind","Clears Heat"],"syndromes":["Wind-Heat"],"manifestations":{"symptoms":["Severe itching","Red wheals","Worse with exposure to Heat","A burning sensation on the skin surface","Intense itching","Aversion to Wind"],"tongue":"Red tip","tongueCoat":"Thin and yellow","pulse":"Superficial and rapid"},"conditions":[{"condition":"Urticaria","name":"Papular urticaria"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe Heat","modifications":[{"herb":"ShiGao","modification":"+ 30g Gypsum Fibrosum"},{"herb":"NiuBangZi","modification":"+ 9g Fr. Arctii"}]},{"purpose":"intense itching","modifications":[{"herb":"BaiXianPi","modification":"+ 12g Cx. Dictamni"},{"herb":"CangErZi","modification":"+ 9g Fr. Xanthii"}]}]}