{"formula":"ShenJinGuiZhiShaoYaoZhiMuTang","names":{"pinyin":"shen jin gui zhi shao yao zhi mu tang","hanzi":"伸筋桂枝芍藥知母湯","english":"lycopodium, cinnamon twig, peony and anemarrhenae decoction","commonEnglish":"Lycopodium, Cinnamon Twig, Peony and Anemarrhena Decoction","aka":["Bamboo Pearls"]},"herbs":[{"herb":"ShenJinCao","dosage":"6-15g","actions":["Dispels Wind, eliminates Dampness, relaxes the sinews, invigorates the collaterals and invigorates the Blood."]},{"herb":"SangJiSheng","dosage":"9-30g","actions":["Tonifies Liver and Kidney Yin, strengthens the sinews and bones and expels Wind-Dampness."]},{"herb":"WuJiaPi","dosage":"4.5-15g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys, strengthens sinews and bones, transforms Dampness and reduces swelling."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals, relieves pain, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang, warms and facilitates the flow of Yang Qi in the chest, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels, warms the Middle and descends Turbid Yin.","With Bai Shao, expels External Wind-Cold and warms and tonifies the Middle Jiao.","With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Fang Feng and Bai Zhu, for Painful diarrhea and borborygmus.","With Gui Zhi, harmonizes the Ying and Wei."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire from the Lungs and Stomach, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst.","With Gan Cao, regulates Cold and Heat, harmonizes the Exterior and Interior and treats malarial diseases with Tai Yin turbid Dampness fuming upward."]},{"herb":"ShengJiang","dosage":"3-10g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting, warms the Lungs, stops cough, adjusts the Ying and Wei, normalizes the flow of Qi at the center and reduces the toxicity of the other herbs.","With Gui Zhi, strongly induces sweating for External Wind-Cold with chills, fever, body aches and anhidrosis and warms and dispels thin mucus in the Stomach for nausea, hiccup, Stomach pain, acid reflux and/or vomiting of clear fluid."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, Dries Dampness and promotes water metabolism."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness, expels Internal Wind, stops spasms, relieves diarrhea, stops bleeding and alleviates pain."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Bai Zhu, for Wind-Damp Bi and Spleen Yang Deficiency with a cold, painful abdomen, vomiting and watery diarrhea."]},{"herb":"DiLong","dosage":"4-15g","actions":["Clears Heat and unblocks and promotes movement in the channels and collaterals."]},{"herb":"GanCao","dosage":"3-14g","actions":["Tonifies Qi, moistens the Lungs, resolves Phlegm, stops cough, clears Heat, relieves Fire toxicity, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]}],"actions":["Alleviates pain in the joints and extremities","Dispels Wind-Damp","Warms the channels","Dispels Stagnation","Opens blocked collaterals","Calms the Shen","Clears Heat","Nourishes Yin","Clears Yin Deficiency Heat"],"syndromes":["Wind-Dampness with Yin Deficiency Heat"],"manifestations":{"symptoms":["Inflammation, swelling, pain, numbness and degeneration in the joints, sinews, and connective tissues","Dizziness","Tinnitus or deafness","Poor memory","Aching, soreness or weakness of the low back","Spermatorrhea or","Premature ejaculation","Aching in the bones","Aching in the leg and heel","Dry mouth","Thirst","Night sweats","Five Sole Heat","Malar flush","Low grade fever in the afternoon","Dry throat, maybe recurrent sore throat","Dry stools and/or","Constipation","Urine short and red","Heightened libido","Maybe insomnia","Maybe frequent dreams","Maybe blurred vision"],"tongue":"Red or Pink or Pale","tongueCoat":"Little or None or Thin and white or Greasy and white","pulse":"Thready and rapid or Superficial and tight or Wiry and tight or Slow, moderate and soft"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}