{"formula":"ShengFaLing","names":{"pinyin":"sheng fa ling","hanzi":"生发灵","english":"efficacious remedy for generating hair","commonEnglish":"Efficacious Remedy for Generating Hair","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"39g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis.","With Huang Qi, for many Blood Deficiency patterns.","With Tao Ren and Hong Hua, for pain and swelling and other symptoms associated with Blood Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Tao Ren, Hong Hua, Chi Shao and Chuan Xiong, for Blood Deficiency and Stagnation."]},{"herb":"ChiShao","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain.","With Chuan Xiong and Dang Gui, for abscesses and boils."]},{"herb":"ChuanXiong","dosage":"30g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"TaoRen","dosage":"20g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"HongHua","dosage":"20g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"HeShouWu","dosage":"60g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood, nourishes Jing and expels Wind from the skin by nourishing the Blood."]},{"herb":"HeiDou","dosage":"30g","actions":["Tonifies the Kidneys, nourishes the skin and muscles and nourishes Blood and Jing."]},{"herb":"HuangQi","dosage":"30g","actions":["Promotes urination, reduces edema, promotes the discharge of pus, generates flesh and expels toxins."]},{"herb":"ShiChangPu","dosage":"20g","actions":["Promotes Blood flow and reduces swelling and sores."]}],"actions":["Frees the orifices","Invigorates the Blood"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Headache or a stabbing pain in the scalp precedes alopecia","Sudden patches of hair loss","May persist to develop into complete baldness","Frequent nightmares","Difficulty falling asleep","Restlessness with a feverish sensation","Grinding of the teeth"],"tongue":"Dark red or Stasis marks","tongueCoat":"Little"},"conditions":[{"condition":"Alopecia","name":"Alopecia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}