{"formula":"ShenXiDan","names":{"pinyin":"shen xi dan","hanzi":"神犀丹","english":"magical rhinoceros special pill","commonEnglish":"Magical Rhinoceros Special Pill","aka":["Spirit-Like Rhinoceros Horn Elixir"]},"herbs":[{"herb":"XiJiao","dosage":"180g","actions":["Clears Heat from the Ying and Xue stages,","relieves Fire toxicity, cools the Blood, clears skin blotches, stops bleeding, calms the Shen and arrests tremors.","With Sheng Di Huang, for loss of consciousness and delirium, with epistaxis, hematemesis, or purpura due to Blood Heat."]},{"herb":"ShuiNiuJiao","dosage":"(450g)","actions":["(Substitutes for Xi Jiao.)"]},{"herb":"ShengDiHuang","dosage":"450","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan Shen and Xi Jiao, for Heat in the Ying Stage."]},{"herb":"JinYinHua","dosage":"450","actions":["Clears Heat, resolves Fire toxicity and vents and disperses External Wind-Heat.","With Lian Qiao, for various Heat disorders.","With Lian Qiao and Ban Lan Gen, for throat soreness and swelling."]},{"herb":"LianQiao","dosage":"300g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity and Clears Blood Heat.","With Jin Yin Hua, for initial-stage Wind-Heat."]},{"herb":"BanLanGen","dosage":"270g","actions":["Drains Heat, relieves Fire toxicity, cools the Blood and benefits the throat."]},{"herb":"HuangQin","dosage":"180g","actions":["Cools the Blood, stops bleeding, clears Heat, dries Dampness, drains Fire and detoxifies.","With Jin Yin Hua and Tian Hua Fen, for boils, carbuncles and furuncles.","With Dan Dou Chi, for eye redness and pain."]},{"herb":"ShiChangPu","dosage":"180g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, promotes Blood flow, reduces swelling, alleviates Wind-Damp Bi and sores and benefits the throat."]},{"herb":"DanDouChi","dosage":"240g","actions":["Releases the Exterior, eliminates irritability, harmonizes the Middle Jiao and relieves stuffy sensations in the chest."]},{"herb":"TianHuaFen","dosage":"120g","actions":["Drains Heat, generates Fluids, clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus and reduces swelling."]},{"herb":"XuanShen","dosage":"210g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Sheng Di Huang, Xi Jiao and Lian Qiao, for Ying Stage Heat.","With Sheng Di Huang, for late-stage febrile disease with irritability, thirst and constipation."]},{"herb":"ZiCao","dosage":"120g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins and encourages rashes.","With Shui Niu Jiao, Sheng Di Huang and Jin Yin Hua, for Heat toxin, delirious speech and deep-purple rashes."]}],"actions":["Clears Heat","Opens the Orifices","Cools the Blood","Resolves toxicity"],"syndromes":["Epidemic Summerheat","Febrile diseases entering the Ying and Xue Stages causing depletion of Body Fluids"],"manifestations":{"symptoms":["High fever with agitation","Purple-black rashes","Hemoptysis","Epistaxis","Clouded Spirit","Delirious raving","Sores in the mouth and throat","Red eyes","Irritability","Restlessness","Severe: Convulsions of the four limbs Opisthotonis Phlegm gurgling in the throat"],"tongue":"Crimson","tongueCoat":"Charred","pulse":"Forceful and rapid"},"conditions":[{"condition":"Epistaxis","name":"Epistaxis"},{"condition":"Hemoptysis","name":"Hemoptysis"},{"condition":"Fever","name":"Fever"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}