{"formula":"ShenFuZaiZaoWan","names":{"pinyin":"shen fu zai zao wan","hanzi":"人附再造囊","english":"ginseng and aconite pills for a new lease on life","commonEnglish":"Ginseng and Aconite Pills for a New Lease on Life","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"9g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions.","With Huang Qi, for Qi Deficiency with general debility, anorexia and spontaneous sweat."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Restores Devastated Yang, rescues from rebellion, warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Ren Shen, for severe Deficiency of Source Qi and Collapse of Yang with cold extremities, sweating, weak breathing, dizziness and an extremely pale complexion.","With Huang Qi, for spontaneous sweating and chills due to Yang Deficiency.","With Xi Xin, disperses Cold and stops pain for Cold damage both Internal and External with aversion to Cold, headache and generalized body aches with aching joints."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, unblocks Yang and transforms Qi.","With Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei, with spontaneous sweating, fever and chills.","With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi.","With Chuan Xiong, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves the discomfort of painful obstruction."]},{"herb":"HuangQi","dosage":"20g","actions":["Tonifies Qi and Blood, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs and relieves numbness and pain.","With Gui Zhi, for Qi and Blood Deficiency and Ying and Wei Deficiency with numbness and painful obstruction of the musculature.","With Zhi Fu Zi and Sheng Jiang, for profuse perspiration and extreme fatigue due to Yang Deficiency."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Xi Xin and Fang Feng, for Wind-Cold headaches."]},{"herb":"FangFeng","dosage":"10g","actions":["Releases the Exterior and expels External Wind.","With Huang Qi, prevents Wind from entering the skin.",""]},{"herb":"QiangHuo","dosage":"8g","actions":["Releases the Exterior and disperses Cold.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"XiXin","dosage":"3g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Chuan Xiong, for Shao Yin Cold headaches.","With Qiang Huo, Fang Feng and Gui Zhi, for Wind-Cold-Damp Bi pain.","With Qiang Huo, Fang Feng and Chuan Xiong, for Wind-Cold."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin and adjusts the Ying and Wei.","With Huang Qi and Ren Shen, restrains sweating from Deficiency.","With Gui Zhi, Sheng Jiang and Da Zao, for Wind-Cold with Deficiency and perspiration."]},{"herb":"ShengJiang","dosage":"3g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, adjusts the Ying and Wei, stops vomiting and reduces the toxicity of other herbs.","With Da Zao, for External Wind-Cold.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis.","With Gui Zhi and Da Zao, harmonizes the Ying and Wei to drive out pathogens."]},{"herb":"DaZao","dosage":"3g","actions":["Tonifies the Spleen and Stomach, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Supports Yang","Clears the Exterior"],"syndromes":["Yang Deficiency with External Wind-Cold"],"manifestations":{"symptoms":["Strong chills or shivering","Possible mild fever","Chronic aversion to Cold","A desire to curl up","Exhaustion","Headaches","General muscle pain","Anhidrosis or","Spontaneous sweating","When there is sweating, the aversion to Cold is more pronounced","Aching in the bones","A low, soft voice","Reluctance to speak","Waxy, pale complexion","Cold body and limbs","There may be an exposure to Wind or Cold prior to the aggravation of the symptoms"],"tongue":"Pale and swollen","tongueCoat":"White","pulse":"Deep and weak"},"conditions":[{"condition":"CommonCold","name":"Common cold in the elderly"},{"condition":"Perspiration","name":"Spontaneous perspiration"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}