{"formula":"ShenShengFuZiTang","names":{"pinyin":"shen sheng fu zi tang","hanzi":"參升 附子湯","english":"ginseng, cimicifuga and prepared aconite decoction","commonEnglish":"Ginseng, Cimicifuga and Aconite Prepared Decoction","aka":[""]},"herbs":[{"herb":"ZhiFuZi","dosage":"9g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang, and disperses Cold for overabundance of Yin fluids due to Deficiency Cold.","With Ren Shen, for severe Deficiency of the Source Qi and Collapse of Yang.","With Huang Qi, for spontaneous sweat and chills due to Yang Deficiency.","With Xi Xin, disperses Cold and stops pain."]},{"herb":"GanJiang","dosage":"9g","actions":["Warms the Lungs, transforms thin mucus, warms the Middle, expels Cold and dispels Wind-Dampness seeping into the Lower Jiao.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Ren Shen and Zhi Ban Xia, for vomiting due to Deficiency Cold."]},{"herb":"FangFeng","dosage":"15g","actions":["Expels Wind-Dampness and alleviates pain.","With Huang Qi, prevents Wind from entering the skin."]},{"herb":"YuLiRen","dosage":"15g","actions":["Moistens the Intestines, unblocks the bowels, promotes urination and reduces edema."]},{"herb":"RenShen","dosage":"15g","actions":["Powerfully tonifies Yuan Qi and tonifies Lung Qi.","With Huang Qi, for Lung Qi Deficiency."]},{"herb":"DangGui","dosage":"18g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, regulates the menses, stops cough and treats dyspnea.","With Huang Qi, for Qi and Blood Deficiency.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Ju Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with cough, wheezing, nausea marked by profuse and salty sputum."]},{"herb":"ZhiBanXia.htm","dosage":"21g","actions":["Dries Dampness transforms Phlegm and harmonizes the stomach.","With Gan Jiang, for vomiting due to Cold with copious, frothy sputum with Cold signs and thin mucus in the Lungs.","With Ren Shen, for vomiting due to Stomach Deficiency.","With Huang Lian, for Cold and Heat in the Middle Jiao with abdominal fullness, nausea and vomiting."]},{"herb":"ShengMa","dosage":"21g","actions":["Releases the Exterior, clears Heat, relieves toxicity, raises Yang and lifts sunken Qi.","With Huang Lian, for ulcers of the gums and mouth with bad breath."]},{"herb":"GanCao","dosage":"24g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, stops cough, Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"GaoBen","dosage":"24g","actions":["Expels Wind and Cold Dispels Wind-Dampness and alleviates pain.","With Xi Xin, for Wind-Cold-Damp headache, vertex headaches, stiff neck and toothaches.","With Chuan Xiong and Xi Xin, for headache due to Cold and Dampness."]},{"herb":"ChaiHu","dosage":"30g","actions":["Harmonizes the Exterior and Interior, spreads Liver Qi, relieves Stagnation, raises Yang Qi and resolves Phlegm and congestion.","With Zhi Ke, for a stifling sensation in the chest, abdominal pain, poor appetite, and irregular bowel movements.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi, Sheng Ma and Ren Shen, for Central Qi Sinking."]},{"herb":"ShuGuiHua","dosage":"15g","actions":["Moistens the skin, astringes, protects mucous membranes, expels Phlegm, cools Heat, reduces inflammation, detoxifies, activates the Blood in the Lower Jiao and alleviates pain."]},{"herb":"ChenPi","dosage":"15g","actions":["Circulates Qi, disperses knots, and stops pain."]},{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, aids circulation of moisture downward from the face, promotes urination and reduces edema."]},{"herb":"ShuDiHuang","dosage":"6g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and arrests cough and wheezing.","With Ren Shen, for Qi, Blood and Yin Deficiency."]},{"herb":"HuangBai","dosage":"9g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Kidney Fire and relieves Fire toxicity.","With Xi Xin, for urinary frequency, urgency, discomfort, and pain."]},{"herb":"HuangLian","dosage":"9g","actions":["Clears Heat, drains Dampness and resolves Fire toxicity.","With Zhi Ban Xia and Gan Jiang, for Cold and Heat complexes in the Intestines and Stomach marked by focal distention, nausea, vomiting and feelings of oppression in the chest.","With Xi Xi, for Swollen eyes and deafness."]},{"herb":"ZhiKe(Qiao)","dosage":"9g","actions":["Promotes the movement of Qi and reduces distention and pressure.","With Sheng Ma, relaxes the bowels and encourages the downward flow of turbid Yin."]},{"herb":"XiXin","dosage":"6g","actions":["Expels Wind and Cold, warms the Lungs, transforms Phlegm and Thin Mucus and circulates water."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Xi Xin, for Shao Yin Cold headache."]},{"herb":"ManJingZi","dosage":"9g","actions":["Drains Dampness, expels Wind, clears Heat and relieves pain.","With Ren Shen and Huang Qi, for eye disease, tinnitus, dizziness, and deafness due to Deficiency.","With Gao Ben, for severe headache without Interior Fire."]}],"actions":["Warms Yang","Expels Cold","Strengthens the Lungs","Tonifies the Kidneys","Clears Heat","Expels Dampness","Activates the Blood","Circulates Qi"],"syndromes":["Kidney Overacting on the Lung"],"manifestations":{"symptoms":["White vaginal discharge","Great pain in the vagina radiating to the Heart","Soot Black complexion","Testicular contraction sending pain to the cardiac or abdominal region","Lower back pain","Upper back pain","Chest pain","Frequent sneezing","Drooling","Lacrimation","Incessant runny nose with turbid mucus","Nasal polyps with inability to smell","Cough with Phlegm and foam","Fire-like Heat above and icy Cold below","Intermittent headache","Fire in the eyes","Blurred vision","Tinnitus","Deafness","Aversion to Wind-Cold","Likes the sun","Troubled sleep","Constant sensation of choking","Obstructed diaphragm and throat","Loss of sense of taste","Acute contraction and pain of the flanks","Loose teeth with inability to chew","Genital sweating and Cold","Eyes awry","Difficulty attending to daily activities","Cold palms","Wind Bi insensitivity","Frequent urination with copious discharge in the morning","Scant urination at night","Shortness of breath","Asthmatic wheezing","Sudden bowel movements","Reddish-brown complexion","Anorexia","Abnormal urination and defecation","Heart vexation","Sudden turmoil","Counter flow Qi","Rectal pressure","White abdominal skin","Flatulence","Inability to exert abdomen","Borborygmus","Hypertonicity of the sinew below the knee","Great scapular pain"]},"conditions":[{"condition":"VaginalDischarge","name":"Vaginal discharge"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}