{"formula":"ShengXueTangSanHao","names":{"pinyin":"sheng xue tang san hao","hanzi":"盛血湯三号","english":"engender the blood decoction #3","commonEnglish":"Engender the Blood Decoction #3","aka":[""]},"herbs":[{"herb":"BaiHuaSheSheCao","dosage":"40g","actions":["Clears Heat and strongly relieves Fire toxin."]},{"herb":"HuZhang","dosage":"25g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and discharges toxins."]},{"herb":"HuangQi","dosage":"25g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh, expels toxins and generates Body Fluids.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesias.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"NuZhenZi","dosage":"25g","actions":["Nourishes and tonifies the Liver and Kidney Yin and clears Deficiency Heat improves vision.","With Shu Di Huang and Gou Qi Zi, for diminished visual acuity due to Liver and Kidney Yin Deficiency."]},{"herb":"GouQiZi","dosage":"20g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Huang Jing, for consumption with exhausted Jing."]},{"herb":"HuangJing","dosage":"29g","actions":["Tonifies Spleen Qi, nurtures Stomach and Lung Yin, tonifies the Kidneys, strengthens Jing.","With Gou Qi Zi, for Kidney Jing and Liver Yin Deficiency.","With Dang Gui, for Kidney Jing and Blood Deficiency.","With Tai Zi Shen, for Qi and Yin Deficiency."]},{"herb":"DangGui","dosage":"20g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines and unblocks the bowels.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"DangShen","dosage":"20g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia.","With Shu Di Huang and He Shou Wu, for Blood Deficiency."]},{"herb":"TaiZiShen","dosage":"20g","actions":["Strengthens the Spleen, tonifies Qi, generates Body Fluids and treats chronic febrile disorders."]},{"herb":"DanShen","dosage":"20g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"YeJiaoTeng","dosage":"20g","actions":["Nourishes the Heart Yin and Blood and calms the Spirit."]},{"herb":"ShanZhuYu","dosage":"20g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Dang Gui and Shu Di Huang, for night sweats due to Yin Deficiency.","With Huang Qi and Dang Shen, for spontaneous sweating due to Yang or Qi Deficiency."]},{"herb":"BaiZhu","dosage":"20g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating."]},{"herb":"MuDanPi","dosage":"20g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis."]},{"herb":"EJiao","dosage":"15g","actions":["Tonifies the Blood and nourishes and moistens Yin.","With Dang Shen and Dang Gui, for Blood Deficiency with dizziness and palpitations.","With Huang Qi, Dang Gui, Shu Di Huang and Dang Shen, for anemia with Qi Deficiency."]},{"herb":"HeShouWu","dosage":"15g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and nourishes Jing."]},{"herb":"ChenPi","dosage":"15g","actions":["Regulates Qi, adjusts the Middle and dries Dampness.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes Jing and Blood, fills the Marrow, tonifies the Liver and Kidneys and nourishes Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness.","With Mu Dan Pi, for steaming bone disorder, dizziness, and vertigo."]}],"actions":["Tonifies Qi","Nourishes Yin","Nourishes the Blood","Invigorates the Blood","Clears heat","Resolves toxicity"],"syndromes":["Qi and Yin Deficiency"],"manifestations":{"symptoms":["Fatigue","Lack of energy","Shortness of breath","Soft, weak voice","Reluctance to speak","Spontaneous perspiration","Five sole Heat","Dry throat","Persistent thirst","Afternoon fever","Dry stools","Constipation","Scanty, dark-colored urine","Night sweats"],"tongue":"Red or Swollen and scalloped","tongueCoat":"Little or None or White","pulse":"Thready and rapid or Deep, weak, soft and small or Floating"},"conditions":[{"condition":"Anemia","name":"Aplastic anemia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}