{"formula":"ShenZhaoTang","names":{"pinyin":"shen zhao tang","hanzi":"肾沼汤","english":"retention in the kidney decoction","commonEnglish":"Retention in the Kidney Decoction","aka":[""]},"herbs":[{"herb":"GanCao","dosage":"10g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"GanJiang","dosage":"10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao and warms the channels.","With Bai Zhu, for diarrhea due to Spleen Deficiency.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Fu Ling, Gan Cao and Bai Zhu, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]},{"herb":"FuLing","dosage":"10g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Gui Zhi, warms and transforms fluids, unblocks Yang and promotes urination.","With Gui Zhi and Bai Zhu, for Dampness Obstruction causing Lin Syndrome, edema, heaviness of the body and irritability.","with Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"GuiZhi","dosage":"10g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Fu Ling, unblocks Yang and facilitates the removal of congested fluids associated with Yang Deficiency edema.","With Fu Ling, Bai Zhu and Gan Cao, for Phlegm accumulation with dizziness, fullness in the chest and hypochondrium, vertigo and palpitations."]},{"herb":"BaiZhu","dosage":"10g","actions":["Tonifies the Spleen,d augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Gui Zhi, Fu Ling and Gan Cao, for Phlegm Accumulation."]},{"herb":"DuHuo","dosage":"10g","actions":["Dispels Wind-Dampness, disperses Wind-Cold-Dampness, releases the Exterior and alleviates pain."]}],"actions":["Warms Yang","Dispels Cold","Strengthens the Spleen","Warms the Channels","Eliminates Dampness","Relieves pain"],"syndromes":["Accumulation of Cold-Dampness"],"manifestations":{"symptoms":["Chronic cold pain in the lower back and body with a heavy sensation","The lower back region feels Cold to the touch","The pain is a deep, unremitting ache","The pain may be occasionally be severe","Twisting and bending are difficult","The pain is aggravated by cold weather","Lying down provides no improvement","Stiffness which is worse on rainy days","Aversion to Cold","Cold extremities","Sciatica","Copious urination","Extreme heavy sensation in the lower back","Absence of thirst","The pain is better with Heat","Maybe headaches","Nausea","Loose stools","A poor appetite","Maybe general body aches","Spontaneous contracture of the limbs","Maybe a feverish sensation in the upper body","Craves hot drinks and compresses"],"tongue":"Pale","tongueCoat":"White or Greasy and white at the root","pulse":"Deep, thready and moderate or Deep and slow or Moderate or Slippery and slow"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"low back pain with a Cold sensation, edema, clear urine and a pale, swollen tongue due to Kidney Yang Deficiency","modifications":[{"herb":"BuGuZhi","modification":"+ 10g Fr. Psoraliae"},{"herb":"ZhiFuZi","modification":"+ 10g Rx. Aconiti Lateralis Preparata"},{"herb":"CangZhu","modification":"+ 10g Rz. Atractylodis"},{"herb":"DuZhong","modification":"+ 10g Cx. Eucommiae"},{"herb":"ShaRen","modification":"+ 5g Fr. Amomi"}]},{"purpose":"low back pain with a feeling of lassitude in the loins and a deep, weak pulse","modifications":[]},{"purpose":"low back pain with a heavy sensation","modifications":[{"herb":"HanFangJi","modification":"+ 10g Rx. Stephaniae Tetrandrae"}]},{"purpose":"low back pain with a feeling of fullness in the abdomen and a poor appetite","modifications":[]},{"purpose":"low back pain with Qi Deficiency","modifications":[{"herb":"HuangQi","modification":"+ 12g Rx. Astragali"},{"herb":"DangShen","modification":"+ 10g Rx. Codonopsis"}]}]}