{"formula":"ShenMiZhongZiFang","names":{"pinyin":"shen mi zhong zi fang","hanzi":"神秘种子方","english":"mysterious seed formula","commonEnglish":"Mysterious Seed Formula","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Xiang Fu and Yan Hu Suo, for dysmenorrhea."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood,regulates menstruation, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Xiang Fu and Yan Hu Suo, for abdominal pain with menstruation.","With Dang Gui, nourishes Yin and Blood.","With Huang Qin, cools Heat and nourishes the Blood for calming the fetus which is disturbed by Heat.",""]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness and calms the fetus."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for Kidney Yin Deficiency with steaming bones."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and calms the fetus."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Xiang Fu and Dang Gui, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Dang Gui, Chuan Xiong, Bai Shao and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation.",""]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.",""]},{"herb":"ShaRen","dosage":"1.5-7g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, calms the fetus and prevents miscarriage.","With Huang Qin, for a restless fetus due to Heat."]},{"herb":"WuWeiZi","dosage":"1.5-9g","actions":["Tonifies the Kidneys and astringes Jing."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea.","With Sheng Di Huang, Bai Shao and Dang Gui, for headaches due to Blood Deficiency.","With Mu Dan Pi and Sheng Di Huang, for irregular menstruation with Heat in the Blood."]},{"herb":"DengXinCao","dosage":"1.5-4.5g","actions":["Promotes urination, leaches out Dampness and unblocks painful urinary dysfunction."]},{"herb":"DanZhuYe","dosage":"6-16g","actions":["Clears Heat and eliminates irritability."]},{"herb":"DaZao","dosage":"10-30g","actions":["Nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Nourishes Yin","Clears Heat","Regulates Qi","Invigorates the Blood","Eliminates Dampness"],"syndromes":["Kidney Yin Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Long-term infertility","Early menstruation","Possibly a history of late menarche","Irregular periods","Infrequent menstruation","Decreased menses with light colored Blood and no blood clots","Period either scanty or heavy","Prolonged menstrual cycle","Amenorrhea","Loss of libido","Emaciation","Dizziness","Night sweating","Blurred vision","Palpitations","Insomnia","Tinnitus","Hearing loss","A weak lower body","Five sole Heat or","Low-grade fever in the afternoon","Back soreness","Aches and weakness in the waist and legs","Dry mouth","Dry bowl movements","Dry vagina","Cold limbs","A dusky complexion","Dull-pale complexion","Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Red","tongueCoat":"White or Little or None","pulse":"Thready and rapid or Floating and Empty or Choppy or Wiry and choppy"},"conditions":[{"condition":"conditions/Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}