{"formula":"ShenJiaoTangJiaWei","names":{"pinyin":"shen jiao tang jia wei","hanzi":"肾矫汤加味","english":"augmented affected kidneys decoction","commonEnglish":"Augmented Affected Kidneys Decoction","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Bai Zhu, for musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for Damp Cold Painful Obstruction.","With Gan Jiang, for frequent diarrhea due to Spleen and Stomach Deficiency Cold."]},{"herb":"FuLing","dosage":"6g","actions":["Promotes urination,leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"GanJiang","dosage":"9g","actions":["Dispels Wind-Dampness seeping into the Lower Jiao.","With Zhi Fu Zi, for Cold-Damp Bi.","With Fu Ling, Bai Zhu and Zhi Gan Cao, for Cold-Dampness in the Lower Jiao leading to a sense of heaviness and Cold in the lower back."]},{"herb":"ZhiFuZi","dosage":"6g","actions":["Disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang and Zhi Gan Cao, strengthens its actions of fortifying Qi and benefiting the Yang for Cold extremities.","With Bai Zhu, for Wind-Damp Bi.","With Bai Zhu and Fu Ling, for Kidney and Spleen Yang Deficiency with retention of pathogenic water with abdominal pain, which is worse with Cold, urinary difficulty, and deep aching and heaviness in the extremities.","With Ma Huang and Xi Xin, for a Wind-Cold Attack with preexisting Yang Deficiency.","with Xi Xin, for Wind-Damp-Cold Bi with spasms of the joints and intolerable pain.","With Fu Ling, for lower body edema and dysuria."]},{"herb":"DuZhong","dosage":"6g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Scatters Cold","Transforms Dampness"],"syndromes":["Wind-Cold-Damp"],"manifestations":{"symptoms":["Low back pain","The pain is accompanied by Cold and heavy sensations in the low back as if sitting in water and carrying some weight","The sensations are aggravated by col-Damp weather and alleviated by warmth","There may be body heaviness and numbness","The joints may feel sore and inhibited when bending or stretching","No thirst","Loose stools"],"tongue":"Pale","tongueCoat":"Slimy and white","pulse":"Soft and moderate"},"conditions":[{"condition":"LowBackPain","name":"Low back pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Kidney Deficiency","modifications":[{"herb":"SangJiSheng","modification":"+ Hb. Taxilli"},{"herb":"XuDuan","modification":"+ Rx. Dipsaci"}]},{"purpose":"Cold sensations in the low back","modifications":[{"herb":"XiXin","modification":"+ 3g Hb. cum Rx. Asari"}]},{"purpose":"severe heavy sensations in the low back","modifications":[{"herb":"MuGua","modification":"+ Fr. Chaenomelis"}]}]}