{"formula":"ShengHuiTang","names":{"pinyin":"sheng hui tang","hanzi":"升慧汤","english":"promote wisdom decoction","commonEnglish":"Promote Wisdom Decoction","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"18-30g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow."]},{"herb":"SuanZaoRen","dosage":"15g","actions":["Nourishes Heart Yin, tonifies Liver Blood and calms the Spirit.","With Yuan Zhi, balances the contracting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"ShanZhuYu","dosage":"12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, nourishes Liver and Kidney Yin and strengthens Kidney Yang.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"BaiZiRen","dosage":"12g","actions":["Nourishes the Heart, calms the Spirit and astringes Yin Deficiency sweating.","With Suan Zao Ren, strongly quiets the Spirit, calms the emotions, enriches Yin and Blood, stops nightsweats and treats palpitations, irritability and insomnia due to Yin and Blood Deficiency failing to nourish the Heart and Liver.","With Yuan Zhi and Suan Zao Ren, for insomnia and palpitations due to Heart Blood Deficiency."]},{"herb":"FuLing","dosage":"12g","actions":["Quiets the Heart, calms the Spirit and soothes the nerves.","With Shi Chang Pu and Yuan Zhi, for insomnia and palpitations due to Spleen and Heart Insufficiency or Phlegm Obstructing the Heart."]},{"herb":"RenShen","dosage":"9g","actions":["Tonifies Heart Qi and calms the Spirit.","With Shu Di Huang, for Qi, Blood and Yin Deficiency."]},{"herb":"YuanZhi","dosage":"6g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidney, expels Phlegm and opens the Orifices.","With Fu Shen and Suan Zao Ren, for irritability, disorientation, palpitations, anxiety and insomnia due to Heart Blood Deficiency or Qi Stagnation.","With Ren Shen, Fu Shen and Shi Chang Pu, for forgetfulness."]},{"herb":"ShiChangPu","dosage":"6g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit and disperses Wind.","With Yuan Zhi and Fu Shen, for forgetfulness, tinnitus and impaired hearing.","With Ren Shen, Fu Shen and Yuan Zhi, for forgetfulness and dulled senses."]},{"herb":"BaiJieZi","dosage":"6g","actions":["Warms the Lungs, regulates Qi and expels Phlegm."]}],"actions":["Nourishes Kidney Yin","Calms the Shen","Promotes memory"],"syndromes":["Kidney and Heart Yin Deficiency"],"manifestations":{"symptoms":["Insomnia with much dreaming","Spermatorrhea with erotic dreams","Premature ejaculation","Irritability","Easily startled","Restlessness","Palpitations","Anxiety","Panic attacks","Poor memory","Dizziness","Tinnitus","Low back soreness","Legs weak","Tidal fever","Night sweats","Dry mouth and throat","Red cheeks","Five Sole Heat","Urine short and red"],"tongue":"Red","tongueCoat":"Little or None"},"conditions":[{"condition":"Forgetfulness","name":"Forgetfulness"},{"condition":"NightSweats","name":"Night sweats"},{"condition":"Palpitations","name":"Palpitations"},{"condition":"Spermatorrhea","name":"Spermatorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}