{"formula":"ShenZhuYiQiShenShiTang","names":{"pinyin":"shen zhu yi qi shen shi tang","hanzi":"參术益气渗湿汤","english":"codonopsis and atractylodes boost the qi and seep dampness decoction","commonEnglish":"Codonopsis and Atractylodes Boost the Qi and Seep Dampness Decoction","aka":[""]},"herbs":[{"herb":"YiYiRen","dosage":"18g","actions":["Strengthens the Spleen, resolves Dampness and expels Wind-Dampness.","With Bai Zhu, for Spleen Deficiency with Excess Dampness and edema."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao, augments Qi, tonifies the Lungs, nourishes the Blood and promotes the generation of Body Fluids.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Zhi Shi, for Spleen Deficiency with Qi Stagnation with anorexia, epigastric focal distention and fullness.","With Fu Ling and Yi Yi Ren, for Spleen and Stomach Deficiency with Dampness."]},{"herb":"WuJiaPi","dosage":"9g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys and strengthens the sinews and bones."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Dang Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination and leaches out Dampness.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"ZhiShi","dosage":"6g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels and removes Stagnant Food.","With Bai Zhu, for Distention in the epigastrium and abdomen due to Spleen and Stomach Deficiency with Food Stagnation."]},{"herb":"BaiDouKou","dosage":"4.5g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Stomach, warms the Middle Jiao, descends Qi and stops vomiting."]}],"actions":["Warms Yang","Strengthens the Spleen","Benefits Qi","Moves water"],"syndromes":["Spleen Qi Deficiency with Dampness"],"manifestations":{"symptoms":["Dizziness","Headache","Chest oppression","Nausea","Reduced food intake","Short, scanty urination","Slight edema in limbs, especially lower limbs","Maybe anasarca","Maybe abdominal distention","Loose stools","Physical and mental fatigue"],"tongue":"Pale and maybe swollen","tongueCoat":"White and moist","pulse":"Soft and even"},"conditions":[{"condition":"Hypotension","name":"Hypotension"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"more serious orthostatic hypotension and fatigue","modifications":[{"herb":"HuangQi","modification":"+ 15g Rx. Astragali"},{"herb":"BaiShao","modification":"+ 9g Rx. Paeoniae Alba"}]},{"purpose":"persistent loose stools and orthostatic hypotension","modifications":[{"herb":"DangGui","modification":"+ 6g Rx. Angelicae Sinensis"},{"herb":"ShengMa","modification":"+ 6g Rz. Cimicifugae"},{"herb":"ChaiHu","modification":"+ 3g Rx. Bupleuri"}]}]}