{"formula":"ShenFuLongMuTangJiaWei","names":{"pinyin":"shen fu long mu tang jia wei","hanzi":"蔘附龙湯加味","english":"modified ginseng, aconite, dragon bone and oyster shell decoction","commonEnglish":"Modified Ginseng, Aconite, Dragon Bone and Oyster Shell Decoction","aka":[""]},"herbs":[{"herb":"LongGu","dosage":"30g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang.","With Gui Zhi and Bai Shao, for Kidney and Spleen Yang Deficiency."]},{"herb":"MuLi","dosage":"30g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Bai Shao, for anxiety, palpitations, insomnia, and dream disturbed sleep."]},{"herb":"RenShen","dosage":"9g","actions":["Powerfully tonifies Yuan Qi, tonifies Heart Qi and calms the Spirit."]},{"herb":"ZhiFuZi","dosage":"9g","actions":["Restores Devastated Yang ,d rescues from rebellion, warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Ren Shen, for severe Deficiency of the Source Qi and Collapse of Yang with Cold extremities, sweating, weak breathing, dizziness, and an extremely pale complexion.","With Ren Shen and Gui Zhi, for weak Heart Yang with palpitations, shortness of breath, and chest pain."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Gui Zhi, Long Gu and Mu Li, for Yang Deficiency with unstable exterior and muscle layers.","With Long Gu and Mu Li, for spontaneous sweating and night sweats due to Yin Deficiency."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Tao Ren, for Invigorates the Blood for all types of Blood Stagnation."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Tao Ren, for Blood Stasis.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"GanCao","dosage":"4.5g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"GuiZhi","dosage":"4.5g","actions":["Assists the Heart Yang and warms and facilitates the flow of Yang Qi in the chest.","With Long Gu and Mu Li, for irritability and insomnia due to floating Yang in the Upper Jiao and injured Yin in the Lower Jiao due to Heart Yang Deficiency.","With Zhi Gan Cao, for palpitations and shortness of breath due to injured Yang of the chest."]}],"actions":["Returns Yang","Secures desertion","Invigorates the blood","Stems counterflow"],"syndromes":["Yang Deficiency on the Verge of Collapse"],"manifestations":{"symptoms":["Heart pain","Shortness of breath","Great perspiration with dibbling and dripping","Reversal Cold of the four limbs","Bluish-purple nail beds","A somber, white facial complexion"],"tongue":"Dark","tongueCoat":"White","pulse":"Thin, on the verge of expiring"},"conditions":[{"condition":"CoronaryHeartDisease","name":"Coronary Heart disease "},{"condition":"Palpitations","name":"Palpitations"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}