{"formula":"ShengXueRunPiYin","names":{"pinyin":"sheng xue run pi yin","hanzi":"盛血潤皮饮","english":"engender the blood and moisten the skin drink","commonEnglish":"Engender the Blood and Moisten the Skin Drink","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, generates fluids and increases saliva.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Strongly nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies the Lungs, generates Body Fluids and relieves numbness and pain.","With Dang Gui, for Qi and Blood Deficiency."]},{"herb":"TianMenDong","dosage":"12g","actions":["Nourishes Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, nourishes the Kidneys, generates Fluids and resolves Phlegm.","With Mai Men Dong, for a dry cough, thirst and other symptoms due to Yin Deficiency and injured fluids."]},{"herb":"MaiMenDong","dosage":"12g","actions":["Moistens the Lungs and nourishes Yin.","With Huang Qi, Dang Gui and Wu Wei Zi, for irritability due to severe loss of fluids from sweating.","With Sheng Di Huang, for Yin Deficiency with Excess Heat."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines and unblocks the bowels."]},{"herb":"WuWeiZi","dosage":"9g","actions":["Astringes the leakage of Lung Qi, tonifies the Kidneys, astringes Jing and sweat, generates fluids and tonifies Qi.","With Huang Qi, Mai Men Dong and Tian Men Dong, for wasting and thirsting with intense thirst."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies."]},{"herb":"GuaLouRen","dosage":"9g","actions":["Clears Heat, transforms Hot Phlegm and cools and moistens the Lungs."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines and unblocks the bowels.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"ShengMa","dosage":"1.5-4.5g","actions":["Clears Heat, relieves toxicity, raises Yang and lifts sunken Qi.","With Sheng Di Huang, cools Heat in the Lungs and Stomach."]}],"actions":["Tonifies Qi","Invigorates the Blood","Clears Heat","Moistens Dryness","Unblocks the channels"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["Commonly seen during the later stages of the disease","Dry mouth","Parched throat","Abnormal sensations in the eyes","Swollen, distended parotid region with hard to disperse, piercing pain","A dark, stagnant facial complexion","Fixed pain","Purple-red maculopapular skin lesions whose color does not recede when pressed","Joint aching and pain, numbness and insensitivity","Abdominal concretions and accumulations"],"tongue":"Pale red with purple maculae","tongueCoat":"White","pulse":"Thready and choppy"},"conditions":[{"condition":"Sjogren'sSyndrome","name":"Sjogren's syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"marked small joint pain","modifications":[{"herb":"WeiLingXian","modification":"+ 9g Rx. Clematidis"},{"herb":"TuFuLing","modification":"+ 9g Rz. Smilacis Glabrae"},{"herb":"MuGua","modification":"+ 9g Fr. Chaenomelis"},{"herb":"HuZhang","modification":"+ 9g Rz. Polygoni Cuspidati"}]}]}