{"formula":"ShengFaBao","names":{"pinyin":"sheng fa bao","hanzi":"生发宝","english":"generate hair treasure (topical)","commonEnglish":"Generate Hair Treasure","aka":[""]},"herbs":[{"herb":"BaiMaoGen","dosage":"30g","actions":["Clears Heat and cools the Blood."]},{"herb":"RenShen","dosage":"70g","actions":["Tonifies Qi.","With Huang Qi, for Qi Deficiency with general debility, anorexia, and spontaneous sweat."]},{"herb":"ChuanXiong","dosage":"100g","actions":["Invigorates the Blood, promotes the movement of Qi and expels Wind.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiJieZi","dosage":"100g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"RouGui","dosage":"100g","actions":["Disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain.","With Huang Qi and Dang Gui, for Yin-type boils due to Qi and Blood Deficiency especially those that form but do not ulcerate."]},{"herb":"TaoRen","dosage":"200g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"DangGui","dosage":"400g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold and reduces swelling, expels pus and generates flesh topically."]},{"herb":"BuGuZhi","dosage":"400g","actions":["Tonifies and warms Spleen and Kidney Yang and stabilizes Jing."]},{"herb":"DanShen","dosage":"800g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"HuangQi","dosage":"800g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesias.","With Dang Gui and Rou Gui, for flat sores that do not pustulate or ulcers that do not heal."]}],"actions":["Clears Heat","Cools the Blood","Invigorates the Blood","Breaks up Blood Stasis","Promotes the movement of Qi","Tonifies Qi and Blood"],"syndromes":["Qi and Blood Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Alopecia",""]},"conditions":[{"condition":"Alopecia","name":"Alopecia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Steep the ingredients in 40 liters of 75% alcohol for 7-10 days. Strain the dregs and pour the fluid into smaller glass containers. With a cotton ball, rub the fluid onto the areas of alopecia 7-8 time daily."],"modifications":[]}