{"formula":"ShiGuanAiTang","names":{"pinyin":"shi guan ai tang","hanzi":"食管癌汤","english":"decoction for esophageal cancer","commonEnglish":"Decoction for Esophageal Cancer","aka":[""]},"herbs":[{"herb":"QingDai","dosage":"3g","actions":["Drains Lung Heat, resolves Fire toxicity, disperses Stagnation and reduces swelling."]},{"herb":"TaiZiShen","dosage":"6g","actions":["Strengthens the Spleen, tonifies Qi, tonifies the Lungs, generates Body Fluids and treats chronic febrile disorders."]},{"herb":"DanShen","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood, reduces abscesses, nourishes the Blood and calms the Spirit."]},{"herb":"DaiZheShi","dosage":"20g","actions":["Strongly descends rebellious Qi."]},{"herb":"ShiHu","dosage":"9g","actions":["Nourishes Stomach and Lung Yin, clears Heat and generates fluids."]},{"herb":"PiPaYe","dosage":"9g","actions":["Transforms Phlegm, clears Lung and Stomach Heat, descends Lung and Stomach Qi and harmonizes the Stomach.","With Zhi Ban Xia, treats cough and wheezing, alleviates nausea and calms the Stomach."]},{"herb":"JinYinHua","dosage":"20g","actions":["Clears Heat and resolves Fire toxicity."]},{"herb":"ZhiKe(Qiao)","dosage":"6g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"ZhiBanXia.htm","dosage":"3g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, dissipates nodules, reduces Stagnation, treats sores, skin ulcerations and carbuncles and reduces swelling."]},{"herb":"WuMei","dosage":"2.4g","actions":["Astringes leakage of Lung Qi, stops leakage of sweat, stops coughs, generates fluids and alleviates thirst."]},{"herb":"CaoDouKou","dosage":"6g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen.","With Zhi Ban Xia, for Cold Phlegm affecting the chest and diaphragm with vomiting."]},{"herb":"TaoRen","dosage":"6g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses."]},{"herb":"GuYa(DaoYa)","dosage":"15g","actions":["Reduces Food Stagnation, promotes digestion, strengthens, opens the Stomach, harmonizes the Center, strengthens the Spleen and encourages appetite."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Invigorates the Blood","Tonifies Qi","Nourishes Yin"],"syndromes":["Post-operative esophageal cancer"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Choking sensation on swallowing"]},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}