{"formula":"ShiGanMingMuTang","names":{"pinyin":"shi gan ming mu tang","hanzi":"洗肝明目湯","english":"gardenia and vitex combination","commonEnglish":"Gardenia and Vitex Combination","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"1.5g","actions":["Tonifies, invigorates and harmonizes the Blood."]},{"herb":"ChiShao","dosage":"1.5g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood, clears Liver Fire and relieves eye pain.","With Ju Hua and Huang Qin, for redness, pain and swelling of the eyes."]},{"herb":"HuangQin","dosage":"1.5g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies and calms ascending Liver Yang.","With Huang Lian and Zhi Zi, for acute febrile diseases.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]},{"herb":"LianQiao","dosage":"1.5g","actions":["Clears Heat, especially in the Upper Jiao, and relieves toxicity."]},{"herb":"ChuanXiong","dosage":"1.5g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Fang Feng and Jing Jie, for headaches due Wind-Cold Invasion."]},{"herb":"ShengDiHuang","dosage":"1.5g","actions":["Clears Heat, cools the Blood and nourishes Yin."]},{"herb":"ZhiZi","dosage":"1.5g","actions":["Clears Heat, reduces Fire and eliminates irritability."]},{"herb":"FangFeng","dosage":"1.5g","actions":["Releases the Exterior and expels External Wind.","With Jing Jie, for Exterior patterns in any season.","With Bo He and Lian Qiao, for Wind-Heat.","with Qiang Huo, for Wind-Dampness.","with Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi.","With Jing Jie, Lian Qiao and Bo He, for Wind-Heat with red eyes and a sore throat."]},{"herb":"JingJie","dosage":"1.5g","actions":["Releases the Exterior and expels Wind.","With Bo He, disperses Wind in the head.","With Fang Feng and Qiang Huo, for External Wind-Cold with chills, fever and anhidrosis.","With Huang Qin and Ju Hua, for eye inflammation associated with Wind-Heat. With Dang Gui and Chuan Xiong, for itching from Wind due to Blood Deficiency."]},{"herb":"QiangHuo","dosage":"1.5g","actions":["Releases the Exterior and disperses Cold.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Jing Jie and Fang Feng, for occipital headaches from Wind-Cold without perspiration."]},{"herb":"JueMingZi","dosage":"1.5g","actions":["Clears Liver Heat, clears the vision, benefits the eyes, calms the Liver and anchors Liver Yang.","With Chuan Xiong and Jue Ming Zi, for temporal headaches due to Wind-Heat.","With Ju Hua, for hypertension."]},{"herb":"BoHe","dosage":"1.5g","actions":["Disperses Wind-Heat, cools and clears the head and eyes and relieves Stagnation of Liver Qi.","With Jing Jie, for Wind-Heat.","With Ju Hua, for headaches due to Wind-Heat and headaches, pain, redness and swelling of the eyes due to Liver Fire."]},{"herb":"ManJingZi","dosage":"1.5g","actions":["Disperses Wind, clears Heat, dispels Wind-Heat in the Liver channel and clears and benefits the head and eyes.","With Bai Ji Li, for headaches mainly focused around the eyes and dizziness due to Wind-Heat.","With Fang Feng, Ju Hua, Shi Gao and Chuan Xiong, for headaches due to Wind-Heat.","With Bo He, Jing Jie and Ju Hua, for headaches, facial swelling and pain due to Wind-Heat.","With Fang Feng, Ju Hua and Bai Ji Li, for temporal headaches due to Wind-Heat.","With Jing Jie, Fang Feng, Bai Ji Li and Gan Cao, for eye disorders due to Wind-Cold."]},{"herb":"JuHua","dosage":"1.5g","actions":["Disperses Wind, clears Heat, calms the Liver and clears the eyes.","With Fang Feng, for Wind-Heat irritating the Exterior with slight chills, mild fever, headache and itchy eyes.","With Chuan Xiong, for headaches due to Wind-Heat or Liver Yang Rising."]},{"herb":"HuangLian","dosage":"1.5g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Huang Qin and Zhi Zi, for High fever, irritability, dry mouth and throat, and dark urine due to Fire toxin in the three burners.","With Zhi Zi and Shi Gao, for Ying Stage Heat with delirium and loss of consciousness.","With Huang Qi, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease."]},{"herb":"BaiJiLi","dosage":"1.5g","actions":["Calms the Liver, anchors Yang, dredges Liver Qi, disperses Stagnation, dispels Wind-Heat and brightens the eyes.","With Jue Ming Zi, Ju Hua and Gan Cao, for pain, redness, and swelling of the eyes with extensive tearing due to Wind-Heat Invading the Liver Channel."]},{"herb":"JieGeng","dosage":"1.5g","actions":["Opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, for Excess disorders in the Upper Jiao with no disorder in the Lower Jiao."]},{"herb":"GanCao","dosage":"1.5g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ShiGao","dosage":"1.5g","actions":["Clears Heat in the Qi Stage and drains Fire.","With Sheng Di Huang, for excessive Fire with injured fluids."]}],"actions":["Dispels Liver Heat","Brightens vision","Relieves swelling"],"syndromes":["Liver Fire (Yang) Rising"],"manifestations":{"symptoms":["Eye inflammation and pain","Hemophthalmos","Congestion","Abdominal tension","Pain in the cornea","Conjunctival pain","Tension beneath the right hypochondrium","Dizziness","Impaired vision","Night blindness","Tinnitus","Irascibility","Throbbing headache with distended feeling","Flushed face","Blurred vision","Red, dry eyes with feeling of grit in eye","Dry mouth and throat with bitter taste in mouth","Palpitations","Headache","Nervousness","Insomnia with much dreaming","Dry throat","Thirst","Five Sole Heat (palms, soles and center of chest)","Night sweats","Light or late menses or","Amenorrhea"],"tongue":"Red and dry","tongueCoat":"Little or None","pulse":"Thready and wiry or Wiry and rapid (when Yang is Rising and Excess, pulse is forceful) or Thready and rapid when Yang is not prominent"},"conditions":[{"condition":"Nebula","name":"Sclerosing keratitis"},{"condition":"Nebula","name":"Keratitis"},{"name":"Scleritis"},{"condition":"Glaucoma","name":"Glaucoma"},{"name":"Iritis"},{"condition":"Conjunctivitis","name":"Conjunctivitis"},{"condition":"Headache","name":"Headache"},{"condition":"EyeRednessAndSwelling","name":"Eye redness and swelling"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}