{"formula":"ShiGuanAiYiHaoFang","names":{"pinyin":"shi guan ai yi hao fang","hanzi":"食管癌一号方","english":"formula number one for esophageal cancer","commonEnglish":"Formula Number One for Esophageal Cancer","aka":[""]},"herbs":[{"herb":"QingDai","dosage":"6g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, disperses Stagnation and reduces swelling."]},{"herb":"DanShen","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, cools the Blood and reduces abscesses."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood,disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chen Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with cough, wheezing and nausea marked by profuse and salty sputum.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"ZhiKe(Qiao)","dosage":"9g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"DaiZheShi","dosage":"12g","actions":["Strongly descends rebellious Qi."]},{"herb":"HouPo","dosage":"9g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ke, for abdominal distention due to Qi and Food Stagnation."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ke and Mu Xiang, for abdominal distention, fullness and pain due to Spleen and Stomach Qi Stagnation.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Sha Ren, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, dissipates nodules, reduces Stagnation, treats sores, skin ulcerations and carbuncles and reduces swelling."]},{"herb":"BaiDouKou","dosage":"3g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Stomach, warms the Middle Jiao, descends Qi and stops vomiting.","With Sha Ren, for fullness and a stifling sensation in the chest, epigastric pain, fullness, nausea, vomiting, diarrhea, anorexia and a thick tongue coat due to Qi Obstruction from Cold-Dampness.","With Chen Pi, for fullness and discomfort in the chest and abdomen, belching, nausea, vomiting, and diarrhea due to Spleen and Stomach Deficiencies with turbid Dampness Accumulation."]},{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi and alleviates pain.","With Sha Ren, for distention, epigastric and abdominal pain, anorexia, nausea, vomiting, diarrhea, dysentery, or tenesmus due to Qi Obstruction and/or Food Stagnation."]},{"herb":"GuYa(DaoYa)","dosage":"9g","actions":["Reduces Food Stagnation, promotes digestion, strengthens and opens the Stomach and harmonizes the Center.","With Chen Pi and Sha Ren, for reduced appetite and distention of the chest and abdomen due to Food Stagnation.","With Chen Pi, Gan cao and Sha Ren, for poor digestion due to Spleen and Stomach Deficiencies"]},{"herb":"JinYinHua","dosage":"20g","actions":["Clears Heat and resolves Fire toxicity.","With Gan Cao, for toxic swellings and sores."]},{"herb":"ShaRen","dosage":"6g","actions":["Promotes the movement of Qi, aromatically transforms Dampness and strengthens the Spleen."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Regulates Qi","Invigorates the blood","Dispels Stasis","Resolves Phlegm","Dries Dampness","Clears Heat","Resolves toxicity"],"syndromes":["Esophageal cancer with chest distention due to Rebellious Qi"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Epigastric distention and vague pain","Belching","Chest distention","Salivation","Dry mouth and throat","A hard, palpable lump in the epigastrium","Facial color dark and dull or pale","Emaciation","Sides and ribs distended on both sides (maybe with sharp pain)","Enlargement of the Liver and Spleen","Suffocating sensation in chest","Tendency to sigh","Vomit that looks like bean juice","Melancholy","Depression","Irritability","Black stool","Inappropriate anger","Mental fatigue","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses"],"tongue":"Dark purple (maybe purple spots on edge of tongue) or Red","tongueCoat":"Normal or Greasy","pulse":"Wiry, choppy and slow or Small and choppy or Thready and rapid or Thready and taut"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"chest pain","modifications":[{"herb":"PuGongYing","modification":"+ 15g Hb Taraxaci"},{"herb":"ShanDouGen","modification":"+ 15g Rx. Sophorae Tonkinensis"},{"herb":"MuLi","modification":"+ 20g Concha Ostreae"},{"herb":"GuaLou","modification":"+ 10g Fr. Trichosanthis"},{"herb":"XieBai","modification":"+ 12g Bul. Allii"}]},{"purpose":"constipation","modifications":[{"herb":"MangXiao","modification":"+ 9g Natrii Sulfas"},{"herb":"RouCongRong","modification":"+ 15g Hb. Cistanches"}]}]}