{"formula":"ShiGuanAiWuHaoFang","names":{"pinyin":"shi guan ai wu hao fang","hanzi":"食管癌五号方","english":"formula number five for esophageal cancer","commonEnglish":"Formula Number Five for Esophageal Cancer","aka":[""]},"herbs":[{"herb":"QingDai","dosage":"6g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood, disperses Stagnation, reduces swelling, clears Liver Fire, and drains Lung Heat."]},{"herb":"ShaShen","dosage":"15g","actions":["Nourishes Yin, moistens the Lungs, dispels Phlegm and stops cough."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, cools the Blood and reduces abscesses."]},{"herb":"FuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Zhi Ban Xia,expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools."]},{"herb":"DaiZheShi","dosage":"15g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire and strongly descends rebellious Qi."]},{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity and Clears Damp-Heat from the Lower Jiao.","With Gan Cao, for toxic swellings and sores."]},{"herb":"ShiHu","dosage":"12g","actions":["Nourishes Yin, clears Heat, generates fluids and nourishes Stomach and Lung Yin."]},{"herb":"PiPaYe","dosage":"12g","actions":["Transforms Phlegm, clears Lung Heat and descends Lung Qi.","With Ban Xia, for cough and wheezing."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, dissipates nodules, reduces Stagnation, treats sores, skin ulcerations and carbuncles and reduces swelling.","With Hou Po , for Phlegm-Dampness with Qi Stagnation to open Phlegm and Qi Obstruction with a sensation of fullness in the chest with coughing and wheezing, nausea, vomiting and a sensation of distention in the hypochondrium."]},{"herb":"CaoDouKou","dosage":"6g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen.","With Hou Po, for Cold-Dampness in the Middle Jiao when Dampness predominates.","With Zhi Ban Xia, for Cold Phlegm affecting the chest and diaphragm with vomiting."]},{"herb":"GuYa(DaoYa)","dosage":"12g","actions":["Reduces Food Stagnation, promotes digestion, strengthens and opens the Stomach, harmonizes the Center, strengthens the Spleen and encourages appetite."]},{"herb":"ZhiKe(Qiao)","dosage":"6g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"LaiFuZi","dosage":"12g","actions":["Reduces Food Stagnation, transforms accumulation, promotes digestion,eliminates distention, Descends Qi and","reduces Phlegm.","With Zhi Ke, for distention, belching, and anorexia due to Food Stagnation.","With Zhi Ban Xia, for Damp-Phlegm induced cough and wheezing.","with Bai Zhu, for Food Stagnation with Spleen Deficiency."]},{"herb":"HouPo","dosage":"12g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ke, for abdominal distention due to Qi and Food Stagnation.","with Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi, leading to coughing, vomiting or a sense of something stuck in the throat."]},{"herb":"BaiZhu","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen and augments Qi,","resolves Phlegm, stops cough, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Heat","Resolves Fire toxicity","Cools the Blood","Disperses Stagnation","Nourishes Yin","Dries Dampness","Transforms Phlegm","Descends Rebellious Qi","Dissipates nodules","Tonifies the Spleen","Augments Qi"],"syndromes":["Qi and Phlegm Stagnation"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Poor general condition","Emaciation","Lassitude","Chest distention","Frequent epigastric and abdominal distention and fullness which is worse after eating","Vomiting of partially digested food about twelve hours after eating","Vomiting relieves the abdominal discomfort","The vomitus may have thick or thin frothy mucus","Maybe epigastric masses and/or splash on palpation","Copious salivation","Stuffiness in the chest","General weakness","Acid regurgitation","Nausea"],"tongue":"Normal or Bluish and dark or Dry and rigid","tongueCoat":"Thin and white or Whitish or greasy and white or Yellow and greasy or Yellow- curdy","pulse":"Slippery or Wiry or Wiry and large or Wiry and slippery or Weak or Moderate, thready and forceless"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}