{"formula":"ShiHuYeGuangWan","names":{"pinyin":"shi hu ye guang wan","hanzi":"石斛夜光丸","english":"dendrobium pill for night vision","commonEnglish":"Dendrobium Pill For Night Vision","aka":[""]},"herbs":[{"herb":"TianMenDong","dosage":"30-60g","actions":["Nourishes the Kidney Yin, clears Lung Heat and sedates Fire.","With Mai Men Dong, for a dry cough, thirst, and other symptoms due to Yin Deficiency and injured fluids.","With Ren Shen and Shu Di Huang, for debility and low grade fever due to Yin Deficiency."]},{"herb":"RenShen","dosage":"30-60g","actions":["Powerfully tonifies Yuan Qi.","With Shu Di Huang and Tian Men Dong, for Qi and Yin Deficiency."]},{"herb":"FuLing","dosage":"30-60g","actions":["Promotes urination and leaches out Dampness."]},{"herb":"MaiMenDong","dosage":"30g","actions":["Nourishes Stomach and Lung Yin and generates fluids.","With Tian Men Dong, for Lung and Kidney Yin Deficiency.","with Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"ShuDiHuang","dosage":"30g","actions":["Nourishes Jing and Blood and nourishes Liver and Kidney Yin.","With Ren Shen, for Qi and Yin Deficiency."]},{"herb":"ShengDiHuang","dosage":"(30g)","actions":["(Clears Heat, cools the Blood, nourishes Yin and generates fluids. May be added to increase the effectiveness of the Formula.)","(With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.)","(With Niu Xi, powerfully clears Deficiency Fire Blazing Upward.)"]},{"herb":"TuSiZi","dosage":"21-22.5g","actions":["Tonifies the Kidneys and Liver and improves vision.","With Sha Yuan Zi, for blurred vision, dizziness and tinnitus.","With Ju Hua, for unclear vision."]},{"herb":"JuHua","dosage":"21-22.5g","actions":["Disperses Wind, clears Heat, detoxifies, calms the Liver and clears the eyes.","With Fang Feng, for Wind-Heat irritating the Exterior with slight chills, mild fever, headache and itchy eyes.","With Gou Qi Zi, for dizziness and blurred vision due to Liver and Kidney Yin Deficiency with Jing and Blood unable to rise and nourish the eyes.","With Sheng Di Huang, Tian Men Dong and Zhi Ke, for near-sightedness."]},{"herb":"JueMingZi","dosage":"22.5-24g","actions":["Clears Liver Heat, clears the vision, benefits the eyes, calms the Liver and anchors Liver Yang.","With Shi Hu, Tian Men Dong and Qing Xiang Zi, for Liver and Kidney Yin Deficiency with blurred vision photosensitivity and excessive tearing."]},{"herb":"XingRen","dosage":"22.5-23g","actions":["Stops cough and calms wheezing.","With Mai Men Dong, for a dry cough due to Dryness and Heat injuring the Lungs."]},{"herb":"ShanYao","dosage":"21-30g","actions":["Tonifies Kidney Yin and astringes Jing.","With Mai Men Dong and Wu Wei Zi, for Lung Deficiency with cough."]},{"herb":"GouQiZi","dosage":"21-22.5g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Shu Di Huang, for Liver and Kidney Deficiency."]},{"herb":"NiuXi","dosage":"21-23g","actions":["Invigorates the Blood and expels Blood Stasis, nourishes Liver and Kidney Yin and Descends Blood and Fire."]},{"herb":"WuWeiZi","dosage":"15g","actions":["Tonifies the Kidneys and astringes Jing,","With Ren Shen and My Men Dong, for exhaustion of Qi and Yin."]},{"herb":"ShaYuanZi","dosage":"15g","actions":["Tonifies Kidney Yang, astringes Jing, nourishes Liver Blood and improves vision.","With Jue Ming Zi, Gou Qi Zi and Ju Hua, for blurred vision due to Deficient Liver and Kidney Yin."]},{"herb":"ShiHu","dosage":"15-22.5g","actions":["Nourishes the Yin, clears Heat, generates fluids, enriches Kidney Yin, reduces Heat from Deficiency and brightens the eyes.","With Tian Men Dong, Tu Si Zi and Ji Hua, for enlarged pupils, blurred vision, photophobia, excessive tearing, and vertigo due to Liver and Kidney Yin Deficiency with Fire and Internal Wind.","With Gou Qi Zi, Ju Hua, Shu Di Huang, Tian Men Dong, Sha Yuan Zi and Jue Ming Zi, for blurred vision, dilated pupils, and dizziness due to Yin Deficiency."]},{"herb":"RouCongRong","dosage":"15g","actions":["Tonifies the Kidneys, strengthens the Yang and benefits Jing and marrow."]},{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"GanCao","dosage":"15g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ZhiKe(Qiao)","dosage":"15g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"QingXiangZi","dosage":"15g","actions":["Clears Wind-Heat, drains Liver Fire and improves the vision."]},{"herb":"FangFeng","dosage":"15g","actions":["Releases the Exterior and expels External Wind."]},{"herb":"HuangLian","dosage":"15g","actions":["Drains Fire and resolves Fire toxicity."]},{"herb":"ShuiNiuJiao","dosage":"45g","actions":["Clears Heat from the Ying and Xue stages, relieves Fire toxicity, cools the Blood and stops bleeding.","With Sheng Di Huang, for Blood Heat."]},{"herb":"LingYangJiao","dosage":"15g","actions":["Drains Liver Heat, calms the Liver, anchors Yang and clears Fire toxicity."]},{"herb":"Bai(Ci)JiLi","dosage":"(15g)","actions":["(Calms the Liver, anchors Yang, dredges Liver Qi, disperses Stagnation, extinguishes Liver Wind, dispels Wind-Heat, brightens the eyes and stops itching. May be added to increase the effectiveness of the Formula)","(With Jue Ming Zi, Ju Hua and Zhi Gan Cao, for pain, redness, and swelling of the eyes with extensive tearing due to Wind-Heat Invading the Liver Channel.)"]}],"actions":["Nourishes Yin","Descends Liver Yang","Dispels Internal Wind","Brightens the eyes"],"syndromes":["Visual disturbances due to Liver and Kidney Yin and Blood Deficiency leading to Empty Fire Rising and Internal Wind"],"manifestations":{"symptoms":["Enlarged pupils","Blurred vision","Photophobia","Excessive tearing","Lightheadedness","Vertigo","Dry eyes","Irritation of the eyes","Photophobia","Poor vision","Red eyes","Dizziness","Glare","Insomnia","Night sweating","Pain in the lower back","Weakness of lower back"],"tongue":"Red-tipped (may be trembling)","tongueCoat":"Little or None","pulse":"Rapid and Empty"},"conditions":[{"condition":"Cataracts","name":"Cataracts"},{"condition":"Conjunctivitis","name":"Conjunctivitis"},{"condition":"Lachrymation","name":"Lacrimation"},{"condition":"Hypertension","name":"Hypertension"},{"condition":"Hypertension","name":"Ocular hypertension"},{"condition":"Tinnitus","name":"Tinnitus"},{"condition":"Headache","name":"Neurogenic headache"},{"condition":"Dizziness","name":"Dizziness"},{"condition":"Weakness","name":"Weakness of the low back"},{"name":" Nystagmus"},{"name":"Photophobia"},{"condition":"Glaucoma","name":"Glaucoma"},{"name":" Mydriasis"},{"name":" Retinitis"},{"condition":"Deafness","name":"Deafness"},{"condition":"MenopauseSyndrome","name":"Menopause"},{"condition":"Vertigo","name":"Vertigo"}],"contra":{"contraindications":["Avoid pungent and spicy foods while taking this formula."],"interactions":[""]},"notes":[""],"modifications":[]}