{"formula":"ShiYiWeiWenDanTang","names":{"pinyin":"shi yi wei wen dan tang","hanzi":"十一味溫膽湯","english":"eleven ingredients decoction to warm the wall bladder","commonEnglish":"Eleven Ingredients Decoction to Warm the Gallbladder","aka":[""]},"herbs":[{"herb":"YeJiaoTeng","dosage":"30g","actions":["Nourishes the Heart Yin and Blood and calms the Spirit."]},{"herb":"ZhuRu","dosage":"12g","actions":["Clears Heat and Phlegm from the Gallbladder and Stomach, cools Blood and descends rebellious Qi.","With Zhi Ban Xia and Zhi Shi, for insomnia, palpitations and irritability due to Phlegm Heat leading to disharmony between the Gallbladder and Stomach with a stifling sensation in the chest and restlessness","With Zhi Shi, for Phlegm-Heat obstructing the flow of Qi with focal distention in the chest and epigastrium, hiccup, dry retching, nausea and acid regurgitation and palpitations, irritability, insomnia and emotional problems due to Gallbladder constraint with Phlegm Disturbing the Heart.","With Zhi Ban Xia, Chen Pi, Zhi Shi and Fu Ling, for Gallbladder Fire with Phlegm."]},{"herb":"FuLing","dosage":"15g","actions":["Resolves Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations and shortness of breath.","With Chen Pi, for nausea and vomiting due to congested Fluids.","With Zhi Ban Xia, prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention, and anorexia due to congested fluids.","With Shi Chang Pu and Yuan Zhi, for insomnia and palpitations due to Spleen and Heart Insufficiency or Phlegm Obstructing the Heart."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen and promotes the movement of Qi.","With Yuan Zhi and Fu Ling, for forgetfulness, tinnitus and impaired hearing."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Transforms Phlegm, descends rebellious","Qi, harmonizes the Stomach and stops vomiting.","With Chen Pi, for Spleen and Stomach Qi Disharmony with epigastric and abdominal distention or pain.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools, treats Phlegm, thin mucus and turbid Dampness and prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia.","With Huang Lian, for epigastric distention and indigestion due to a simultaneous invasion of Hot and Cold pathogenic influences into the Stomach.","With Huang Lian and Zhu Ru, for Gallbladder Fire and Phlegm-Heat Disturbing the Heart with palpitations, insomnia, irritability and a stifling sensation in the chest."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, tonifies the Spleen, transforms Phlegm and descends Qi.","With Ban Xia, for excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhu Ru and Huang Lian, for Phlegm-Heat induced vomiting.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xian and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiShi","dosage":"6g","actions":["Reduces accumulation, descends Qi, transforms Phlegm and reduces distention.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"HuangLian","dosage":"6g","actions":["Clears Heat, drains Dampness and clears Heart Fire."]},{"herb":"GanCao","dosage":"6g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels,"]},{"herb":"YuanZhi","dosage":"6g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidney, expels Phlegm, opens the Orifices, clears the Lungs and stops coughing."]},{"herb":"ZhenZhuMu","dosage":"9g","actions":["Calms the Liver, anchors Yang, drains Liver Fire, sedates fright and calms the Spirit."]}],"actions":["Clears Heat","Transforms Phlegm","Harmonizes the Stomach","Calms the Shen"],"syndromes":["Phlegm-Heat"],"manifestations":{"symptoms":["Anxiety","Nervousness","Dizziness","Vertigo","Insomnia with waking in the early hours","Unable to fall back to sleep","Irritability","Restlessness","Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Indeterminate gnawing hunger","Anorexia","Belching","Acid reflux","abdominal distention","A bitter taste in the mouth","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid or Wiry"},"conditions":[{"condition":"Anxiety","name":"Anxiety"},{"name":"Post-febrile convalescence "},{"condition":"AcidReflux","name":"Acid reflux"},{"condition":"Dyspnea","name":"Dyspnea"},{"condition":"AnxietyNeurosis","name":"Anxiety neurosis "},{"name":"Post-viral syndrome"},{"condition":"Anorxia","name":"Anorexia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe anxiety","modifications":[{"herb":"HuPo","modification":"+ 1-3g Succinum"},{"herb":"SuanZaoRen","modification":"+ 12g Sm. Zizyphi Spinosae"}]}]}