{"formula":"ShiZhenHeJi","names":{"pinyin":"shi zhen he ji","hanzi":"湿疹合集","english":"mixture for eczema","commonEnglish":"Mixture for Eczema","aka":[""]},"herbs":[{"herb":"BaiXianPi","dosage":"9g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"QinJiao","dosage":"9g","actions":["Expels Wind-Dampness and resolves Dampness."]},{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness and tonifies the Spleen."]},{"herb":"ZiCao","dosage":"9g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins, clears Damp-Heat from the skin, encourages rashes and aids the healing of tissues."]},{"herb":"JinYinHua","dosage":"9g","actions":["Clears Heat and resolves Fire toxicity.","With Gan Cao, for toxic swellings and sores."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, a dry mouth, a parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease."]},{"herb":"FuLing","dosage":"6g","actions":["Clears Dampness and Heat."]},{"herb":"YeJuHua","dosage":"6g","actions":["Drains Fire and resolves toxicity."]},{"herb":"ChiShao","dosage":"3g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses."]},{"herb":"HuangLian","dosage":"3g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity."]},{"herb":"GanCao","dosage":"4g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]}],"actions":["Clears Heat","Transforms Dampness","Alleviates itching"],"syndromes":["Damp-Heat"],"manifestations":{"symptoms":["Particularly in fat babies","Main sites involved: Face Head Neck May spread to other areas","Lesions: Erythema Papules and Vesicles Thick exudation","As the disease develops, crusts appear and itching becomes increasingly pronounced, leading to disturbance of sleeping patterns.","The body is leaner and weaker.","The lesions, usually dark red, are on the face, neck and often the hands and feet, with no clear boundaries.","Often small lesions covered with lichens form thin white scales, with signs of itching and can create a little bleeding, but no discharge","Itching","Insomnia","These babies are pale looking, with poor appetite"],"tongue":"Additional Symptoms: Constipation Short yellow urine  Pale red or Red or Red tip C: Thin white or yellow P: Rapid or Slippery and rapid"},"conditions":[{"condition":"AtopicDermatitis","name":"Atopic dermatitis"},{"condition":"Erythema","name":"Erythema"},{"condition":"AtopicDermatitis","name":"Infantile eczema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}