{"formula":"ShouDaiLiuHeWan","names":{"pinyin":"shou dai liu he wan","hanzi":"受带六和囊","english":"discharge suffering harmonize the six pill","commonEnglish":"Discharge Suffering Harmonize the Six Pill","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"60g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Cang Zhu, for vaginal discharge.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"CangZhu","dosage":"60g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao.","With Huang Bai, for atrophy disorder, vaginal discharge and Damp-sores."]},{"herb":"DangGui","dosage":"60g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Chen Pi and Zhi Ban Xia, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with coughing, wheezing and nausea marked by profuse, salty sputum.","With Chen Pi, Zhi Ban Xia and Fu Ling, for coughing attacks at night."]},{"herb":"ShuDiHuang","dosage":"60g","actions":["Nourishes the Blood Nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"BaiShao","dosage":"60g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis.","\\With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Fang Feng, Bai Zhi and Chen Pi, for painful diarrhea and borborygmus."]},{"herb":"FuLing","dosage":"60g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested Fluids.","With Zhi Ban Xia, Sheng Jiang and Chen Pi, for congested Fluids in the Stomach causing nausea and vomiting.",""]},{"herb":"ChenPi","dosage":"30g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi.","With Bai Zhu, Fang Feng and Bai Shao, for borborygmus, abdominal pain and diarrhea due to Liver Attacking the Spleen.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drink.","With Zhi Ban Xia and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"GanCao","dosage":"30g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat and relieves Fire toxicity.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]},{"herb":"ZhiBanXia.htm","dosage":"45g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, stops vomiting and harmonizes the Stomach.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Sheng Jiang, for vomiting due to Cold, thin mucus.",""]},{"herb":"ChunPi","dosage":"45g","actions":["Clears Heat, astringes the Intestines, dries Dampness, stops diarrhea and stops bleeding."]},{"herb":"MuDanPi","dosage":"36g","actions":["Clears Heat and cools and harmonizes the Blood."]},{"herb":"FangFeng","dosage":"24g","actions":["Expels Wind-Dampness and alleviates pain.","With Cang Zhu, for diarrhea due to Wind-Cold in patients with Spleen Dampness.","With Chen Pi, Bai Zhu, and Bai Shao, for diarrhea with abdominal pain."]},{"herb":"ShengMa","dosage":"24g","actions":["Raises Yang, lifts sunken Qi, clears Heat and relieves toxicity.","With Bai Zhu, for Dai channel spasms manifested as dragging sensations in the lower body, usually accompanied by vaginal discharge.","With Dang Gui, raises the clear Qi, allowing turbidity to descend and moistening of the Intestines."]},{"herb":"HuangBai","dosage":"36g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Cang Zhu, eliminates Dampness and clears Heat for Damp-Heat vaginal discharge."]},{"herb":"ShengJiang","dosage":"9g","actions":["Adjusts the Ying and Wei, normalizes the flow of Qi at the center, warms the Middle and stops vomiting.","With Zhi Ban Xia, for vomiting due to many causes including Stomach Cold.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccups."]}],"actions":["Harmonizes the Spleen and Stomach","Dries Dampness in the Middle Jiao","Raises sunken Qi","Transforms Phlegm","Clears Fire"],"syndromes":["Spleen and Stomach Qi Deficiency with Phlegm-Heat and Dampness"],"manifestations":{"symptoms":["Red and white vaginal discharge","Aching abdominal pain","The discharge is copious and persistent","Less repulsive or no odor","The color is white or pale yellow","The texture is viscid","Lustrous white or sallow complexion","Cold limbs","Weak limbs","Fatigue","Somnolence","Lassitude","Dizziness","Anorexi","Abdominal distention","Loose stools","Edema in the feet","Clear, abundant urination","Cough with sticky, yellow, difficult to expectorate sputum","Rapid breathing with a harsh voice","Restless fever","Sore throat","Constipation","Dry stools","Mania","Shortness of breath","Dyspnea","Nausea","Vomiting","Chest and/or epigastric fullness","Pain in the ribs"],"tongue":"Scarlet or Pale red","tongueCoat":"Yellow or Yellow and greasy or Yellow and smooth","pulse":"Rapid and smooth or Slippery and rapid"},"conditions":[{"condition":"VaginalDischarge","name":"Red and white vaginal discharge"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}