{"formula":"ShouXingWan","names":{"pinyin":"shou xing wan","hanzi":"寿星丸","english":"god of fertility pill","commonEnglish":"God of Fertility Pill","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies the Lungs, promotes urination and reduces edema.","With Ren Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling, Ren Shen and Huang Qi, for severe Qi Deficiency."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stool."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"ShengDiHuang","dosage":"9g","actions":["Clears Heat, cools the Blood, cools Heart Fire, nourishes Yin and generates fluids.","With Bai Shao, for Yin Deficiency Heat."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei and calms Liver Yang and Liver Wind.","With Zhi Gan Cao, Nourishes Yin and Blood regulates the relationship between the Liver and Spleen.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"YuanZhi","dosage":"6g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidneys, expels Phlegm and opens the Orifices."]},{"herb":"RenShen","dosage":"6g","actions":["Powerfully tonifies Yuan Qi, Tonifies Spleen, Stomach, Lung and Heart Qi and calms the Spirit.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ZhiTianNanXing","dosage":"6g","actions":["Dries Dampness, expels Phlegm and disperses Wind-Phlegm in the channels."]},{"herb":"WuWeiZi","dosage":"6g","actions":["Tonifies Qi, tonifies the Kidneys, astringes Jing, quiets the Spirit and calms and contains Heart Qi."]},{"herb":"RouGui","dosage":"3g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire and assists in the generation of Qi and Blood."]},{"herb":"HuPo","dosage":"3g","actions":["Invigorates the Blood, dissipates Stasis and calms the Spirit.","With Zhu Sha, for insomnia.","With Bai Zhu, Fu Ling and Ren Shen, for generalized edema with urinary dysfunction due to Spleen and Kidney Deficiency Cold."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"ZhuSha","dosage":"3g","actions":["Sedates the Heart, calms the Spirit and expels Phlegm."]}],"actions":["Tonifies Qi and Blood","Strengthens the Spleen","Dries Dampness","Expels Phlegm","Invigorates the Blood","Sedates the Heart","Calms the Spirit"],"syndromes":["Blood and Phlegm Stagnation"],"manifestations":{"symptoms":["Forgetfulness","Poor memory","Absent mindedness","Short attention span","Inability to concentrate","Slow speech","Dull senses","A blank expression"],"tongue":"Dark or pale purple with echymoses and dark sublingual veins","tongueCoat":"Greasy and white","pulse":"Slippery and choppy or Thready and choppy"},"conditions":[{"condition":"SenileDementia","name":"Senile dementia"},{"condition":"Forgetfulness","name":"Forgetfulness"},{"condition":"Alzheimer'sDisease","name":"Alzheimer's disease"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Cold or Yang Deficiency","modifications":[]},{"purpose":"Blood Dryness caused by Yin or Blood Deficiency","modifications":[{"herb":"ChiShao","modification":"+ 9g Rx. Paeoniae Rubra"},{"herb":"DanShen","modification":"+ 15g Rx. Salviae Miltiorrhizae"},{"herb":"YuJin","modification":"+ 9g Rx Curcumae"}]},{"purpose":"Qi and Blood Deficiency","modifications":[{"herb":"JiXueTeng","modification":"+ 15g Caulis Spatholobi"}]},{"purpose":"prominent Phlegm","modifications":[{"herb":"ZhiBanXia","modification":"+ 9g Rz. Pinelliae Preparatum"},{"herb":"ZhiShi","modification":"+ 9g Fr. Aurantii Immaturus"},{"herb":"BaiJieZi","modification":"+ 6g Sm. Sinapis"}]}]}