{"formula":"ShouWuPian","names":{"pinyin":"shou wu pian","hanzi":"首烏片","english":"polygonum pill","commonEnglish":"Polygonum Pill","aka":[""]},"herbs":[{"herb":"HeShouWu","dosage":"9-30g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood, nourishes Jing and expels Wind from the skin by nourishing the Blood."]},{"herb":"HeiZhiMa","dosage":"9-30g","actions":["Nourishes and fortifies Liver and Kidney Yin and nourishes Jing and Blood.","With He Shou Wu, Nu Zhen Zi, Han Lian Cao and Sang Shen, for prematurely gray hair."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Yin, Jing and Blood.","With Dang Gui, for Blood Deficiency.","With Dang Gui, Chuan Xiong and Bai Shao, for anemia."]},{"herb":"SangShen","dosage":"6-30g","actions":["Tonifies the Blood and enriches Yin.","With With He Shou Wu, Nu Zhen Zi and Han Lian Cao . for premature graying due to Liver and Kidney Deficiency."]},{"herb":"NuZhenZi","dosage":"4.5-18g","actions":["Nourishes and tonifies Liver and Kidney Yin.","With He Shou Wu and Hei Zhi Ma, for premature graying of hair."]},{"herb":"MoHanLian(Cao)","dosage":"9-15g","actions":["Nourishes and tonifies Liver and Kidney Yin.","With Nu Zhen Zi, for dizziness, blurred vision, and premature graying of the hair due to severe Liver and Kidney Yin Deficiency with ascendant Yang.","With Nu Zhen Zi and Sang Shen, for tonification that is best done over a long period of time."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, Shu Di Huang, and Chuan Xiong, for Blood Deficiency or Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GeGen","dosage":"4-21g","actions":["Discharges Exterior conditions, releases the muscles, especially of the neck and upper back and raises Spleen Yang."]},{"herb":"GuiZhi","dosage":"3-10g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, d releases the muscle layer, warms the channels and collaterals, unblocks Yang, transforms Qi and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei.","With Chuan Xiong, expels Wind-Dampness and warms the channels and collaterals."]},{"herb":"GanCao","dosage":"2-15g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"DaZao","dosage":"10-30g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Tonifies Yang","Nourishes the Blood","Tonifies Jing"],"syndromes":["Deficiency of Blood and Jing"],"manifestations":{"symptoms":["Alopecia","Low sperm mobility, morphology and motility","Premature graying of the hair","Vaginal discharge"]},"conditions":[{"condition":"Alopecia","name":"Alopecia"},{"name":"Male infertility "},{"name":"Premature graying of the hair "},{"condition":"VaginalDischarge","name":"Vaginal discharge"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}