{"formula":"ShuGanKuiJianTang","names":{"pinyin":"shu gan kui jian tang","hanzi":"舒肝溃坚汤","english":"dredge the liver and disperse the hard decoction","commonEnglish":"Dredge the Liver and Disperse the Hard Decoction","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"6-12g","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion."]},{"herb":"ShiJueMing","dosage":"9-30g","actions":["Drains Liver Fire, pacifies the Liver and anchors and sedates Liver Yang.","With Xia Ku Cao, for headache and dizziness due to Rising Liver Yang."]},{"herb":"DangGui","dosage":"6-15g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Xiang Fu, tonifies the Blood and moves Qi."]},{"herb":"HongHua","dosage":"6-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain."]},{"herb":"JiangCan","dosage":"6-10g","actions":["Transforms Phlegm, softens hardness, eliminates toxins and dissipates nodules."]},{"herb":"ChenPi","dosage":"6-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"WaLengZi","dosage":"9-30g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules."]},{"herb":"WangBuLiuXing","dosage":"9-30g","actions":["Promotes the movement of Blood, invigorates the channels, reduces swelling and drains abscesses.","With Dang Gui, Hong Hua, Chuan Xiong and Xiang Fu, for Blood Stasis."]},{"herb":"XiaKuCao","dosage":"6-18g","actions":["Clears Liver Fire, clears Hot Phlegm and dissipates nodules.","With Chai Hu, for neck nodules due to Liver Qi Stagnation.","With Xiang Fu and Chai Hu, for Liver Qi Stagnation."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Chai Hu, for Qi Stagnation and menstrual irregularity.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis."]},{"herb":"ChuanXiong","dosage":"6-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Chi Shao and Chai Hu, for Liver Qi and Blood Stagnation generating headaches and/or chest pain.",""]},{"herb":"ChiShao","dosage":"6-15g","actions":["Invigorates the Blood, dispels Blood Stasis,reduces swelling from sores and abscesses and relieves pain.","With Xiang Fu, for flank pain, abdominal pain and dysmenorrhea due to Qi and Blood Stagnation.",""]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"JiangHuang","dosage":"6-10g","actions":["Invigorates the Blood, eliminates Blood Stasis, promotes the movement of Qi, opens the channels and collaterals to alleviate pain and reduces swelling."]}],"actions":["Dredges Liver Qi","Transforms Phlegm","Breaks up nodules"],"syndromes":["Qi and Phlegm Stagnation"],"manifestations":{"symptoms":["The gland enlarges slowly over a period of weeks","Adjacent glands become involved","Often several glands join together to form one mass","The nodules begin to feel painful","The nodules become hard and not easily moved","Mild fever","Slightly reduced appetite","Feeling of obstruction in throat as if a slice of roast meat were stuck there which cannot be coughed up nor swallowed down. This sensation becomes more prominent during emotional upset and subsides when relaxed","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses"],"tongue":"Pink","tongueCoat":"Thin and white","pulse":"Slippery and wiry"},"conditions":[{"condition":"CervicalLymphadenopathy","name":"Cervical lymphadenopathy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}