{"formula":"ShuGanHuaYuTang","names":{"pinyin":"shu gan hua yu tang","hanzi":"舒肝化瘀湯","english":"decoction for softening the liver and removing blood stasis","commonEnglish":"Decoction for Softening the Liver and Removing Blood Stasis","aka":[""]},"herbs":[{"herb":"BanZhiLian","dosage":"15g","actions":["Clears Heat, resolves Fire toxins, invigorates the Blood, reduces swellings, treats various types of cancer, promotes urination and mildly dispels Blood Stasis.","With Bai Hua She She Cao and Ba Yue Zha, for cancers of the digestive tract."]},{"herb":"BaiHuaSheSheCao","dosage":"15g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses, promotes urination and inhibits the growth of cancer cells.","With Ban Zi Lian, for cancer.",""]},{"herb":"SanLeng","dosage":"8g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells."]},{"herb":"BaYueZha","dosage":"12g","actions":["Dredges the Liver, regulates Qi, controls pain, expels Phlegm, disperses clumps, promotes urination, invigorates the Blood, removes toxins and inhibits the growth of cancer cells."]},{"herb":"EZhu","dosage":"10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With San Leng, for hepatosplenomegaly with distention, pain and immobile, palpable epigastric, sub costal and abdominal masses.","With Dan She, Bie Jia and San Leng, for firm abdominal masses."]},{"herb":"BieJia","dosage":"12g","actions":["Nourishes Yin, anchors Yang, invigorates the Blood, promotes menstruation, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces abscesses and inhibits the growth of cancer cells."]},{"herb":"YiYiRen","dosage":"30g","actions":["Strengthens the Spleen, resolves Dampness, clears Heat, relieves pain and inhibits the growth of cancer cells.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema."]},{"herb":"FuLing","dosage":"10g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and inhibits the growth of cancer cells."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, descends Qi, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for Qi and Blood Deficiency."]},{"herb":"TaiZiShen","dosage":"12g","actions":["Strengthens the Spleen,d tonifies Qi, generates Body Fluids and treats chronic febrile disorders."]},{"herb":"HuangQi","dosage":"20g","actions":["Tonifies Qi and Blood, strengthens the Spleen, promotes urination, relieves pain and inhibits the growth of cancer cells."]}],"actions":["Clears Heat","Removes toxins","Invigorates the Blood","Breaks up Stasis","Promotes urination","Eliminates Dampness","Tonifies Qi","Inhibits the growth of cancer cells"],"syndromes":["Toxic Heat with Qi Deficiency and Blood Stagnation"],"manifestations":{"symptoms":["Deep jaundice","Hypochondriac pain","A lump under the ribs","High fever","Thirst","Epistaxis","Spots on the skin","Constipation","Scanty, red urine","Hemorrhaging","Loss of consciousness","May be ascites (late stage)","Weakness","Bleeds easily"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Tight or Thready and rapid"},"conditions":[{"condition":"LiverCancer","name":"Nodular Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}