{"formula":"ShuJinLiAnSan","names":{"pinyin":"shu jin li an san","hanzi":"舒筋立安散","english":"relax the tendons and instill peace powder","commonEnglish":"Relax the Tendons and Instill Peace Powder","aka":["Clematis and Carthamus Combination"]},"herbs":[{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness, expels Internal Wind, stops spasms and alleviates pain.","With Cang Zhu, for pain due to Wind-Dampness Bi with aching joints, heavy limbs and generalized aching discomfort.","With Qiang Huo, Du Huo and Wei Ling Xian, for painful obstruction.","With Chao Nan Xing, for headache, generalized body aches and numbness due to Wind-Phlegm Obstructing the channels."]},{"herb":"QiangHuo","dosage":"3-10g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, guides Qi to the Tai Yang and Du channels and alleviates pain.","With Chuan Xiong, for headache and generalized body aches and pains associated with the common cold or painful obstruction.","With Fang Feng, for pain due to External Wind-Dampness.","With Cang Zhu, for a heavy-headed sensation.","With Du Huo, for Wind-Dampness.","With Fang Feng, Bai Zhi and Cang Zhu, for Wind-Cold."]},{"herb":"WeiLingXian","dosage":"3-16g","actions":["Dispels Wind-Dampness, unblocks the channels and alleviates pain.","With Qiang Huo, for Wind-Damp Bi causing joint pain, especially in the upper joints.","With Niu Xi, for Wind-Damp Bi causing joint pain, especially in the lower joints."]},{"herb":"ZhiTianNanXing","dosage":"3-10g","actions":["Disperses Wind-Phlegm in the channels, stops spasms, reduces swelling and alleviates pain.","With Cang Zhu, for Wind-Damp Bi.","With Fang Feng, for muscular tetany."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and Clears Dampness from the Lower Jiao.","With Qiang Huo, Chuan Xiong and Bai Zhi, for Exterior Wind-Cold-Dampness.","With Bai Zhu, for musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation."]},{"herb":"DuHuo","dosage":"3-10g","actions":["Dispels Wind-Dampness and alleviates pain.","With Fang Feng, for numbness in the legs.","With Qiang Huo, for joint pain and numbness."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination and leaches out Dampness.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"HanFangJi","dosage":"3-12g","actions":["Expels Wind-Dampness, purges Damp-Heat and alleviates pain."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Mu Tong and Sheng Di Huang, for Lower Jiao Damp-Heat with painful, difficult urination."]},{"herb":"LongDanCao","dosage":"3-10g","actions":["Drains Damp-Heat from the Liver and Gallbladder channels."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity and promotes urination."]},{"herb":"MuTong","dosage":"3-10g","actions":["Promotes urination.","With Han Fang Ji and Cang Zhu, for Wind-Damp Bi joint pain."]},{"herb":"ZhiBanXia.htm","dosage":"3-15g","actions":["Dries Dampness, transforms Phlegm and reduces Stagnation.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Cang Zhu and Fu Ling, for A thick white tongue coat with no desire to drink."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood and nourishes Yin.","With Niu Xi, powerfully clears Deficiency Fire Blazing Upward."]},{"herb":"ZhiFuZi","dosage":"1.5-3g","actions":["Disperses Cold and Dampness, warms the channels and stops pain.","With Bai Zhu, for Wind-Damp Bi.","With Bai Zhu and Fu Ling, for Kidney and Spleen Yang Deficiency and retention of pathogenic water with abdominal pain which is worse with Cold, urinary difficulty, and deep aching and heaviness in the extremities.","With Fu Ling, for lower body edema and dysuria."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"BaiZhi","dosage":"3-10g","actions":["Expels Wind, eliminates Dampness, dispels Cold and alleviates pain.","With Chuan Xiong, for headache.","With Huang Qin, for Wind-Heat headache.","With Fang Feng and Qiang Huo, for Wind-Cold with headache and stuffy nose.","With Qiang Huo, for Wind-Cold Dampness causing fever, chills and headaches."]},{"herb":"MuGua","dosage":"2-12g","actions":["Relaxes the sinews, increases Qi and Blood circulation, unblocks the channels, harmonizes the Stomach, nourishes the Liver and transforms Dampness.","With Du Huo, for weakness and atrophy of the muscles of the lower extremities."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating.","With Jin Cang Zhu, for Damp Cold Painful Obstruction."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ZhuLi","dosage":"30-60g","actions":["Clears Heat, transforms Phlegm and penetrates to the channels.","With Jiang Zhi, for Wind-Stroke with Phlegm welling upward."]},{"herb":"ShengJiang","dosage":"1-2ml","actions":["Releases the Exterior, induces perspiration,","disperses Cold, warms the Middle, breaks up Phlegm, stops vomiting and reduces the toxicity of other herbs.","With Zhi Ban Xia, for coughing and vomiting.","With Zhu Li, for aphasia and numbness from Wind-Stroke due to Phlegm Obstruction.","With Chen Pi, for Cold-Dampness Obstructing the Middle."]}],"actions":["Disperses Wind","Clears Heat","Eliminates Cold","Dispels Dampness","Invigorates the Blood","Unblocks the channels and collaterals"],"syndromes":["Wind- Damp Bi with Cold and/or Heat"],"manifestations":{"symptoms":["Severe pain in the muscles and joints of the extremities","Numbness and pain of the legs"]},"conditions":[{"condition":"Numbness","name":"Numbness and pain of the legs"},{"condition":"Numbness","name":"Paresthesia"},{"condition":"Osteoarthritis","name":"Osteoarthritis"},{"condition":"PainfulObstruction","name":"Painful obstruction"},{"condition":"Neuralgia","name":"Neuralgia"},{"condition":"PeripheralNeuropathy","name":"Peripheral neuropathy"},{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"PostStrokeParalysis","name":"Hemiplegia"},{"name":"Chronic vitamin B Deficiency "},{"condition":"RheumatoidArthritis","name":"Rheumatoid arthritis "},{"condition":"Neuritis","name":"Neuritis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe abdominal pain","modifications":[{"herb":"RuXiang","modification":"+ Olibanum"},{"herb":"MoYao","modification":"+ Myrrh"}]}]}