{"formula":"ShunQiHeZhongTang","names":{"pinyin":"shun qi he zhong tang","hanzi":"順氣和中湯","english":"smooth qi and harmonize the middle decoction","commonEnglish":"Smooth Qi and Harmonize the Middle Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, aids circulation of moisture downward from the face and relieves numbness and pain.","With Ren Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Dang Gui, for Qi and Blood Deficiency with numbness, painful obstruction and paresthesias.","With Sheng Ma, raises the Yang Qi of the Spleen."]},{"herb":"RenShen","dosage":"1-9g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions.","With Bai Zhu, Tonifies the transformation and transportation functions of the Spleen.","With Huang Qi and Chai Hu, for Qi Deficiency with various types of prolapse due to Sinking of the Clear Yang."]},{"herb":"GanCao","dosage":"3-14g","actions":["Tonifies the Spleen and augments Qi, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, Dang Gui, Chai Hu and Bai Zhu, for hypochondriac pain due to Liver Qi Stagnation."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism, stabilizes the Exterior and stops sweating."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, descends Qi, adjusts the Middle,","relieves the diaphragm, dries Dampness and","transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Huang Qi, for Qi and Blood Deficiency.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chai Hu and Bai Shao, for Liver Qi Stagnation and Blood Deficiency."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain.","With Zhi Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews.","With Dang Gui, nourishes Yin and Blood.","With Ren Shan and Huang Qi, restrains sweating from Deficiency."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi, relieves Stagnation, raises Yang Qi, disperses Wind-Heat and resolves Phlegm and congestion.","With Dang Shen, Bai Zhu and Bai Shao, fortifies Qi.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi, Ren Shen and Sheng Ma, for Central Qi Sinking."]},{"herb":"ShengMa","dosage":"3-9g","actions":["Releases the Exterior, raises Yang and lifts sunken Qi.","With Dang Gui, raises the clear Qi, allowing turbidity to descend.","With Huang Qi and Chai Hu, for prolapse of internal organs."]}],"actions":["Tonifies Qi and Blood","Raises the Clear Yang of the Spleen and Stomach","Descends Rebellious Qi","Dries Dampness","Resolves Phlegm","Alleviates pain"],"syndromes":["Qi Deficiency"],"manifestations":{"symptoms":["Sudden paroxysmal burning in the facial region","Sudden pain while talking","Often appears after exposure to Wind","Sometimes the patient wakes from sleep","The pain is severe lasts from several seconds to two minutes","The pain suddenly stops","Pain mostly occurs in the maxillary and mandibular branches","Most commonly seen in middle aged or older people","Pain in the optic branch is rare","Seen more in women than men","Persistent headache","Insomnia","Shortness of breath","Fatigue","Aversion to Cold","Anorexia"],"tongue":"Pale","tongueCoat":"White","pulse":"Weak"},"conditions":[{"condition":"TrigeminalNeuralgia","name":"Trigeminal neuralgia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"trigeminal neuralgia with Blood Stagnation","modifications":[{"herb":"ChuanXiong","modification":"+ 15g Rz. Chuanxiong"},{"herb":"ChiShao","modification":"+ 9g Rx. Paeoniae Rubra"},{"herb":"DiLong","modification":"+ 9g Pheretima"},{"herb":"ManJingZi","modification":"+ 9g Fr. Viticis"},{"herb":"XiXin","modification":"+ 3g Hb. cum Radice Asari"}]},{"purpose":"trigeminal neuralgia with Blood Stagnation which has entered the network vessels","modifications":[{"herb":"ChuanXiong","modification":"+ 15g Rz. Chuanxiong"},{"herb":"DiLong","modification":"+ 9g Pheretima"},{"herb":"ManJingZi","modification":"+ 9g Fr. Viticis"},{"herb":"QuanXie","modification":"+ 6g Scorpio"},{"herb":"WuGong","modification":"+ 6g Scolopendra"},{"herb":"JiangCan","modification":"+ 6g Bombyx Batryticatus"}]}]}