{"formula":"ShunQiDaoTanTang","names":{"pinyin":"shun qi dao tan tang","hanzi":"順氣導痰湯","english":"rectify qi and eliminate phlegm decoction","commonEnglish":"Rectify Qi and Eliminate Phlegm Decoction","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends rebellious Qi, harmonizes the Stomach, stops vomiting and reduces distention.","With Chen Pi and Fu Ling, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"ChenPi","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, regulates Qi and adjusts the Middle Jiao.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"FuLing","dosage":"12g","actions":["Strengthens the Spleen, harmonizes the Middle Jiao, transforms Phlegm and dries Dampness.","With Zhi Ban Xia, for Phlegm, thin mucus and turbid Dampness.","With Zhi Ban Xia, Chen Pi and Sheng Jiang, for congested Fluids in the Stomach manifesting as nausea and vomiting.","With Mu Xiang, for diarrhea and borborygmus due to Dampness.","With Shi Chang Pu and Yuan Zhi, for insomnia and palpitations due to Spleen and Heart Insufficiency or Phlegm Obstructing the Heart."]},{"herb":"DanNanXing","dosage":"6g","actions":["Clears Heat and dissolves Phlegm."]},{"herb":"ZhiShi","dosage":"9g","actions":["Breaks up stagnant Qi, reduces accumulation, transforms Phlegm and reduces distention.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ShengJiang","dosage":"9g","actions":["Warms the Lungs and transforms Phlegm."]},{"herb":"MuXiang","dosage":"9g","actions":["Promotes the movement of Qi, strengthens the Spleen, prevents Stagnation and alleviates pain."]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi."]},{"herb":"YuanZhi","dosage":"9g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidneys, expels Phlegm, opens the Orifices, clears the Lungs and stops coughing.","With Yu Jin and Shi Chang Pu, for disorientation due to Phlegm Blocking the Heart Orifices."]},{"herb":"YuJin","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, regulates Qi flow, clears the Heart and Pericardium and opens the Orifices."]},{"herb":"ShiChangPu","dosage":"15g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen and promotes the movement of Qi.","With Yu Jin and Zhi Ban Xia, for disorientation, irritability, dizziness, and hearing problems due to Turbid Dampness Blocking the Orifices.","With Yuan Zhi and Fu Ling, for forgetfulness, tinnitus and impaired hearing.","With Yu Jin, transforms Dampness, opens the Orifices and awakens the brain to treat turbid Dampness which has blocked the clear Orifices, with loss of consciousness or confusion, tinnitus and forgetfulness."]}],"actions":["Regulates Qi","Relieves Stagnation","Transforms Phlegm","Opens the orifices"],"syndromes":["Liver Qi Stagnation: Phlegm and Qi Stagnant and Blocked"],"manifestations":{"symptoms":["Paranoia","Lots of worries","Illogical speech","Chest and flank distention and fullness,","No thought of food or drink","Tendency to profuse Phlegm","Dull and silly","Mumbling to oneself","Tempermental","Frequent laughing and crying","Feeling of obstruction in throat as if a slice of roast meat were stuck there which cannot be coughed up nor swallowed down. This sensation becomes more prominent during emotional upset and subsides when relaxed","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Hysteria","Tendency to sigh","Melancholy","Apathy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Premenstrual syndrome","Chronic cases: Red eyes Tidal fever A dry mouth"],"tongue":"Pink","tongueCoat":"Thin and white or Slimy","pulse":"Slippery and wiry (slippery due to Phlegm)"},"conditions":[{"condition":"Schizophrenia","name":"Schizophrenia"},{"condition":"Hysteria","name":"Hysteria"},{"condition":"BiPolarDisorder","name":"Bi-polar disorder "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"schizophrenia","modifications":[{"herb":"GanCao","modification":"- Rx. Glycyrrhizae Preparata"},{"herb":"ZhiShi","modification":"- Fr. Aurantii Immaturus"},{"herb":"ShengJiang","modification":"- Rz. Zingiberis Recens"},{"herb":"YuanZhi","modification":"- Rx. Polygalae"},{"herb":"YuJin","modification":"- Rx. Curcumae"}]}]}