{"formula":"SiQiTang","names":{"pinyin":"si qi tang","hanzi":"四七汤","english":"four ingredient decoction for the seven emotions","commonEnglish":"Four Ingredient Decoction for the Seven Emotions","aka":[""]},"herbs":[{"herb":"ZhiBanXia.htm","dosage":"9-15g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, dissipates nodules and reduces Stagnation.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Sheng Jiang, for vomiting due to Cold, thin mucus.","With Hou Po, for Phlegm-Dampness with Qi Stagnation.","With Hou Po, Zi Su Ye and Fu Ling, for Plum pit Qi Stagnation."]},{"herb":"FuLing","dosage":"6-12g","actions":["Quiets the Heart, calms the Spirit, soothes the nerves, promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Zhi Ban Xia, prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia."]},{"herb":"ZiSuYe","dosage":"6g","actions":["Promotes the movement of Spleen and Stomach Qi.","With Zhi Ban Xia and Hou Po, for Spleen and Stomach Qi Stagnation with Accumulation of Phlegm."]},{"herb":"HouPo","dosage":"9g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Rebellious Qi, dries Dampness and transforms Phlegm.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi, leading to coughing, vomiting or a sense of something stuck in the throat."]},{"herb":"ShengJiang","dosage":"15g","actions":["Adjusts the Ying and Wei, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Da Zao, protects the Stomach Qi and reduces irritation of the gastrointestinal tract by other herbs.","With Zhi Ban Xia, for Phlegm-Dampness."]},{"herb":"DaZao","dosage":"3g","actions":["Nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, prevents Phlegm Accumulation."]}],"actions":["Moves Qi","Descends Rebellious Qi","Transforms Phlegm","Harmonizes the Stomach","Disperses clumping"],"syndromes":["Phlegm-Accumulation causing problems with any of the Seven Emotions"],"manifestations":{"symptoms":["Anger","Fear","Fright","Depression","Obsession","Grief","Sadness","Melancholy"],"tongue":"Normal","tongueCoat":"Moist and white","pulse":"Slippery and wiry"},"conditions":[{"condition":"Schizophrenia","name":"Schizophrenia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula is suitable for long-term use"],"modifications":[{"purpose":"schizophrenia","modifications":[]}]}