{"formula":"SiShunQingLianYin","names":{"pinyin":"si shun qing lian yin","hanzi":"四顺淸敛饮","english":"four favorable ingredients heat clearing drink","commonEnglish":"Four Favorable Ingredients Heat Clearing Drink","aka":[""]},"herbs":[{"herb":"FangFeng","dosage":"9g","actions":["Releases the Exterior, expels Wind-Dampness and alleviates pain.","With Qiang Huo, for Wind-Dampness.","With Qiang Huo and Dang Gui, for Wind-Cold-Damp Bi."]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, cools the Blood, relieves toxicity, invigorates the Blood, reduces swelling and inhibits the growth of cancer cells.","With Da Huang, for constipation."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps, clears Blood Heat and inhibits the growth of cancer cells."]},{"herb":"QingHao","dosage":"6g","actions":["Clears Damp-Heat, cools the Blood, stops bleeding and inhibits the growth of cancer cells."]},{"herb":"DaHuang","dosage":"6g","actions":["Drains Heat, purges accumulations, transforms Dampness, promotes urination, cools and invigorates the Blood, dispels Blood Stasis, eliminates Phlegm and inhibits the growth of cancer cells.","With Dang Gui, for Blood Stasis."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood, reduces swelling from sores and abscesses and inhibits the growth of cancer cells."]},{"herb":"DangGui","dosage":"12g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Jin Yin Hua, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and inhibits the growth of cancer cells.","With Lian Qiao, for various Heat disorders."]},{"herb":"GuaLou","dosage":"15g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi (unbinds the chest), reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"DengXinCao","dosage":"3g","actions":["Clears Lung Heat, promotes urination, leaches out Dampness, cools the Blood and stops bleeding."]},{"herb":"GanCao","dosage":"3g","actions":["Clears Heat and relieves Fire toxicity, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels"]}],"actions":["Releases the Exterior","Expels Wind-Dampness","Alleviates pain","Clears Lung Heat","Clears Damp-Heat","Cools the Blood","Resolves Fire toxicity"],"syndromes":["Toxic Wind-Damp-Heat"],"manifestations":{"symptoms":["Lung cancer","Edema in the neck","Fever","Dyspnea"],"pulse":"Rapid"},"conditions":[{"condition":"LungCancer","name":"Lung cancer with edema in the neck "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}