{"formula":"SiWuMaHuangTangJiaJian","names":{"pinyin":"si wu ma huang tang jia jian","hanzi":"四物麻黃汤加減","english":"modified four substances with ephedra decoction","commonEnglish":"Modified Four Substances with Ephedra Decoction","aka":[""]},"herbs":[{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior and warms and disperses Cold pathogens.","With Xing Ren, for Wind-Cold cough and wheezing."]},{"herb":"GuiZhi","dosage":"6g","actions":["Releases the exterior, assists the Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Ma Huang, for Wind-Cold Excess conditions with fever and chills but no sweat.","With Bai Shao, for External Wind-Cold."]},{"herb":"XingRen","dosage":"6g","actions":["Stops cough and calms wheezing."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"DangGui","dosage":"12g","actions":["Nourishes, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, calms Liver Yang and Liver Wind and alleviates pain.","With Gui Zhi, harmonizes the Ying and Wei.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"ShaShen","dosage":"12g","actions":["Nourishes Lung Yin, clears Lung Heat, nourishes Stomach Yin, generates fluids and tonifies Liver and Kidney Yin."]},{"herb":"ShengJiang","dosage":"10g","actions":["Releases the Exterior, induces perspiration, disperses Cold and reduces the toxicity of other herbs.","With Gui Zhi, strongly induces sweating for treatment of External Wind-Cold with chills, fever, body aches and anhidrosis.","With Gui Zhi and Sheng Jiang, harmonizes the Ying and Wei to drive out pathogens.","With Ma Huang, strongly creates sweating to treat all externally contracted Wind-Cold disorders."]},{"herb":"DaZao","dosage":"15g","actions":["Nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, for External Wind-Cold."]}],"actions":["Dredges Wind","Dissipates Cold","Invigorates the Blood","Regulates the Ying"],"syndromes":["Wind-Cold type psoriasis"],"manifestations":{"symptoms":["This pattern occurs in an initial episode of plaque or guttate psoriasis","Lesions appear as dots or coin-shaped discs or","Coalesce into red patches covered by scales that are easy to peel off","The pattern may occur in any season but is relatively severe in winter usually moderating or subsiding in summer"],"tongue":"Pale red","tongueCoat":"Thin and white","pulse":"Floating and tight"},"conditions":[{"condition":"Psoriasis","name":"Psoriasis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}