{"formula":"SiWuRunFuTangJiaJian","names":{"pinyin":"si wu run fu tang jia jian","hanzi":"四物润肤汤加減","english":"modified four agents decoction for moistening the skin","commonEnglish":"Modified Four Agents Decoction for Moistening the Skin","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"10g","actions":["Tonifies invigorates and harmonizes the Blood, moistens the Intestines, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"HeiZhiMa","dosage":"10g","actions":["Nourishes and fortifies Liver and Kidney Yin, nourishes Jing and Blood and moistens and lubricates the Intestines and Lung."]},{"herb":"QinJiao","dosage":"10g","actions":["Clears Deficiency Heat.","With Dang Gui and Bai Shao, for Blood Deficiency."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, softens the Liver and relieves pain."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood and nourishes Yin.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"HeShouWu","dosage":"12g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and Jing and expels Wind from the skin by nourishing the Blood.","With Dang Gui and Hei zhi Ma, for constipation due to dry Intestines from Blood Deficiency."]},{"herb":"GouTeng","dosage":"12g","actions":["Extinguishes Wind, drains Liver Heat, pacifies Liver Yang and releases the Exterior."]},{"herb":"DaiZheShi","dosage":"15g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire and cools the Blood."]},{"herb":"ZhenZhuMu","dosage":"15g","actions":["Calms the Spirit, promotes healing and reduces itching of the skin."]},{"herb":"ShaShen","dosage":"15g","actions":["Nourishes Yin, moistens the Lungs, nourishes the Stomach, generates fluids and clears Heat."]},{"herb":"SuanZaoRen","dosage":"6g","actions":["Nourishes Heart Yin, tonifies the Liver Blood and calms the Spirit.","With Bai Shao, Dang Gui and He Shou Wu, for irritability, insomnia, and palpitations with anxiety due to Heart Blood and Yin Deficiencies."]},{"herb":"ShanYao","dosage":"30g","actions":["Tonifies the Spleen, nourishes Stomach, Lung and Kidney Yin and astringes Jing."]}],"actions":["Nourishes Yin","Moistens the skin","Extinguishes Wind","Alleviates itching"],"syndromes":["Blood Dryness due to Yin Deficiency"],"manifestations":{"symptoms":["Lesions, which may be multiple, manifest as pale red or grayish-white thick dry plaques with a rough surface covered by dry scales","There is severe itching, which is worse during the night and disturbs sleep","The skin is lichenified","This is a chronic condition with lesions that resist treatment or recur after remission"],"tongue":"Red","tongueCoat":"Scant coating","pulse":"Deficient and thready"},"conditions":[{"condition":"Neurodermatitis","name":"Neurodermatitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}