{"formula":"SuHeTangJiaWei","names":{"pinyin":"su he tang jia wei","hanzi":"蘇荷湯加味","english":"modified perilla and mentha decoction","commonEnglish":"Modified Perilla and Mentha Decoction","aka":["Lightening Pearls"]},"herbs":[{"herb":"WuJiaPi","dosage":"4.5-15g","actions":["Dispels Wind-Dampness, nourishes and warms the Liver and Kidneys and strengthens sinews and bones."]},{"herb":"BaiHe","dosage":"9-30g","actions":["Nourishes Stomach Yin, harmonizes the Middle Jiao, moistens the Lungs, clears Heat, stops cough, clears the Heart and calms the Spirit."]},{"herb":"BaiZhi","dosage":"3-10g","actions":["Expels Wind and Dampness, unblocks the nasal passages, dispels Cold, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Chuan Xiong, for headache."]},{"herb":"JinYinHua","dosage":"6-20g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao.","With Lian Qiao, for various Heat disorders."]},{"herb":"LianQiao","dosage":"6-30g","actions":["Clears Heat, especially in the Upper Jiao,relieves toxicity and clears Blood Heat.","With in Yin Hua, for initial-stage Wind-Heat."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, stops cough, treats dyspnea and alleviates pain."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood, disperses Blood Stasis and treats Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"XuanShen","dosage":"7-30g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity."]},{"herb":"TuFuLing","dosage":"15-60g","actions":["Relieves toxicity, eliminates Dampness and dispels Heat from the Lower Jiao.","With Chuan Xiong, raises the clear Yang while directing turbid Qi downward, moves Qi, invigorates the Blood, clears Heat and removes Dampness."]},{"herb":"QingHao","dosage":"3-12g","actions":["Clears Summerheat or Damp-Heat, clears Deficiency fevers, cools the Blood and clears Liver Heat."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood and alleviates pain."]},{"herb":"BaiGuo","dosage":"3-6g","actions":["Preserves the Lungs, calms wheezing, tonifies Kidney Jing to treat mental focus, poor memory dizziness and depression, invigorates the Blood, stops pain and prevents damage by environmental toxins."]},{"herb":"ShiChangPu","dosage":"3-10g","actions":["Transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi, promotes Blood flow, reduces swelling and alleviates Wind-Damp Bi.","With Yu Jin, for Qi, Blood or Phlegm Stagnation with palpitations, forgetfulness, moodiness, hysteria and depression."]},{"herb":"YuJin","dosage":"3-15g","actions":["Invigorates and cools the Blood, dispels Blood Stasis, regulates Qi flow, clears Heat and alleviates pain."]},{"herb":"ZeLan","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis."]}],"actions":["Dispels Wind-Dampness","Strengthens the sinews and bones","Clears Heat","Resolves toxicity","Nourishes Yin and Blood","Nourishes the Liver and Kidneys","Harmonizes the Middle Jiao","Promotes the movement of Qi","Invigorates and cools the Blood","Dispels Blood Stasis"],"syndromes":["Wind-Damp-Heat with Blood and Yin Deficiency","Brain Gu"],"manifestations":{"symptoms":["Fatigue","Loose stools","Poor appetite","Dizziness","Pale face","Weak voice","Reluctance to speak","Sweating with little or no exertion","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Scanty periods","Chronic dry cough","Afternoon fever","Night sweats","Malar flush (especially in afternoon)","Five Sole Heat","Dry mouth and throat","Itching in throat","Hoarse voice, low voice or loss of voice","Emaciation"],"tongue":"Pale or Pale, thin and dry or Red and dry","tongueCoat":"None or Thin and white","pulse":"Thready and rapid or Weak or Thin and choppy"},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}