{"formula":"SuHeTang","names":{"pinyin":"su he tang","hanzi":"苏荷汤","english":"perilla and mentha decoction","commonEnglish":"Perilla and Mentha Decoction","aka":[""]},"herbs":[{"herb":"BoHe","dosage":"30g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, benefits the throat, relieves Stagnation of Liver Qi and expels turbid filth.","With Chai Hu, Bai Shao and Dang Gui, for Liver Qi Stagnation with chest and flank distention or pain."]},{"herb":"ZiSuYe","dosage":"30g","actions":["Promotes the movement of Spleen and Stomach Qi, harmonizes the Middle Jiao and relieves intestinal gas."]},{"herb":"ShaShen","dosage":"24g","actions":["Nourishes Lung and Stomach Yin, clears Lung Heat, generates fluids and tonifies Liver and Kidney Yin."]},{"herb":"LianQiao","dosage":"24g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, clears Blood Heat and promotes urination."]},{"herb":"HuangQi","dosage":"21g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior and tonifies the Lung, promotes the discharge of pus, generates flesh, expels toxins, promotes urination and reduces edema.","With Dang Gui, for Qi and Blood Deficiency."]},{"herb":"DangGui","dosage":"30g","actions":["Tonifies, Invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, stops cough, treats dyspnea and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood, disperses Blood Stasis and treats abdominal pain."]},{"herb":"HeShouWu","dosage":"30g","actions":["Moistens the Intestines, unblocks the bowels, relieves Fire Toxin and checks malarial disorders."]},{"herb":"BaiZhi","dosage":"30g","actions":["Expels Wind and Dampness, unblocks the nasal passages, dispels Cold, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Chuan Xiong, for headache."]},{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"JueMingZi","dosage":"15g","actions":["Clears the Liver, anchors Liver Yang, expels Wind-Heat, moistens the Intestines and unblocks the bowels.","With Dang Gui, for constipation due to dry Intestines."]},{"herb":"HuaiHuaMi","dosage":"30g","actions":["Cools the Blood, stops bleeding and cools the Liver."]},{"herb":"BaiShao","dosage":"15g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver, calms Liver Yang and alleviates pain."]},{"herb":"ChaiHu","dosage":"18g","actions":["Harmonizes the Exterior and Interior, spreads Liver Qi, relieves Stagnation, raises the Yang Qi of the Stomach and Gallbladder, disperses Wind-Heat and resolves Phlegm and congestion.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Bai Shao, Dang Gui and Chuan Xiong, harmonizes the Blood.","With Bo He, for emotional depression, a stifling sensation in the chest and irregular menstruation due to Liver Blood Stagnation and Deficiency.With Huang Qi, raises the Clear Yang due to abnormal descent of Qi."]},{"herb":"QingHao","dosage":"30g","actions":["Clears Summerheat or Damp-Heat, clears Deficiency fevers, cools the Blood, clears Liver Heat and stops malarial disorders."]},{"herb":"ShengDiHuang","dosage":"24g","actions":["Clears Heat, cools the Blood, nourishes Yin and cools Heart Fire.","With Bai Shao, for Blood Deficiency Heat."]}],"actions":["Disperses Wind-Heat","Clears Heat","Relieves toxicity","Expels turbid filth","Harmonizes the Middle Jiao","Invigorates and cools the Blood","Clears Summerheat or Damp-Heat","Promotes the movement of Qi","Tonifies Qi and Blood","Strengthens the Spleen","Raises the Yang Qi","Nourishes Lung and Stomach Yin","Moistens the Intestines","Unblocks the bowels"],"syndromes":["Gu Syndrome due to Excess Fire"],"manifestations":{"symptoms":["Bloating","Swelling","Depression","Flu-like symptoms Coughing Sneezing","A tight abdominal wall","Dark urine","The patient usually gets worse after ingesting tonics","Epilepsy","Madness"]},"conditions":[{"condition":"GuSyndrome","name":"Gu syndrome "},{"condition":"Psychosis","name":"Madness"}],"contra":{"contraindications":["Contraindicated for those with a constitutional Spleen and Stomach Cold condition who has contracted Gu for the second or third time.","Contraindicated for those who has taken Su He Tang for a long time and have already cleared all of the Gu poison.","Symptoms of overdose: restlessness, distress, vomiting or diarrhea."],"interactions":[""]},"notes":["The formula needs to be administered in unusually high amounts to be fully effective.","Gradually work up to the full daily amount over a period of 5-6 doses.","Work up to 50- 120g of crude herbs or the equivalent in herbal granules per day.","Treatment should be sustained over a period of 3-9 months."],"modifications":[{"purpose":"a stronger effect","modifications":[{"herb":"SanQi","modification":"+ 6g Rx. Notoginseng"}]}]}