{"formula":"SuLingZhu","names":{"pinyin":"su ling zhu","commonEnglish":"","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"1-9g","actions":["Powerfully tonifies Yuan Qi and treats impotence.","With Shu Di Huang, for Qi and Yin Deficiency and severe Qi and Blood Deficiency due to loss of Blood.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness.","With Shu Di Huang, Bai Shao, Bai Zhu, and Fu Ling, for Qi and Blood Deficiency."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and calms the fetus.","With Shu Di Huang and Bai Shao, for restless fetus due to Blood Deficiency, often with palpitations.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Shu Di Huang, Dang Gui and Gan Cao, for unstable pregnancy with Blood Deficiency."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ren Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood and regulates menstruation.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold,stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Bai shao and Fu Ling, for diarrhea during pregnancy with mild abdominal pain."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Ren Shen, Bai Zhu, Fu Ling, Dang Gui and Bai Shao, for anemia with fatigue and weakness."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver, benefits the Kidneys and Spleen and calms the fetus.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing and nourishes Kidney Yin."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, aids the smooth flow of Qi and Blood, tonifies Kidney Yang and calms the fetus."]},{"herb":"LuRong","dosage":"3-5g","actions":["Tonifies the Kidneys, strengthens Yang regulates the Chong and Ren channels, stabilizes the Dai Channel, tonifies the Du Channel, strengthens Jing and Blood, strengthens the sinews and bones, benefits marrow and tonifies and nourishes Qi and Blood.","With Ren Shen and Dang Gui, for palpitations, low back pain, and decreased and difficult urination due to severely deficient Heart and Kidneys and increases Leuteinizing hormone.","With Shu Di Huang, for impotence and spermatorrhea in men and infertility and thin vaginal discharge in women due to Kidney Deficiency Cold.","With Ren Shen, strongly tonifies Qi and strongly warms the Ming Men to generate Qi, benefits Qi , Blood, Yin , Yang and Jing to treat congenital insufficiency or post natal consumption."]},{"herb":"ChuanJiao","dosage":"2-7g","actions":["Warms the Middle Jiao, disperses Cold, dispels Dampness, relieves diarrhea, and alleviates pain."]}],"actions":["Nourishes the Kidney Yin and Yang","Generates Blood","Regulates the Chong and Ren channels","Supports the Liver","Augments Jing","Nourishes the uterus"],"syndromes":["Kidney Yin and Yang Deficiency"],"manifestations":{"symptoms":["Long-term infertility","Early menstruation","Irregular periods","Decreased menses with light colored Blood and no blood clots","Emaciation","Dizziness","Night sweating","Blurred vision","Palpitations","Insomnia","Tinnitus","Hearing loss","A weak lower body","Five sole Heat or","Low-grade fever in the afternoon","Back soreness","Dry mouth","Dry bowl movements","Increased clear urine","Loose stools","Feeling cold","Depression","Cold limbs","Frequent urination","Long-drawn-out urination with a thin stream or dribbling","Fatigue","Pain and coldness in loin and knees"],"tongue":"Red or Pale, swollen and wet","tongueCoat":"Little or None or White","pulse":"Thready and rapid or Floating and Empty or Deep and weak or Thin and soft or Deep and thready"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}