{"formula":"TaoHongErChenTangJiaWei","names":{"pinyin":"tao hong er chen tang jia wei","hanzi":"桃红二陈汤加味","english":"modified decoction of two old drugs with safflower and peach pit","commonEnglish":"Modified Decoction of two Old Drugs with Safflower and Peach Pit","aka":[""]},"herbs":[{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for Phlegm-Damp Obstruction.","With Zhi Ban Xia and Fu Ling, for cough due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, dissipates nodules and reduces Stagnation.","With Xia Ku Cao, for Phlegm-Heat induced insomnia."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and transforms Phlegm.","With Zhi Ban Xia, treats Phlegm, thin mucus and turbid Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids"]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi.","With Dang Gui, tonifies the Blood and moves Qi."]},{"herb":"ZheBeiMu","dosage":"9g","actions":["Clears Heat, transforms Phlegm and dissipates nodules."]},{"herb":"ChenPi","dosage":"9g","actions":["Promotes the movement of Qi, dissipates clumps and stops pain."]},{"herb":"XiaKuCao","dosage":"9g","actions":["Clears Hot Phlegm and dissipates nodules.","With Zhi Bei Mu, cools and relieves toxicity to disperse and transform Phlegm."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"DanShen","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability cools the Blood and reduces abscesses."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chen Pi and Zhi Ban Xi, for Lung and Kidney Yin Deficiency with overflowing water turning to Phlegm, with cough, wheezing, nausea marked by profuse and salty sputum."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies and cools the Blood."]},{"herb":"LianQiao","dosage":"9g","actions":["Clears Heat (especially in the Upper Jiao), relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat."]},{"herb":"PiPaYe","dosage":"9g","actions":["Transforms Phlegm, harmonizes the Stomach,clears Lung and Stomach Heat and descends Lung and Stomach Qi.","With Huang Qin and Xiang Fu, for Stomach-Heat induced vomiting and belching.","With Zhi Ban Xia, alleviates nausea and calms the Stomach."]},{"herb":"GanCao","dosage":"6g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Clears Heat","Resolves Phlegm","Invigorates the Blood","Disperses Stagnation"],"syndromes":["Phlegm-Heat with Blood Stagnation"],"manifestations":{"symptoms":["The lesions last for a long time","The lesions are mostly on the face, neck and mandibular regions","Purple scars","Papules pustules and nodules are like beans or","Local inflammation with pus","Irregular menstruation with clots","Chest pain","Dry mouth","Rapid breathing with a harsh voice","Cough with difficult expectoration of thick yellow sputum or","Odorous or bloody sputum","Constipation"],"tongue":"Red tongue or Red with echymosis or Purple with echymosis or maculae","tongueCoat":"Yellow or Yellow and greasy","pulse":"Rapid and smooth or Choppy or Wiry"},"conditions":[{"condition":"AcneVulgaris","name":"Acne"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}