{"formula":"TaoRenCongRongWan","names":{"pinyin":"tao ren cong rong wan","hanzi":"桃仁苁蓉丸","english":"persica and cistanches pill","commonEnglish":"Persica and Cistanches Pill (Golden Flower)","aka":[""]},"herbs":[{"herb":"RouCongRong","dosage":"17g","actions":["Moistens the Intestines and facilitates the passage of stool.","With Dang Gui, for constipation in the elderly with insufficiency of Yin and Blood."]},{"herb":"DaHuang","dosage":"14g","actions":["Drains Heat, purges accumulations, invigorates the Blood and dispels Blood Stasis.","With Dang Gui, for Blood Stasis."]},{"herb":"DangGui","dosage":"12g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines and unblocks the bowels.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Rou Cong Rong, for constipation due to Dryness of the Intestines."]},{"herb":"BaiZiRen","dosage":"9g","actions":["Moistens the Intestines and unblocks the bowels."]},{"herb":"ZhiShi","dosage":"8g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels and removes Stagnant Food.","With Da Huang, for constipation and abdominal swelling due to Food Stagnation and Qi Stagnation.","With Bai Shao, for abdominal pain due to Qi and Blood Stagnation.","With Zhi Ke,strongly promotes Qi flow and breaks up clumps, unblocks both upper and lower parts of the trunk to stop wheezing due to Phlegm,eliminate focal distention and alleviate tenesmus."]},{"herb":"HouPo","dosage":"8g","actions":["Promotes the movement of Qi in the Middle Jiao and resolves Stagnation.","With Zhi Shi, for abdominal distention, focal epigastric distention, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem.","With Zhi Shi and Da Huang, for relatively severe accumulation and Stagnation with abdominal distention and pain and constipation.","With Zhi Ke, for abdominal distention due to Qi and Food Stagnation.","With Xing Ren, for Middle Jiao Dampness with epigastric and abdominal distention and a feeling of fullness."]},{"herb":"TaoRen","dosage":"8g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines and unblocks the bowels.","With Da Huang, for severe abdominal infection.","With Xing Ren, for constipation due Lung Qi Stagnation."]},{"herb":"XingRen","dosage":"6g","actions":["Moistens the Intestines and unblocks bowels."]},{"herb":"BaiShao","dosage":"6g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind, softens the Liver and relieves pain.","With Gan Cao, for abdominal pain due to disharmony between the Liver and Stomach.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ZhiKe(Qiao)","dosage":"6g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"GanCao","dosage":"6g","actions":["Moderates spasms, alleviates pain and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Moistens the Intestines","Promotes bowel movement","Moves Qi"],"syndromes":["Constipation from exhaustion of Fluids or Dryness"],"manifestations":{"symptoms":["Constipation","Constipation with hard stools","Pain with sensation of bowel movement incomplete"],"tongue":"Dry","tongueCoat":"Yellow","pulse":"Floating, deep and rapid or Deep, rapid and choppy"},"conditions":[{"condition":"Constipation","name":"Constipation"},{"condition":"IrritableBowelSyndrome","name":"IBS-C"}],"contra":{"contraindications":["Contraindicated for those with Spleen Qi0Ddeficiency or Spleen-Damp conditions.","Contraindicated during pregnancy.","Contraindicated while nursing."],"interactions":[""]},"notes":[""],"modifications":[]}