{"formula":"TaoYiShenHongTang","names":{"pinyin":"tao yi shen hong tang","hanzi":"桃益参红汤","english":"persica, leonurus, salvia and carthamus decoction","commonEnglish":"Persica, Leonurus, Salvia and Carthamus Decoction","aka":[""]},"herbs":[{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood, reduces abscesses, nourishes the Blood and calms the Spirit.","With Dang Gui, Chuan Xiong and Hong Hua, for External or traumatic injury with pain and bruising.","With Hong Hua, Tao Ren and Yi Mu Cao, for abdominal pain with irregular menstruation due to Blood Stasis."]},{"herb":"JiXueTeng","dosage":"15g","actions":["Invigorates and tonifies the Blood, activates the channels and relaxes the sinews."]},{"herb":"ZeLan","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, promotes urination and disperses swellings.","With Chuan Xiong, for pain due to trauma.","With Dan Shen, for swelling and pain due to trauma.","With Yi Mu Cao, for disorders which include both Blood Stasis and accumulation of pathogenic water.","With Chuan Xiong, Dang Gui, Hong Hua and Tao Ren, for pain and bruises.","With Dan Shen and Yu Jin, for chest and hypochondriac pain due to Qi and Blood Stagnation.",""]},{"herb":"YuJin","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores and alleviates pain."]},{"herb":"YiMuCao","dosage":"9g","actions":["Invigorates the Blood, dispels Stasis, reduces masses, promotes urination and reduces swelling and edema.","With Dang Gui, for Blood Stasis."]},{"herb":"SuMu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, reduces swellings, opens the channels and alleviates pain.","With Hong Hua, for traumatic injury with painful, swollen bruises or hematomas."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, regulates Qi, expels Wind-Cold and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis.","With Dang Gui, Tao Ren and Hong Hua, for pain due to trauma."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes the Blood.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation.","With Dang Gui, Chi Shao and Hong Hua, for trauma with pain."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Su Mu and Dang Gui, for trauma with pain and swelling.","With Yi Mu Co and Tao Ren, for Blood Stasis with abdominal pain.","With Tao Ren, for Blood Stasis."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses.","With Chuan Xiong and Dang Gui, for abscesses, boils, and trauma induced pain.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood, disperses Blood Stasis and treats abdominal pain.","With Tao Ren and Hong Hua, for pain, swelling and other symptoms associated with Blood Stasis."]}],"actions":["Disperses Wind-Cold-Dampness","Stops Bi pain","Moves Qi","Invigorates the Blood"],"syndromes":["Wind-Cold-Damp Generating Qi and Blood Stagnation"],"manifestations":{"symptoms":["Numbness and heaviness of the extremities","Soreness and fixed pain of joints","Stiffness or numbness of the muscles or skin","Pain worse on cloudy or rainy days","Maybe peripheral or systemic edema","Pain is alleviated by pressure and warmth","Pain lingers and is recalcitrant to treatment","Worse during cloudy or wet weather","Limited movement","Edema","Maybe stifling sensation in chest","Maybe anorexia or indigestion","Maybe abdominal distention","Maybe loose or semi-liquid stools","Muscle aches","Radiating pain in the legs","Low back pain","Numbness in the lower extremities","Pain in the trunk and extremities","Abdominal pain","Sciatica","Aversion to Wind and Cold","Knee pain"],"tongue":"Pale or Pink with purple spots","tongueCoat":"Normal or Greasy and white","pulse":"Choppy or Taut"},"conditions":[{"condition":"Scleroderma","name":"Scleroderma"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}