{"formula":"TianChongHuaJianTang","names":{"pinyin":"tian chong hua jian tang","hanzi":"窴揰化坚汤","english":"regulate the chong and soften hard masses decoction","commonEnglish":"Regulate the Chong and Soften Hard Masses Decoction","aka":[""]},"herbs":[{"herb":"DuZhong","dosage":"10g","actions":["Tonifies the Kidneys and Liver and aids the smooth flow of Qi and Blood.","With Bai Shao and Xia Ku Cao, for dizziness and light-headedness due to Rising Liver Yang."]},{"herb":"GouQiZi","dosage":"10g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"XiaKuCao","dosage":"15g","actions":["Clears Liver Fire, clears Hot Phlegm and dissipates nodules."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood, reduces abscesses, nourishes the Blood and calms the Spirit."]},{"herb":"ZeLan","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates menstruation and disperses swellings."]},{"herb":"QingPi","dosage":"10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm."]},{"herb":"MuLi","dosage":"10g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness and dissipates nodules."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat, cools the Blood and relieves pain.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation."]},{"herb":"BaiShao","dosage":"10g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Gan Cao, for epigastric, hypochondriac or flank pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"GanCao","dosage":"5g","actions":["Resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Harmonizes the Chong and Ren","Softens hardness","Resolves lumps"],"syndromes":["Disharmony between the Chong and Ren Channels"],"manifestations":{"symptoms":["Breast distention and pain before and during menses","Pain in the breast and nipple","Dislike of having them covered","Small nodules","Epigastric pain (worse when emotionally upset)","Belching with acid regurgitation","Nausea/vomiting","Anorexia","Epigastric distention","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Scanty menstruation","Dysmenorrhea","Maybe amenorrhea","Maybe infertility"],"tongue":"Pink","tongueCoat":"Thin and white","pulse":"Wiry and thready"},"conditions":[{"condition":"FibrocysticBreastDisease","name":"Fibrocystic breast disease"},{"condition":"Amenorrhea","name":"Amenorrhea"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}