{"formula":"TianXianTengSan","names":{"pinyin":"tian xian teng san","hanzi":"天仙藤散","english":"caulis aristolochiae debilis powder","commonEnglish":"Caulis Aristolochiae Debilis Powder","aka":[""]},"herbs":[{"herb":"MaDouLing","dosage":"3-9g","actions":["Regulates Qi, transforms Dampness, invigorates the Blood and stops pain."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Zi Su Ye, for nasal congestion, epigastric and abdominal distention and discomfort associated with externally contracted disorders."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Sheng Jiang, for vomiting and hiccups due to Cold-Dampness Obstructing the Middle."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"WuYao","dosage":"3-10g","actions":["Promotes movement of Qi, Warms the Kidneys, disperses Cold and alleviates pain.","With Xiang Fu, unblocks Qi in both the Qi and Blood levels, releases constraint from the Liver and Gallbladder, descends Qi in the chest and abdomen and warms Qi which has been slowed by pathogenic Cold."]},{"herb":"ShengJiang","dosage":"1-10g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Middle, stops vomiting and normalizes the flow of Qi at the center."]},{"herb":"MuGua","dosage":"2-12g","actions":["Harmonizes the Stomach, transforms Dampness, increases Qi and Blood circulation and unblocks the channels."]},{"herb":"ZiSuYe","dosage":"3-10g","actions":["Releases the Exterior, disperses Cold, promotes the movement of Spleen and Stomach Qi, calms the fetus and alleviates morning sickness.","With Xiang Fu and Chen Pi, for Wind-Cold with Qi Stagnation and chest congestion."]}],"actions":["Calms the fetus","Eliminates edema due to Qi Stagnation"],"syndromes":["Edema during pregnancy due to Qi Stagnation"],"manifestations":{"symptoms":["Edema during pregnancy",""]},"conditions":[{"condition":"EdemaDuringPregnancy","name":"Edema during pregnancy "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}