{"formula":"TiaoJingZhongYuTang","names":{"pinyin":"tiao jing zhong yu tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"XiangFu","dosage":"15g","actions":["Spreads, regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]},{"herb":"BaiShao","dosage":"10g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and alleviates pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShuDiHuang","dosage":"10g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle and relieves the diaphragm."]},{"herb":"WuZhuYu","dosage":"9g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi, relieves Stagnation in the Liver channel, alleviates pain Spreads the Liver, and descends rebellious Qi."]},{"herb":"MuDanPi","dosage":"12g","actions":["Invigorates the Blood and dispels Blood Stasis."]},{"herb":"YanHuSuo","dosage":"12g","actions":["Invigorates the Blood, circulates Qi, stops pain and disperses extravasation.","With Xiang Fu and Dang Gui, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Xiang Fu, treats a wide range of application from Liver Qi Stagnation to deep Blood Stasis and a wide variety of pain anywhere in the body including chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorders in the lower body and dysmenorrhea from Qi and Blood Stagnation.","With Dang Gui, Chuan Xiong, Bai Shao and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao."]},{"herb":"ShengJiang","dosage":"6g","actions":["Reduces the toxicity of the other herbs."]}],"actions":["Dredges the Liver","Supplements the Kidneys"],"syndromes":["Liver Qi Stagnation with Kidney Deficiency"],"manifestations":{"symptoms":["Infertility","Irregular menstruation","Breast and hypochondria pain"],"pulse":"Taut"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"early menstruation with excessive Blood of a purple red color, a wiry, rapid pulse with a red tongue, and a yellow coat","modifications":[{"herb":"WuZhuYu","modification":"- Fr. Evodiae"},{"herb":"ShengJiang","modification":"- Rz. Zingiberis Recens"},{"herb":"ShengDiHuang","modification":"+ 15g Rx. Rehmanniae"},{"herb":"HuangQin","modification":"+ 10g Rx. Scutellariae"},{"herb":"ZhiZi","modification":"+ 10g Stir-fried Fr. Gardeniae"}]},{"purpose":"late menstruation with scanty Blood of a black color, abdominal pain which likes pressure, a deep, slow pulse, and a dark, pale tongue with a white coating","modifications":[{"herb":"GuiZhi","modification":"+ 9g Ram. Cinnamomi"},{"herb":"AiYe","modification":"+ 9g Stir-fried Fol. Artemisiae Argyi"},{"herb":"WuYao","modification":"+ 9g Rx. Linderae"}]},{"purpose":"irregular menstruation, premenstrual breast distention and pain, a deep, wiry pulse, a red tongue with a white coating","modifications":[{"herb":"ZhiKe(Qiao)","modification":"+ 15g Fr. Aurantii"},{"herb":"ChenPi","modification":"+ 12g Sm. Citri Reticulatae"}]},{"purpose":"severe abdominal distention and pain during menstruation with a deep wiry pulse","modifications":[{"herb":"MaiYa","modification":"+ 15g Fr. Hordei Germinatus"},{"herb":"MuXiang","modification":"+ 10g Rx. Aucklandiae"},{"herb":"BingLang","modification":"+ 10g Sm. Arecae"},{"herb":"LiZhiHe","modification":"+ 12g Sm. Litchi"},{"herb":"TaoRen","modification":"+ 10g Sm. Persicae"},{"herb":"HongHua","modification":"+ 10g Flos Carthami"},{"herb":"ZeLan","modification":"+ 10g Hb. Lycopi Lucidi"},{"herb":"WuLingZhi","modification":"+ 10g Feces Trogopterori"}]},{"purpose":"abdominal pain during menstruation which refuses pressure, a wiry, choppy pulse, and a red tongue with a white coat","modifications":[{"herb":"ChuanShanJia","modification":"+12g Squama Manitis"},{"herb":"WangBuLiuXing","modification":"+ 12g Sm. Vaccariae"}]},{"purpose":"scanty menstruation which dribbles and drips without cease, a rapid pulse, and a red tongue with a white coat","modifications":[{"herb":"GuiBan","modification":"+ 15g Plastrum Testudinis"},{"herb":"MuLi","modification":"+15g Concha Ostreae"},{"herb":"HaiPiaoXiao","modification":"+ 15g Endoconcha Sepiae"}]},{"purpose":"Kidney Jing Insufficiency with Kidney Qi Deficiency, a fine pulse with a pale tongue and thin, white coat","modifications":[{"herb":"GouQiZi","modification":"+ 15g Fr. Lycii"},{"herb":"TuSiZi","modification":"+ 15g Sm. Cuscutae"},{"herb":"FuPenZi","modification":"+ 15g Fr. Rubi"},{"herb":"WuWeiZi","modification":"+ 9g Fr. Schisandrae"},{"herb":"CheQianZi","modification":"+ 9g Sm. Plantaginis"}]}]}