{"formula":"TiaoJingZhongZiFang","names":{"pinyin":"tiao jing zhong zi fang","hanzi":"调精种子方","english":"harmonize jing seed formula","commonEnglish":"Harmonize Jing Seed Formula","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Xiang Fu and Yan Hu Suo, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Invigorates the Blood for Blood Deficiency coupled with Blood Stasis or Cold."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Sheng Jiang, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]},{"herb":"AiYe","dosage":"3-10g","actions":["Warms the channels, warms the womb, stops bleeding, calms the fetus, disperses Cold and alleviates pain.","With Gan Jiang, for abdominal and menstrual pain due to Cold and prolonged uterine bleeding.","With Xiang Fu, for abdominal pain from Deficiency Cold and Stagnant Qi.","With Xiang Fu, Bai Shao, Chuan Xiong and Dang Gui, for Deficiency Cold of the Lower Jiao with Cold and pain and irregular menstruation with pain."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"GanCao","dosage":"3-14g","actions":["Tonifies the Spleen,d augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Dang Gui, Chuan Xiong, Bai Shao and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood and dispels Blood Stasis."]},{"herb":"ShanZhuYu","dosage":"6-12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin, strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, warms the channels and stops bleeding."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea.","With Rou Gui, for irregular menstruation with Cold in the Blood."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain and assists in the generation of Qi and Blood.","With Dang Gui and Chuan Xiong, for dysmenorrhea, postpartum abdominal pain or amenorrhea due to Deficiency Cold of the Chong and Ren channels."]},{"herb":"ShengJiang","dosage":"1-10g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei and normalizes the flow of Qi at the center.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccups."]},{"herb":"DaZao","dosage":"10-30g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit, moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, nourishes the Blood, prevents injury from harsh Blood movers and assists the movement of Qi and enhances the effects of other Qi and Blood tonifying herbs by facilitating their digestion and absorption."]}],"actions":["Nourishes the Blood","Nourishes Jing","Strengthens the Liver and the Kidneys","Warms the Uterus"],"syndromes":["Blood Deficiency with a cold Uterus"],"manifestations":{"symptoms":["Infertility","Delayed cycle","Scanty periods","Pale Blood","Maybe copious, watery menses","Maybe amenorrhea","Insidious pain after menstruation","Cold lower abdominal cramping and pain","Tiredness","Withered, sallow complexion","Depression","Dizziness","Palpitations","Breathlessness","Pale complexion","Blurred vision","Insomnia","Poor memory","Dry skin","Constipation","A thin, weak body"],"tongue":"Pale and thin","tongueCoat":"Little or Thin and white","pulse":"Choppy or Fine or Thin and soft"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}