{"formula":"TiaoGanPiHeCuanLianZiSanJiaJian","names":{"pinyin":"tiao gan pi he chuan lian zi san jia jian","hanzi":"调肝脾和川楝子散加減","english":"modified regulate the liver and spleen and fructus toosendan powder","commonEnglish":"Modified Regulate the Liver and Spleen and Fructus Toosendan Powder","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi and relieves Stagnation."]},{"herb":"ZhiShi","dosage":"3-10g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food and transforms Phlegm.","With Da Huang, for diarrhea, dysentery and abdominal pain due to Damp-Heat."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Da Huang, for chronic accumulation in the abdomen, blockage of urine, constipation, Qi rushing upward to the Heart, abdominal distention and rebellious damage from food and drink."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation, stops pain and conducts Heat out from below.","With Yan Hu Suo, for intermittent epigastric and hypochondriac pain, hernia pain or menstrual pain with irritability due to Liver Stagnation with Heat."]},{"herb":"HongTeng","dosage":"9-30g","actions":["Clears Heat, resolves toxicity, stops pain, invigorates the Blood and disperses Stasis.","With Bai Jiang Cao and Gan Cao, drains Dampness and dispels excessive vaginal discharge."]},{"herb":"BaiJiangCao","dosage":"6-30g","actions":["Clears Heat, resolves toxicity, expels pus, eliminates Phlegm, invigorates the Blood and dispels Blood Stasis.","With Chi Shao, for abdominal pain and fever due to postpartum Blood Stasis."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Drains Heat, purges accumulations, transforms Dampness, promotes urination, invigorates the Blood and dispels Blood Stasis.","With Gan Cao, for vomiting immediately after eating."]},{"herb":"LuLuTong","dosage":"3-10g","actions":["Promotes the movement of Qi, invigorates the Blood, opens the Middle Jiao, unblocks the channels and promotes water metabolism."]},{"herb":"QuanShen","dosage":"4.5-18g","actions":["Clears Heat, resolves toxicity and resolves Phlegm."]}],"actions":["Clears Heat","Eliminates Dampness","Invigorates the Blood","Dispels Stasis"],"syndromes":["Blood Stagnation with Damp-Heat"],"manifestations":{"symptoms":["Early menses","Scant amount","Purplish-red with clots","Lower abdominal distention and pain, especially along the sides of the abdomen","Dislike of pressure","Stabbing pain in the lower abdomen","Breast distention and pain","Abdominal pain which becomes worse as the period approaches","Chest and flank distention and pain","Emaciation","Chronic lumbar soreness","Possible low-grade fever","Possible abnormal vaginal discharge which is yellow and foul-smelling"],"tongue":"Red","tongueCoat":"Thin and yellow","pulse":"Wiry and rapid"},"conditions":[{"condition":"conditions/Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}