{"formula":"TiaoJingZhongZiTang","names":{"pinyin":"tiao jing zhong zi fang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Xiang Fu and Yan Hu Suo, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Invigorates the Blood for Blood Deficiency coupled with Blood Stasis or Cold."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Sheng Jiang, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Dang Gui, Chuan Xiong, Bai Shao and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood and dispels Blood Stasis."]},{"herb":"ShanZhuYu","dosage":"6-12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin,strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"ShengJiang","dosage":"1-10g","actions":["Warms the Middle, stops vomiting, adjusts the Ying and Wei and normalizes the flow of Qi at the center.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccups."]}],"actions":["Nourishes the Yin","Nourishes Jing","Strengthens the Liver and the Kidneys","Regulates Qi","Resolves Phlegm"],"syndromes":["Liver and Kidney Yin Deficiency with Qi Stagnation and Phlegm-Dampness"],"manifestations":{"symptoms":["Facial complexion pale and sallow","Both cheeks slightly red","Dizziness","Dry eyes","Blurred vision","Spots before the eyes","Numbness of limbs","Flaccid paralysis (Wei syndrome), weakness","Tinnitus","Deafness","Forgetfulness","Low back and knees sore and painful","Throat dry and painful","Five Sole Heat","Low-grade fever","Night sweats","Irritability","Insomnia","Stools difficult to pass","Constipation","Irregular menses or","Scanty menses or","Amenorrhea","Vaginal discharge","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Anorexia","Edema","Abdominal distention","Chest and hypochondriac distention","Nausea","Vomiting","Vertigo","Thirst with no desire to drink","Maybe no thirst","Palpitations","Shortness of breath"],"tongue":"Pink or Red","tongueCoat":"None or Thin and white or Thick and slippery","pulse":"Thready and rapid or Wiry or Slippery, full and maybe wiry"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"early menstruation with purplish Blood","modifications":[{"herb":"HuangQin","modification":"+ Rx. Scutellariae"}]},{"purpose":"late menstruation with pale Blood","modifications":[{"herb":"RouGui","modification":"+ Cx. Cinnamomi"},{"herb":"GanJiang","modification":"+ Rz. Zingiberis"},{"herb":"AiYe","modification":"+ Fol. Artemisiae Argyi"}]}]}