{"formula":"TiaoZhongYi%20QiTang","names":{"pinyin":"tiao zhong yi qi tang","hanzi":"调中益气汤","english":"regulate the middle to augment qi decoction","commonEnglish":"Regulate the Middle to Augment Qi Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"12-20g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach and tonifies the Lungs.","With Ren Shen or Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweating."]},{"herb":"RenShen","dosage":"9-12g","actions":["Tonifies Spleen, Stomach Qi and Lung Qi.","With Huang Qi and Chai Hu, for Qi Deficiency with various types of prolapse due to Sinking of the Clear Yang.","With Huang Qi, for Lung Qi Deficiency."]},{"herb":"DangShen","dosage":"(18-27g)","actions":["(Substitutes for Ren Shen.)"]},{"herb":"CangZhu","dosage":"9-12g","actions":["Strongly dries Dampness and tonifies the Spleen."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, stops coughing, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency."]},{"herb":"MuXiang","dosage":"6-9g","actions":["Promotes the movement of Qi, alleviates pain, strengthens the Spleen and prevents Stagnation."]},{"herb":"ChenPi","dosage":"6-9g","actions":["Regulates Qi, adjusts the Middle, descends Qi, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"ShengMa","dosage":"3-6g","actions":["Raises Yang and lifts sunken Qi.","With Chai Hu, for chronic dysenteric disorders, rectal prolapse, and uterine prolapse due to Yang Deficiency."]},{"herb":"ChaiHu","dosage":"3-6g","actions":["Raises Yang Qi, specifically the Clear Qi of the Stomach and Gallbladder.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi and Sheng Ma, for Central Qi Sinking.","With Sheng Ma, for coughing with difficult to expectorate Phlegm and chronic bronchitis."]}],"actions":["Leeches out Dampness","Strengthens the Spleen and Stomach"],"syndromes":["Spleen Qi Deficiency with Dampness"],"manifestations":{"symptoms":["A sensation of heaviness in the body","Irritability","Pain in the joints","Difficulty flexing and extending the joints","Loss of appetite","Inability to rest soundly or","Hypersomnia","A sensation of fullness in the chest","Shortness of breath","Coughing with sticky sputum","Frequent, clear urination","Frequent diarrhea or","Constipation"],"tongue":"Pale","tongueCoat":"White and maybe sticky","pulse":"Flooding, moderate and wiry that is choppy when pressed hard"},"conditions":[{"condition":"Dyspnea","name":"Dyspnea"},{"condition":"Constipation","name":"Constipation"},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}