{"formula":"TongXuanLiFeiWan","names":{"pinyin":"tong xuan li fet wan","hanzi":"通宣理肺丸","english":"ventilating lung pills","commonEnglish":"Ventilating Lung Pills","aka":[""]},"herbs":[{"herb":"ZiSuYe","dosage":"15g","actions":["Releases the Exterior, disperses Cold, promotes the movement of Spleen and Stomach Qi, improves Lung function, expands the chest and relieves Cold induced wheezing.","With Jie Geng, for common colds with nasal congestion and a productive cough.","With Jie Geng, Qian Hu and Xing Ren. for common colds with nasal congestion, lack of sweat and a productive cough with a stronger cough alleviating effect.","With Jie Geng and Zhi Ke, eases the diaphragm and Intestines."]},{"herb":"HuangQin","dosage":"10g","actions":["Clears Heat and dries Dampness.","With Ma Huang and Xing Ren, for coughing with wheezing or dyspnea."]},{"herb":"ZhiKe(Qiao)","dosage":"10g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"GanCao","dosage":"6g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ma Huang and Xing Ren, for coughing or wheezing due to Wind-Cold Attacks the Lungs.","With Jie Geng, for pain and swelling of the throat."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction or Spleen Qi Deficiency.","With Zhi Ban Xia and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"6g","actions":["Dries Dampness and transforms Phlegm.","With Huang Qi, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"JieGeng","dosage":"10g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat and raises Lung Qi, directing the effects of other herbs to the upper body.","With Zi Su Ye, Xing Ren and Chen Pi, for a productive cough with clear, bubbly sputum, nasal congestion, chills and headache due to Wind-Cold Invading the Lungs.","With Zhi Ban Xia, for coughing due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]},{"herb":"XingRen","dosage":"6g","actions":["Stops coughing and calms wheezing.","With Zhi Ban Xia, Zi Su Ye and Fu Ling, for a dry cough due to Wind-Cold.","With Ma Huang, for coughing and wheezing due to Excess.","With Ma Huang and Gan Cao, for coughing with profuse sputum, nasal obstruction and a hoarse voice.",""]},{"herb":"FuLing","dosage":"10g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Zhi Ban Xia, for Phlegm, thin mucus and turbid Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids."]},{"herb":"QianHu","dosage":"10g","actions":["Expels Phlegm and descends Qi."]},{"herb":"MaHuang","dosage":"10g","actions":["Induces sweating, releases the Exterior, disseminates and facilitates Lung Qi, calms wheezing, stops coughing and warms and disperses Cold pathogens.","With Xing Ren, for Wind-Cold coughing and wheezing."]}],"actions":["Expels Wind","Dispels Cold","Ventilates the Lungs","Resolves Phlegm"],"syndromes":["Wind-Cold Attacks the Lungs"],"manifestations":{"symptoms":["Itching or tickling in the throat","Cough with expectoration of thin, watery or frothy white sputum","Chills with low grade fever","Tightness in the chest","Anhidrosis","No thirst","Headache","Aversion to Wind","Blocked and / or runny nose with clear, watery nasal discharge","Sneezing","General body aches","Maybe asthma"],"tongue":"Pink","tongueCoat":"Thin, white and moist","pulse":"Superficial and tight"},"conditions":[{"condition":"Cough","name":"Cough"},{"condition":"Asthma","name":"Bronchial asthma"},{"condition":"Bronchitis","name":"Bronchitis"},{"condition":"Bronchiectasis","name":"Bronchiectasis"},{"condition":"Pneumonia","name":"Pneumonia"},{"condition":"Emphysema","name":"Emphysema"},{"condition":"COPD","name":"COPD"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}