{"formula":"TongJingFang","names":{"pinyin":"tong jing fang","hanzi":"痛经方","english":"alleviate dysmenorrhea formula","commonEnglish":"Alleviate Dysmenorrhea Formula","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Dan Shen and Mo Yao, for pain due to Blood Stasis in the extremities.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Wu Ling Zhi, Pu Huang and Yan Hu Suo, for dysmenorrhea due to Deficiency Cold."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Dang Gui, for irregular menstruation and retained lochia from Blood Stasis."]},{"herb":"ChuanNiuXi","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the menses, tonifies the Kidneys and Liver and strengthens the tendons and bones."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Chuan Xiong, Dang Gui and Pu Huang, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain.","With Xiang Fu, for flank pain, abdominal pain and dysmenorrhea due to Qi and Blood Stagnation."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Dang Gui and Chuan Xiong, for irregular menstruation due to Yang Deficiency with Cold Stagnation."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi,regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea"]},{"herb":"YanHuSuo","dosage":"3-20g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Wu Ling Zhi, for chest and abdominal pain due to Blood Stagnation.","With Xiang Fu and Dang Gui, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Dang Gui and Gui Zhi, for dysmenorrhea due to Cold in the Blood."]},{"herb":"XueJie","dosage":"0.3-0.6g","actions":["Invigorates the Blood, dispels Blood Stasis and alleviates pain."]},{"herb":"MoYao","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling.","With Yan Hu Suo, Wu Ling Zhi and Xiang Fu, for Qi and Blood Obstruction causing epigastric and abdominal pain.","With Xiang Fu and Yan Hu Suo, for chest and epigastric pain due to Qi and Blood Stagnation."]},{"herb":"WuLingZhi","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis and","alleviates pain.","With Yan Hu Suo and Mo Yao, for chest, epigastric and abdominal pain due to Qi Stagnation and Blood Stasis."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Wu Ling Zhi, for Blood Stasis causing menstrual irregularity, dysmenorrhea and lochiostasis with chest and abdominal pain."]}],"actions":["Invigorates the Blood","Breaks up Stasis","Moves Qi","Alleviates pain"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe or","Pains that move around","Distending sensation of the breasts and abdomen","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of the skin in small or large areas","Varicose and spider veins","Cold hands and feet","Lower abdominal pain before, during and after menstruation which may be severe","Tendency to hemorrhage dark blood or clots"],"tongue":"Dark or Purple, possible purple or red spots Red purple if there is Heat Blue purple if there is Cold","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"Endometriosis","name":"Endometriosis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}