{"formula":"TongZhuYuTangJiaJian","names":{"pinyin":"tong zhu yu tong jia jian","hanzi":"痛茱萸汤加減","english":"modified body pain dispel stasis decoction","commonEnglish":"Modified Body Pain Dispel Stasis Decoction","aka":[""]},"herbs":[{"herb":"XuDuan","dosage":"12g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, promotes the movement of Blood, alleviates pain, generates flesh and reconnects the sinews and bones."]},{"herb":"GuSuiBu","dosage":"9g","actions":["Tonifies Kidney Yang, strengthens the sinews and bones, invigorates the Blood and helps regain strength after injuries.","With Xu Duan, for injury to the muscles, sinews and bones by trauma."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for a Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis.","With Dang Gui, Tao Ren and Hong Hua, for pain due to trauma."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"QiangHuo","dosage":"9g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction."]},{"herb":"RuXiang","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels and alleviates pain.","With Qiang Huo and Qing Jiao, for joint pain due to Wind-Cold-Damp Bi."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood.","With Xiang Fu, tonifies the Blood and moves Qi."]},{"herb":"ChuanNiuXi","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, expels Wind, drains Dampness, tonifies the Kidneys and Liver and strengthens the tendons and bones."]},{"herb":"DiLong","dosage":"9g","actions":["Clears Heat and unblocks and promotes movement in the channels and collaterals."]},{"herb":"QinJiao","dosage":"9g","actions":["Expels Wind-Dampness, opens the channels and soothes the sinews and collaterals."]},{"herb":"XiangFu","dosage":"6g","actions":["Spreads and regulates Liver Qi and alleviates pain."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Moves Qi","Invigorates the Blood","Dispels Stasis","Unblocks the channels","Stops pain"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["Sharp, lancinating low back and leg pain","Pain is in a fixed location","Pain is worse at night an better during the day","Pressure sometimes makes the spinal pain unbearable","Pain may radiate to the lower leg","Maybe numbness","A possible history of traumatic injury","Difficulty turning","Irritation and agitation","Dry stools"],"tongue":"Purple and dark with possible static macules","tongueCoat":"Thin and white","pulse":"Deep, choppy and wiry"},"conditions":[{"condition":"HerniatedDisc","name":"Herniated lumbar disc"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}