{"formula":"TuFuLingHeJi","names":{"pinyin":"tu fu ling he ji","hanzi":"土茯苓合剂","english":"smilacis combined formula","commonEnglish":"Smilacis Combined Formula","aka":[""]},"herbs":[{"herb":"TuFuLing","dosage":"30-60g","actions":["Relieves toxicity, eliminates Dampness and clears Damp-Heat from the skin.","With Bai Xian Pi, for skin lesions associated with Damp-Heat.","With Jin Yin Hua, Bai Xian Pi and Gan Cao, for syphilis."]},{"herb":"JinYinHua","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao.","With Gan Cao, for toxic swellings and sores."]},{"herb":"WeiLingXian","dosage":"9g","actions":["Dispels Wind-Dampness, unblocks the channels reduces Phlegm and pathogenic water and alleviates pain."]},{"herb":"BaiXianPi","dosage":"9g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"GanCao","dosage":"6g","actions":["Clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jin Yin Hua, for Damp rashes or acne."]},{"herb":"CangErZi","dosage":"15g","actions":["Dispels Wind and clears Heat toxins."]}],"actions":["Clears Heat","Relieves toxicity","Eliminates Dampness","Clears Damp-Heat from the skin"],"syndromes":["Toxic Wind-Damp-Heat"],"manifestations":{"symptoms":["Primary chancres appear on: Men: Penis Anus Rectum Women: Vulva Cervix Perineum Both: Lips Tongue Buccal mucosa Tonsils Fingers A red papule appears and quickly erodes into a painless ulcer with a lacquer-like base and hard walls. It does not bleed. When scratched, it exudes a clear serum. A red areola may surround the lesion.","Secondary Stage: Skin rashes Some people have lesions affecting other tissues and organs including: Eyes Bones Joints Kidneys Liver Spleen","Constitutional symptoms may also be present such as: Persistent headache Malaise Anorexia Nausea Aching bones Fever Insomnia Jaundice Neck stiffness Alopecia in patches Lesions affecting the mucous membranes often become eroded forming grayish-white circular patches with a red areola which are usually found on the: Mouth Palate Pharynx Larynx Penis Vulva Anal canal Rectum"]},"conditions":[{"condition":"Syphilis","name":"Primary syphilis "},{"condition":"Syphilis","name":"Secondary syphilis "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}