{"formula":"TuoLiSanJiaJian","names":{"pinyin":"tuo li san jia jian","hanzi":"托裡散加減","english":"modified drain the interior powder","commonEnglish":"Modified Drain the Interior Powder","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Niu Xi, powerfully clears Deficiency Fire Blazing Upward with pain and swelling of the gums, epistaxis, hematemesis and other hemorrhage in the upper body."]},{"herb":"HuangQi","dosage":"18g","actions":["Tonifies Qi and Blood, strengthens the Spleen, tonifies Wei Qi, promotes urination, reduces edema, relieves numbness and pain and expels toxins.","With Sheng Di Huang and Huang Bai, for Yin Deficiency with night sweats.","With Han Fang Ji, for Wind edema with numbness, pain, swelling of the face and extremities, sweating, sensitivity to Wind, and reduced urination.",""]},{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao."]},{"herb":"MaiMenDong","dosage":"12g","actions":["Nourishes Lung and Stomach Yin and generates Fluids.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"QiangHuo","dosage":"9g","actions":["Expels Wind-Cold-Dampness, unblocks painful obstruction and alleviates pain.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"FangFeng","dosage":"9g","actions":["Expels Wind-Dampness and alleviates pain.","With Huang Qi, prevents Wind from entering the skin."]},{"herb":"HanFangJi","dosage":"9g","actions":["Promotes urination, reduces edema especially in the lower body, expels Wind-Dampness, purges Damp-Heat and alleviates pain."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates, harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for Qi and Blood Deficiency."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies.","With Huang Lian, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, a dry mouth, a parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Huang Lian and Zhi Zi, for acute febrile diseases.","With Zhi Zi, for Damp-Heat and jaundice.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior.","With Huang Lian, Huang Bai and Zhi Zi, for lesions and sores with redness, swelling and pain."]},{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao, augments Qi, restores the constitution and assists herbs that release the exterior or drain downward when there is significant Qi Deficiency.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia.",""]},{"herb":"ZhuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness and dispels Damp-Heat."]},{"herb":"MuGua","dosage":"9g","actions":["Relaxes the sinews, increases Qi and Blood circulation, transforms Dampness and unblocks the channels."]},{"herb":"NiuXi","dosage":"9g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones, benefits the joints and clears Damp-Heat in the Lower Jiao."]},{"herb":"HuangBai","dosage":"9g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Zhi Zi, eliminates pathogenic Dampness from the Liver/Gallbladder for Yang type jaundice with noticeable fever, markedly yellow/orange skin and eyes, thirst and a red tongue with a yellow coat."]},{"herb":"ZhiZi","dosage":"9g","actions":["Drains Damp-Heat, cools the Blood, relieves toxicity, reduces swelling and invigorates the Blood."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"HuangLian","dosage":"3g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Sheng Di Huang, for insomnia and delirium due to unremitting Heat injuring the Ying level."]}],"actions":["Clears Toxic Heat","Tonifies Qi"],"syndromes":["Toxic Damp-Heat"],"manifestations":{"symptoms":["Swelling, Heat and pain in the joints","The pathogen is strong","Maybe redness of the joints","Dry mouth","Thirst","Marked fatigue"],"tongue":"Red and swollen or Tender, light red and swollen","tongueCoat":"Thin and yellow","pulse":"Surging and rapid"},"conditions":[{"condition":"LymeDisease","name":"Lyme Disease"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Baker's or popliteal cysts","modifications":[{"herb":"BaiZhi","modification":"+ 9g Rx. Angelicae Dahuricae"},{"herb":"ZaoJiaoCi","modification":"+ 9g Spina Gleditsiae"},{"herb":"WangBuLiuXing","modification":"+ 9g Sm. Vaccariae"},{"herb":"WaLengZi","modification":"+ 9g Concha Arcae"},{"herb":"MuXiang","modification":"+ 9g Rx. Aucklandiae"}]},{"purpose":"constipation","modifications":[{"herb":"DaHuang","modification":"+ 6g Rx. et Rz. Rhei"},{"herb":"RuXiang","modification":"+ 3g Olibanum"},{"herb":"MoYao","modification":"+ 3g Myrrh"},{"herb":"SuMu","modification":"+ 9g Lignum Sappan"}]}]}