{"formula":"WeiRuiTang","names":{"pinyin":"wei rui tang","hanzi":"葳蕤湯","english":"solomon's seal decoction","commonEnglish":"Solomon's Seal Decoction","aka":["Polygonatum Odoratum Decoction"]},"herbs":[{"herb":"YuZhu","dosage":"6g","actions":["Nourishes Yin, moistens Dryness, moistens the Lungs, extinguishes Wind, nourishes the Stomach and generates fluids."]},{"herb":"BaiWei","dosage":"6g","actions":["Cools the Blood, clears Deficiency Heat, promotes urination and relieves toxicity."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior, disseminates and facilitates Lung Qi, calms wheezing, stops coughing, promotes urination and reduces edema.","With Xing Ren, for Wind-Cold cough and wheezing.","With Xing Ren and Shi Gao, for coughing from Heat Obstructing the Lungs with wheezing, flaring of the nostrils and fever."]},{"herb":"CongBai","dosage":"0.6g","actions":["Releases the exterior, induces sweating, disperses Cold, unblocks Yang and relieves toxicity.","With Ma Huang, for Wind-Cold without sweating."]},{"herb":"DuHuo","dosage":"6g","actions":["Dispels Wind-Dampness, releases the Exterior and alleviates pain.","With Ma Huang, for Wind-Cold with anhidrosis, and body aches and pains."]},{"herb":"XingRen","dosage":"6g","actions":["Stops cough and calms wheezing."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Xing Ren and Ma Huang, for coughing or wheezing due to Wind-Cold Attacks the Lungs.","With Shi Gao and Xing Ren, for coughing due to Lung Heat."]},{"herb":"QingMuXiang","dosage":"6g","actions":["Promotes the flow of Qi, alleviates pain, resolves edema, clears Heat and removes toxicity."]},{"herb":"ShiGao","dosage":"9g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Excess Heat from the Lungs.","With Ma Huang, Xing Ren and Gan Cao, for Lung Heat with coughing and asthma."]}],"actions":["Scatters Wind","Releases the Exterior","Clears Heat","Nourishes Yin","Regulates Qi and Blood"],"syndromes":["Wind-Heat with Underlying Yin Deficiency with Qi and Blood Affected in elderly and postpartum patients"],"manifestations":{"symptoms":["Sweating","A sensation of heaviness in the body","Wheezing","A sullen demeanor","No desire to sleep","Dyspnea","Dysuria","Lethargy"],"pulse":"Floating at both proximal positions"},"conditions":[{"condition":"CommonCold","name":"Common cold"},{"condition":"AcuteTonsillitis","name":"Acute tonsillitis"},{"condition":"Dyspnea","name":"Dyspnea"},{"condition":"PulmonaryTuberculosis","name":"Pulmonary tuberculosis"},{"condition":"AcutePharyngitis","name":"Pharyngitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}