{"formula":"WenBuPiShenTangJiaJian","names":{"pinyin":"wen bu pi shen tang jia jian","hanzi":"温補脾金汤加減","english":"modified warm and tonify the spleen and kidneys decoction","commonEnglish":"Modified Warm and Tonify the Spleen and Kidneys Decoction","aka":[""]},"herbs":[{"herb":"TuSiZi","dosage":"30g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the Kidneys and Spleen and astringes diarrhea."]},{"herb":"BuGuZhi","dosage":"10g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, tonifies and warms Spleen Yang and stops diarrhea."]},{"herb":"FuLing","dosage":"15g","actions":["Strengthens the Spleen, resolves Dampness and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"GuaLou","dosage":"15g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi, reduces abscesses, dissipates nodules and eliminates pus."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea."]},{"herb":"YuJin","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores and alleviates pain."]},{"herb":"BaiJieZi","dosage":"15g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"BaiZhu","dosage":"10g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"XiangFu","dosage":"10g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain."]},{"herb":"ShanYao","dosage":"20g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Kidney Yin and astringes Jing.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools.","with Sha Ren and Chen Pi, for a weak Spleen and Stomach with Qi Stagnation."]},{"herb":"ShaRen","dosage":"5g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea."]},{"herb":"GanCao","dosage":"5g","actions":["Resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Eliminates lumps and swelling"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Slightly hard, mobile breast lumps","Body cold","Limbs icy","Aversion to Cold","White frothy sputum","Anorexia","Complexion white and shiny","Weak voice","Shortness of breath","Low back, knees and abdomen feel cold and painful","Lower abdomen feels cold and painful","Loose stools containing undigested food","“Cock-crow” diarrhea (occurs at about 5 am)","Edema of face and limbs","Dysuria","Irregular menstruation","Clear, white vaginal discharge","Infertility","Low sex drive","Severe: Abdominal ascites"],"tongue":"Pale, moist and swollen","tongueCoat":"Thin and white or White and greasy","pulse":"Deep, thready, weak and maybe slow"},"conditions":[{"condition":"FibrocysticBreastDisease","name":"Fibrocystic breast disease"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}