{"formula":"WenBaoYin","names":{"pinyin":"wen bao yin","hanzi":"温胞饮","english":"warm the uterus drink","commonEnglish":"Warm the Uterus Drink","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"BaJiTian","dosage":"6-15g","actions":["Tonifies the Kidneys, strengthens Yang, disperses Wind-Cold-Damp and strengthens the sinews and bones.","With Ren Shan and Shan Yao, for impotence or infertility."]},{"herb":"RenShen","dosage":"1-9g","actions":["Powerfully tonifies Yuan Qi Tonifies Spleen and Stomach Qi.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, benefits the Kidneys and Spleen and astringes diarrhea.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat spermatorrhea, premature ejaculation and lower back pain from Kidney Deficiency.","With Bu Gu Zhi and Du Zhong, for low back pain from Kidney Deficiency."]},{"herb":"QianShi","dosage":"8-30g","actions":["Strengthens the Spleen, stops diarrhea, stabilizes the Kidneys, astringes Jing, expels Dampness and stops discharge."]},{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Rou Gui, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees.","With Ren Shen, for severe Deficiency of Source Qi and Collapse of Yang with cold extremities, sweating, weak breathing, dizziness and an extremely pale complexion.","With Bai Zhu, for Spleen Yang Deficiency with a cold, painful abdomen, vomiting and watery diarrhea."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire, alleviates pain and assists in the generation of Qi and Blood.","With Zhi Fu Zi, for Deficiency of Ming Men Fire with impotence or infertility."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing, astringes urine, tonifies and warms Spleen Yang and stops diarrhea."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Kidney Yin and astringes Jing.","With Ren Shen and Bai Zhu, for a decreased appetite and lack of energy due to Spleen Deficiency."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Expels Wind-Cold-Damp"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Continuous cramping pain in the abdomen","Pain is not severe","Pain is relieved by pressure","Edema of the feet","Urinary difficulty","Slight edema (primarily of the lower limbs)","Symptoms generally occur during pregnancy","Pale face","Fatigue","Heaviness of head","Lassitude","Lower abdominal pain","Dizziness","Tinnitus","Lumbago","Edema","Abdominal pain with edema during pregnancy due to Blood Deficiency and abnormal water circulation","Oliguria","Palpitations","Cold feet","Extreme coldness of the hands and feet","Vertigo","Weakness and numbness of lower back and legs during pregnancy or postpartum","Mal position of the fetus","Dysmenorrhea","Irregular menstruation","Right upper quadrant pain","Hepatomegaly","Anemia","Lack of energy","Sore back","Thirst with no desire to drink"],"tongue":"Pale or pink maybe petechiae on margin","tongueCoat":"Thin or Greasy white","pulse":"Deep and weak or Soft, floating, small and slow or Wiry and small or Wiry and rough"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"condition":"AbdominalPainDuringPregnancy","name":"Abdominal pain with edema during pregnancy"},{"condition":"Pregnancy","name":" Weakness and numbness of lower back and legs during pregnancy or postpartum"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}