{"formula":"WenGongBuXueTang","names":{"pinyin":"wen gong bu xue tang","hanzi":"温宫補血汤","english":"warm the womb and tonify the blood decoction","commonEnglish":"Warm the Womb and Tonify the Blood Decoction","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"6-14g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","with Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude.","With Shu Di Huang and He Shou Wu, for Blood Deficiency."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and treats diarrhea due to Spleen Qi Deficiency with Dampness Obstruction."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses and disperses Cold.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"HeShouWu","dosage":"9-30g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and nourishes Jing."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow and tonifies the Kidneys and Liver."]},{"herb":"YinYangHuo","dosage":"3-15g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido."]},{"herb":"ZiShiYing","dosage":"9-16g","actions":["Warms the Womb and warms and unblocks the Chong and Ren channels.","With Dang Gui, Su Di Huang and Bai Zhu, for infertility, irregular uterine bleeding and vaginal discharge due to Cold from Deficiency of the Womb and the Sea of Blood."]},{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis and regulates menstruation.","With Dang Gui, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness, and scanty menstruation."]}],"actions":["Tonifies Kidney Yang","Generates Blood","Nourishes the Chong and Ren channels","Nourishes the uterus"],"syndromes":["Kidney Yang Deficiency with Liver Blood Deficiency"],"manifestations":{"symptoms":["Long term infertility or infertility in an older woman","Possibly a history of late menarche","Delayed menstruation with decreased and pale menses or","Infrequent menstruation","Irregular periods","Period either scanty or heavy","Prolonged menstrual cycle","Scanty, dark discharge at the end of menstruation","Light menses or","Amenorrhea","Late menses","Loss of libido","Aches and weakness in the waist and legs","Back pain","Cold limbs","A dusky complexion","Dull-pale complexion","Increased clear urine","Loose stools","Dizziness","Fatigue","Tinnitus","Feeling cold","Depression","Cold limbs","Frequent urination","Long-drawn-out urination with a thin stream or dribbling","Back soreness","Pain and coldness in loin and knees","Severe lumbago","Cold sensation in the lower abdomen","Pale complexion","Pale lips","Blurred or failing vision","Spots before the eyes","Dry eyes","Pale nail beds","Irritability","Frightens easily","Insomnia with much dreaming","Numbness of the limbs"],"tongue":"Pale, swollen and wet","tongueCoat":"White","pulse":"Deep and weak or Thin and soft or Deep and thready or Deep, thready and forceless or Deep and slow"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}