{"formula":"WenJingSanLengQian","names":{"pinyin":"wen jing san leng qian","commonEnglish":"","aka":[""]},"herbs":[{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With San Leng and E Zhu, for abdominal masses and accumulations.","With Niu Xi, induces labor."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain and regulates menstruation.","With E Zhu, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi and alleviates pain.","With Mu Xian, for Food Stagnation with abdominal distention, fullness and pain."]},{"herb":"GuiZhi","dosage":"3-10g","actions":["Warms the channels and collaterals to relieve pain and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels"]},{"herb":"HeShouWu","dosage":"9-30g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and nourishes Jing."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood and expels Blood Stasis."]},{"herb":"ShanZha","dosage":"8-16g","actions":["Transforms Food Stagnation, transforms Blood Stasis, invigorates Blood circulation and dissipates clumps."]},{"herb":"WuLingZhi","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, transforms Stasis and stops bleeding."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi and alleviates pain."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain and assists in the generation of Qi and Blood."]},{"herb":"MuXiang","dosage":"1.5-10g","actions":["Promotes the movement of Qi and alleviates pain."]}],"actions":["Warms the Lower Jiao","Invigorates the Blood"],"syndromes":["Blood Stagnation with Cold"],"manifestations":{"symptoms":["Pain that is fixed, stabbing and /or severe","Pain is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots","Chills","Cold limbs","Inability to get warm","Loose stools","Profuse clear urine","Spontaneous sweating","Lassitude"],"tongue":"Pale or Blue purple, possible purple spots","tongueCoat":"White","pulse":"Slow, deep and weak or Choppy or Wiry and choppy"},"conditions":[{"condition":"EndocrineDyscrasias","name":"Midcycle bleeding"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Administer during phase 1."],"modifications":[]}