{"formula":"WenJingSanHan","names":{"pinyin":"wen jing san han","commonEnglish":"","aka":[""]},"herbs":[{"herb":"XiaoHuiXiang","dosage":"3-12g","actions":["Warms the Liver and Kidneys, expels Cold and alleviates pain."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, warms the channels and stops bleeding."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Wu Ling Zhi, for chest and abdominal pain due to Blood Stagnation.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses."]},{"herb":"MoYao","dosage":"3-12g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Rou Gui, for irregular menstruation with Cold in the Blood."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain.","With Dang Gui and Chuan Xiong, for dysmenorrhea, postpartum abdominal pain or amenorrhea due to Deficiency Cold of the Chong and Ren channels."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Chuan Xiong, Dang Gui and Pu Huang, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain."]},{"herb":"WuLingZhi","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and stops bleeding.","With Yan Hu Suo and Mo Yao, for chest, epigastric and abdominal pain due to Qi Stagnation and Blood Stasis."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Stops bleeding by astringing, invigorates the Blood and dispels Blood Stasis.","With Wu Ling Zhi, for Blood Stasis causing menstrual irregularity, dysmenorrhea and lochiostasis with chest and abdominal pain."]}],"actions":["Warms the uterus","Scatters Cold"],"syndromes":["Cold-Damp Accumulation in the Channels"],"manifestations":{"symptoms":["Delayed menstruation or","Prolonged menstruation","Scant amount","Cold pain in the lower abdomen. relieved by warmth","Dark, purple menstrual Blood with clots","A thin, white abnormal vaginal discharge"],"tongue":"Dull colored","tongueCoat":"White","pulse":"Deep and slow"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}