{"formula":"WenShenNuanGongHeJi","names":{"pinyin":"wen shen nuan gong he ji","hanzi":"温腎暖宮合集","english":"warm the kidneys and uterus combination","commonEnglish":"Warm the Kidneys and Uterus Combination","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses and disperses Cold.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Blood Stasis.",""]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin and regulates menstruation.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis.","With Xu Duan, Du Zhong and Sang Ji Sheng, for lower back pain or restless fetus due to Kidney Deficiency."]},{"herb":"SangJiSheng","dosage":"9-30g","actions":["Tonifies Liver and Kidney Yin, nourishes the Blood and calms the womb.","With Xu Duan, Dang Gui and Du Zhong, for restless fetus, and back pain due to Yin and Blood Deficiency."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, stops uterine bleeding, calms the fetus, prevents miscarriage and promotes the movement of Blood.","With Du Zhong, for a restless fetus or bleeding during pregnancy accompanied by lower back pain and a sense of dropping in the lower trunk.","With Du Zhong and Niu Xi, for deficient Kidneys or Cold-Damp Bi causing low back and leg pain and weakness, contracture of the leg muscles and threatened miscarriage.","With Ai Ye, for excessive uterine bleeding with abdominal pain."]},{"herb":"RouCongRong","dosage":"6-21g","actions":["Tonifies the Kidneys, strengthens Yang,","benefits Jing and marrow and warms the Womb.","With Dang Gui and Niu Xi, for constipation due to Kidney Qi and Yang Deficiency with clear, copious urine and a cold sensation in the back."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies Kidney Yang, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and calms the fetus.","With Xu Duan, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees, weakness of the legs which makes walking difficult and especially threatened miscarriage due to instability of the Chong and Ren channels.","With Sang Ji Sheng, Dang Gui and Chuan Xiong, for low back pain during and after menstruation."]},{"herb":"AiYe","dosage":"3-10g","actions":["Warms the channels, warms the womb, stops bleeding, calms the fetus, disperses Cold and alleviates pain."]},{"herb":"GuiZhi","dosage":"9-15g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi, and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Bai Shao,warms and tonifies the Middle Jiao.","With Dang Gui and Chuan Xiong, for irregular menstruation due to Yang Deficiency with Cold Stagnation."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis and nourishes Liver and Kidney Yin.","With Du Zhong, for low back and extremity pain and weakness due to Bi pain or Kidney Deficiency."]},{"herb":"CaoDouKou","dosage":"1.5-7g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen."]}],"actions":["Warms the Kidneys and uterus to promote ovulation","Nourishes and invigorates the Blood"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Female infertility (\"uterus cold and infertile\")","Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Cold limbs","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Lassitude","Withdrawn, subdued behavior","Knees feel cold and aching","Dizziness","Tinnitus","Low libido","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white","pulse":"Deep and thready - maybe slow"},"conditions":[{"condition":"EndocrineDyscrasias","name":"Endocrine dyscrasia cold uterus"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}