{"formula":"WenYangXiFenTang","names":{"pinyin":"wen yang xi fen tang jia jian","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"20g","actions":["Tonifies the Middle Jiao and Lungs, augments Qi and nourishes the Blood.","With Fu Ling, for Spleen and Stomach Deficiency."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes Jing and Blood, fills the Marrow and strongly enriches Yin.","With Zhi Fu Zi and Rou Gui, for Kidney Yang Deficiency."]},{"herb":"ZhiFuZi","dosage":"10g","actions":["Restores Devastated Yang, warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang and Gan Cao, strengthens its actions of fortifying Qi and benefiting the Yang, for Cold."]},{"herb":"RouGui","dosage":"10g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain.","With Zhi Fu Zi, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and Deficiency of Ming Men Fire with impotence or infertility.","With Zhi Fu Zi and Gan Jiang, for a cold, painful abdomen, anorexia and diarrhea due to Kidney and Spleen Yang Deficiency."]},{"herb":"RouCongRong","dosage":"15g","actions":["Tonifies the Kidneys, strengthens the Yang,","benefits Jing and marrow and warms the Womb.","With Yin Yang Huo, for decreased sexual desire."]},{"herb":"YinYangHuo","dosage":"15g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido."]},{"herb":"GanJiang","dosage":"6g","actions":["Warms the Middle, expels Cold, rescues Devastated Yang, expels Interior Cold, warms the Lungs and transforms thin mucus.","With Zhi Fu Zi, warms the Spleen and Kidneys, benefits Yang and disperses Cold.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold."]},{"herb":"GuiBan","dosage":"15g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys, nourishes the Blood and tonifies the Heart."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for a stifling sensation in the chest and coughing with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia and Fu Ling, for coughing due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"10g","actions":["Dries Dampness and transforms Phlegm.","With Fu Ling, prevents turbid Phlegm and Dampness from disturbing the Heart, with dizziness, palpitations and insomnia."]},{"herb":"FuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, quiets the Heart, calms the Spirit and soothes the nerves.","With Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations and shortness of breath."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for palpitations due to Heart Qi Deficiency.","With Dang Shen and Fu Ling, strengthens the Spleen and augments Qi."]}],"actions":["Rescues Yang","Disperses Internal Cold","Warms and supplements the Spleen and Kidneys","Transforms Phlegm","Opens the Orifices"],"syndromes":["Yang Deficiency"],"manifestations":{"symptoms":["Advanced age","Bodily weakness or","Enduring disease that does not heal","Difficulty thinking","Sluggishness","Inattention","Cowering","No thought for food or drink","Lack of strength","Lusterless complexion","A dull emotional expression","Dull eyes","A decrease in self-initiated activity","Talks little","Sentences have little content or are unfinished","Slow response","Poor hygiene","Loss of concentration","Decreased sex drive","Loner behavior","Low excitability","Disregard of social codes","Extremely cold extremities","Aversion to Cold","Sleeping with knees drawn up","Lethargy with a constant desire to sleep","Vomiting","Diarrhea with undigested food","Abdominal pain and Cold","Lack of thirst","Coma","Indigestion","Edema","Pale face","Superficial fever","Red face","Cyanosis of the lips and nails"],"tongue":"Pale or Dark purple","tongueCoat":"White and slippery","pulse":"Deep and thready or Deep and slow or Deep and faint"},"conditions":[{"condition":"Schizophrenia","name":"Schizophrenia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe Phlegm Blocking the Heart Orifices","modifications":[{"herb":"ShiChangPu","modification":"+ Rz. Acori Tatarinowii"},{"herb":"YuanZhi","modification":"+ Rx. Polygalae"}]},{"purpose":"Blood Stasis","modifications":[{"herb":"MuDanPi","modification":"+ Cx. Moutan"},{"herb":"YuJin","modification":"+ Rx. Curcumae"}]},{"purpose":"pronounced Qi Deficiency","modifications":[{"herb":"HuangQi","modification":"+ Rx. Astragali"},{"herb":"ShanYao","modification":"+ Rx. Dioscoreae"}]}]}