{"formula":"WuBaoSan","names":{"pinyin":"wu bao san","hanzi":"五宝散","english":"five treasure powder","commonEnglish":"Five Treasure Powder","aka":[""]},"herbs":[{"herb":"ZhongRuShi","dosage":"12g","actions":["Warms Lung Qi, resolves Phlegm, tonifies the Kidneys, tonifies Yang and grasps Qi."]},{"herb":"ZhuSha","dosage":"3g","actions":["Sedates the Heart, calms the Spirit, clears Heat, relieves toxicity and prevents putrefaction."]},{"herb":"ZhenZhu","dosage":"6g","actions":["Sedates the Heart and clears the Liver."]},{"herb":"BingPian","dosage":"3g","actions":["Clears Heat, drains Fire, resolves toxicity, dissipates nodules and alleviates pain and alleviates itching."]},{"herb":"HuPo","dosage":"6g","actions":["Invigorates the Blood, dissipates Stasis, promotes urination and calms the Spirit."]},{"herb":"TuFuLing","dosage":"(500g)","actions":["(Relieves toxicity, eliminates Dampness and clears Damp-Heat from the skin.)"]}],"actions":["Clears Heat","Relieves toxicity","Eliminates Dampness","Clears Damp-Heat from the skin","Invigorates the Blood","Dissipates Stasis","Sedates the Heart","Calms the Spirit","Tonifies the Kidneys","Tonifies Yang"],"syndromes":["Toxic Wind-Damp-Heat with Blood Stagnation and Yang Deficiency"],"manifestations":{"symptoms":["Primary chancres appear on: Men: Penis Anus Rectum Women: Vulva Cervix Perineum Both: Lips Tongue Buccal mucosa Tonsils Fingers A red papule appears and quickly erodes into a painless ulcer with a lacquer-like base and hard walls. It does not bleed. When scratched, it exudes a clear serum. A red areola may surround the lesion.","Secondary Stage: Skin rashes Some people have lesions affecting other tissues and organs including: Eyes Bones Joints Kidneys Liver Spleen","Constitutional symptoms may also be present such as: Persistent headache Malaise Anorexia Nausea Aching bones Fever Insomnia Jaundice Neck stiffness Alopecia in patches Lesions affecting the mucous membranes often become eroded forming grayish-white circular patches with a red areola which are usually found on the: Mouth Palate Pharynx Larynx Penis Vulva Anal canal Rectum"]},"conditions":[{"condition":"Syphilis","name":"Primary syphilis "},{"condition":"Syphilis","name":"Secondary syphilis "}],"contra":{"contraindications":["Avoid spicy and greasy foods, beef, lamb, goose, shrimp and alcohol during therapy."],"interactions":[""]},"notes":["Grind all of the ingredients except Rz. Smilacis Glabrae Tu Fu Ling into a fine powder. Mix 6g of the powder with 24g of unbleached wheat flour to form Wu Bao San. Administer 0.3g of the powder ten times a day mixed with a decoction of 500g Rz. Smilacis Glabrae Tu Fu Ling in 500ml boiled down to a 250ml decoction."],"modifications":[]}