{"formula":"WuFaWanJiaJian","names":{"pinyin":"wu fa wan jia jian","hanzi":"乌发囊加減","english":"modified blacken the hair pills","commonEnglish":"Modified Blacken the Hair Pills","aka":[""]},"herbs":[{"herb":"HeShouWu","dosage":"9g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood, nourishes Jin and expels Wind from the skin by nourishing the Blood.","With Dang Gui and Hei Zhi Ma, for constipation due to dry Intestines from Blood Deficiency."]},{"herb":"CeBaiYe","dosage":"9g","actions":["Cools the Blood and promotes hair growth."]},{"herb":"NuZhenZi","dosage":"9g","actions":["Nourishes and tonifies Liver and Kidney Yin.","With He Shou Wu and Hei Zhi Ma, for premature graying of hair."]},{"herb":"ShengDiHuang","dosage":"9g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Mu Dan Pi, for Ying and Xue Stage Heat with a high fever, scarlet tongue, thirst, a rash all over the body, epistaxis and hemoptysis.","With Ce Bai Ye, for all types of bleeding due to Heat in the Blood","With Mu Dan Pi and Chi Shao, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"DangGui","dosage":"6g","actions":["Tonifies, invigorates and harmonizes the Blood and disperses Cold."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood and dispels Blood Stasis.","With Chi Shao, for Blood Stasis disorders.","With Chi Shao and Sheng Di Huang, for hematemesis and epistaxis due to Heat in the Xue level."]},{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and cools the Blood.","With Mu Dan Pi, cools the Blood and disperses Stasis, for Ying Stage Heat with epistaxis, hemoptysis, hemafecia, hematuria, menorrhagia and skin rashes."]},{"herb":"HeiZhiMa","dosage":"9g","actions":["Nourishes and fortifies Liver and Kidney Yin and nourishes Jing and Blood."]}],"actions":["Cools the Blood","Extinguishes Wind","Nourishes Yin","Protects the hair"],"syndromes":["Blood Heat Generating Wind"],"manifestations":{"symptoms":["Sudden hair loss","Rapidly evolving into large round or oval bare patches","Occasional itching","The skin is glossy","Minor itching","Maybe loss of hair in the eyebrows, moustache and beard","Maybe a sensation of Heat in the scalp","Maybe irritability","Maybe irascibility","Maybe restlessness","Maybe thirst","Maybe yellow urine","Maybe constipation"],"tongue":"Red","tongueCoat":"Thin and yellow","pulse":"Thready and rapid or Wiry, slippery and rapid"},"conditions":[{"condition":"Alopecia","name":"Alopecia"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}