{"formula":"WuHaiWan","names":{"pinyin":"wu hai wan","commonEnglish":"","aka":[""]},"herbs":[{"herb":"HaiZao","dosage":"9g","actions":["Reduces Phlegm and softens areas of hardness, promotes urination and reduces edema."]},{"herb":"KunBu","dosage":"9g","actions":["Resolves Phlegm, softens Phlegm nodules promotes urination and reduces swelling.","With Hai Zao, for goiter and scrofula."]},{"herb":"GeQiao(HaiGeKe)","dosage":"9g","actions":["Clears Lung Heat, transforms Phlegm, descends Lung Qi, softens hardness, dissipates nodules, promotes urination and expels Dampness.","With Kun Bu and Hai Zao, for goiter and scrofula."]},{"herb":"KunBu","dosage":"9g","actions":["Resolves Phlegm, softens Phlegm nodules promotes urination and reduces swelling."]},{"herb":"HaiPiaoXiao","dosage":"9g","actions":["Secures Jing, stops discharge, resolves Dampness and promotes healing."]},{"herb":"FuShi","dosage":"9g","actions":["Clears Heat from the Lungs, transforms Phlegm,softens hardness, dissipates Phlegm nodules, promotes urination and unblocks the Lungs."]},{"herb":"SanLeng","dosage":"6g","actions":["Forcefully breaks up Blood Stasis, regulates Qi and dissolves accumulations."]},{"herb":"JieGeng","dosage":"6g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Zhi Ban Xia, for cough due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]},{"herb":"XiXin","dosage":"3g","actions":["Warms the Lungs and transforms Phlegm and Thin Mucus."]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi."]},{"herb":"MuXiang","dosage":"6g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, prevents Stagnation, dispels Damp-Heat and harmonizes the Liver and Spleen."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness and transforms Phlegm, dissipates nodules and reduces Stagnation."]},{"herb":"MuLi","dosage":"15g","actions":["Calms the Liver, benefits the Yin, anchors Floating Yang, prevents leakage of fluids softens hardness and dissipates nodules."]},{"herb":"YuJin","dosage":"6g","actions":["Invigorates Blood, dispels Blood Stasis, regulates Qi flow, clears Heat and cools the Blood."]},{"herb":"GuiZhi","dosage":"6g","actions":["Unblocks Yang, transforms the Qi and thin mucus, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels,,warms the Middle and directs Turbid Yin downward."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, clears Liver Fire, drains pus and reduces swelling."]}],"actions":["Dredges the Liver","Regulates Qi","Relieves Stagnation","Resolves Phlegm","Activates the Blood","Breaks up Blood Stasis"],"syndromes":["Phlegm and Qi Stagnation"],"manifestations":{"symptoms":["Feeling of a lump in the throat","The lump is soft and becomes larger or smaller according to the emotional situation","The edges are indistinct","Possible nodulations on the thyroid gland","One or both sides may be involved","Possible exophthalmia","Sensation of distention in the eyes","Oppressive feeling in the chest and hypochondrium","Difficulty swallowing","Depression","Frequent suspicion","Perspiration","Irritability","Easily angered","A tendency to taciturnity","Chest oppression","Chest pain and fullness","Palpitations","Frequent sighing","Loose stools","Irregular menstruation","Pre-menstrual tension","Nausea","Vomiting","Loose stools","Weakness","Tremors"],"tongue":"Pale or dusky","tongueCoat":"White or Greasy white","pulse":"Wiry or Smooth and soft or wiry and slippery or Wiry and thready"},"conditions":[{"condition":"Hyperthyroidism","name":"Hyperthyroidism"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}