{"formula":"WuShiTongYuFang","names":{"pinyin":"wu shi tong yu fang","hanzi":"吴师痛瘀方","english":"master wu's pain","commonEnglish":"Master Wu's Pain-Healing Formula","aka":[""]},"herbs":[{"herb":"LongGu","dosage":"30g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang.","With Shi Chang Pu and Yuan Zhi, for a restless Shen.","With Zhi Gan Cao, Fu Xiao Mai and Da Zao, for schizophrenia."]},{"herb":"MuLi","dosage":"30g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Bai Shao, for headaches, dizziness, tinnitus and other symptoms associated with Yin Deficiency with Yang Rising."]},{"herb":"YuJin","dosage":"30g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, clears the Heart and Pericardium, opens the Orifices and alleviates pain."]},{"herb":"FuXiaoMai","dosage":"30g","actions":["Nourishes the Heart, calms the Spirit ands tops excessive sweating due to Deficiency.","With Gan Cao and Da Zao, for Emotional disorders, disorientation, emotional instability, and irritability due to mild Deficiency of the Spleen Qi and Heart Blood."]},{"herb":"BaiShao","dosage":"15g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Long Gu and Mu Li, for spontaneous sweating and night sweats due to Yin Deficiency.","With He Huan Pi, for anxiety, irritability, worry and insomnia."]},{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"ManJingZi","dosage":"15g","actions":["Dispels Wind-Heat in the Liver channel and relieves pain.","With Bai Shao, soothes the Liver."]},{"herb":"ShengMa","dosage":"15g","actions":["Releases the Exterior Clears Heat"]},{"herb":"HeHuanPi","dosage":"15g","actions":["Calms the Spirit, relieves constraint, invigorates and harmonizes the Blood, regulates Qi and alleviates pain."]},{"herb":"JuHua","dosage":"12g","actions":["Calms Liver Yang, extinguishes Wind, promotes the movement of Heart Qi and Blood and stimulates Blood circulation.","With Chuan Xiong, for a headache due to Wind-Heat or Liver Yang Rising."]},{"herb":"TianMa","dosage":"9g","actions":["Extinguishes Wind, calms the Liver, subdues Rising Liver Yang and alleviates pain.","With Chuan Xiong, for overwhelming attacks of Wind leading to migraines and dizziness so severe that the person feels as if they are about to fall over."]},{"herb":"YuanZhi","dosage":"9g","actions":["Calms the Spirit and sedates the Heart."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Calms the Spirit, disperses Wind, awakens the Spleen and promotes the movement of Qi."]},{"herb":"ZhiKe(Qiao)","dosage":"9g","actions":["Promotes the movement of Qi and reduces distention and pressure.","With Sheng Ma, relaxes the bowels and encourages the downward flow of turbid Yin.","with Yu Jin, for Liver Qi Stagnation with a stifling sensation in the chest and fullness in the epigastrium and abdomen with Heat signs."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"DaZao","dosage":"9g","actions":["Nourishes the Blood,calms the Spirit and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Nourishes the Heart","Nourishes the Blood","Calms the Shen","Moves Qi","Invigorates the Blood"],"syndromes":["Heart Deficiency with Liver Qi Stagnation"],"manifestations":{"symptoms":["Migraine headache","Fatigue","Lassitude","Chest oppression","Abdominal distention","Severe insomnia","Palpitations","Irritability","Anxiety","Easily startled","Insomnia","Much dreaming","Poor memory","Dizziness","Pale face and lips","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses"],"tongue":"Pale and darkish","tongueCoat":"Thin and white","pulse":"Wiry or Thready and weak"},"conditions":[{"condition":"MigraineHeadache","name":"Migraine headache"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}