{"formula":"WuShiGanYuFangJiaWei","names":{"pinyin":"wu shi gan yu fang jia wei","hanzi":"吴师肝瘀方加味","english":"modified master wu's liver stagnation formula","commonEnglish":"Modified Master Wu's Liver Stagnation Formula","aka":[""]},"herbs":[{"herb":"ChuanXiong","dosage":"15g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Chai Hu and Chi Shao, for Liver Qi and Blood Stagnation generating headache and/or chest pain."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood and dispels Blood Stasis Nourishes the Blood and calms the Spirit"]},{"herb":"TaoRen","dosage":"12g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"HongHua","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"ChiShao","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis and relieves pain.","With Xiang Fu, for flank pain, abdominal pain, and dysmenorrhea due to Qi and Blood Stagnation.","With Tao Ren, Hong Hua and Chuan Xiong, for Blood Stagnation in the chest."]},{"herb":"XiangFu","dosage":"12g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Chai Hu, for Qi Stagnation and menstrual irregularity."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness and transforms Phlegm.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi."]},{"herb":"ChaiHu","dosage":"9g","actions":["Spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction."]},{"herb":"QingPi","dosage":"9g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With Chai Hu, for long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"ShiChangPu","dosage":"9g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, transforms turbid Dampness, harmonizes the Middle Jiao, awakens the Spleen, promotes the movement of Qi and promotes Blood flow."]}],"actions":["Spreads the Liver","Regulates Qi","Invigorates the Blood","Dispels Phlegm","Opens the Orifices"],"syndromes":["Liver Qi and Blood Stagnation with Phlegm Stasis"],"manifestations":{"symptoms":["Blurred vision","A quick temper","Depression","Oppression","Emotional dysphoria","No desire to speak","Rib and flank distention and pain"],"tongue":"Dark with possible Stasis maculae","tongueCoat":"Slimy","pulse":"Slippery and wiry"},"conditions":[{"condition":"Alzheimer'sDisease","name":"Alzheimer's disease"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"stagnant Heat","modifications":[{"herb":"ZhiZi","modification":"+ 9g Fr. Gardeniae"},{"herb":"MuDanPi","modification":"+ 9g Cx. Moutan"}]},{"purpose":"Blood Deficiency","modifications":[{"herb":"ChiShao","modification":"- Rx. Paeoniae Rubra"},{"herb":"BaiShao","modification":"+ 9g Rx. Paeoniae Alba"},{"herb":"DangGui","modification":"+ 9g Rx. Angelicae Sinensis"}]},{"purpose":"Spleen Deficiency","modifications":[{"herb":"BaiZhu","modification":"+ 9g Rz. Atractylodis Macrocephalae"},{"herb":"FuLing","modification":"+ 9g Poria"},{"herb":"GanCao","modification":"+ 6g Rx. Glycyrrhizae"}]}]}