{"formula":"WuTouMaXinGuiJiangTangJiaWei","names":{"pinyin":"wu tou ma xin gui jiang tang jia wei","hanzi":"烏頭麻辛桂姜湯加味","english":"modified aconite, ephedra, asari, cinnamon and ginger decoction","commonEnglish":"Modified Aconite, Ephedra, Asari, Cinnamon and Ginger Decoction","aka":[""]},"herbs":[{"herb":"ZhiChuanWu","dosage":"9g","actions":["Expels Wind-Dampness, disperses Cold, warms and activates the channels and stops pain"]},{"herb":"ZhiFuZi","dosage":"9g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Cao, strengthens its actions of fortifying Qi and benefiting the Yang.","With Xi Xin, for Disperses Cold and stops pain."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels."]},{"herb":"DuHuo","dosage":"9g","actions":["Dispels Wind-Dampness, alleviates pain, disperses Wind-Cold-Dampness and releases the Exterior.","With Ma Huang, for Wind-Cold with anhidrosis and body aches and pains."]},{"herb":"GeGen","dosage":"9g","actions":["Discharges Exterior conditions and releases the muscles, especially of the neck and upper back.","With Ma Huang and Gui Zhi, for Wind-Cold with stiffness and tension in the upper back and neck."]},{"herb":"GanJiang","dosage":"9g","actions":["Warms the Middle, expels Cold Dispels Wind-Dampness seeping into the Lower Jiao.","With Zhi Fu Zi, for Cold-Damp Bi."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior, warms and disperses Cold pathogens, promotes urination and reduces edema.","With Zhi Fu Zi, for Wind-Cold Bi."]},{"herb":"GanCao","dosage":"6g","actions":["Moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"XiXin","dosage":"3g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Ma Huang, alleviates Wind-Cold-Damp Bi pain.","With Ma Huang and Zhi Fu Zi, for Exterior Wind-Cold with underlying Yang Deficiency.","With Zhi Fu Zi, for Wind-Damp-Cold Bi with spasms of the joints and intolerable pain.","With Du Huo, for joint pain due to Wind-Cold-Dampness."]}],"actions":["Warms the channels","Scatters Cold","Dispels Dampness","Stops pain"],"syndromes":["Cold-Damp"],"manifestations":{"symptoms":["Herniated lumbar disc","Cold pains in the lower and upper back","Heavy sensations in the low back","Feeling as if one were sitting in cold water","Feeling as if one were carrying a heavy weight","Cold limbs","Lack of strength","Definite tender points on palpation","Increased pain on exposure to Cold","Decreased pain on exposure to warmth","Long, clear urination"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Deep and tight"},"conditions":[{"condition":"HerniatedDisc","name":"Herniated lumbar disc"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe heavy sensations in the low back","modifications":[{"herb":"CangZhu","modification":"+ 9g Rz. Atractylodis"},{"herb":"BaiZhu","modification":"+ 12g Rz. Atractylodis Macrocephalae"},{"herb":"ChiShao","modification":"+ 9g Rx. Paeoniae Rubra"}]},{"purpose":"Wind-Cold with migrating pain or pain radiating to the ribs or flank","modifications":[{"herb":"QiangHuo","modification":"+ 9g Rz. et Rx. Notopterygii"},{"herb":"FangFeng","modification":"+ 9g Rx. Saposhnikoviae"}]}]}