{"formula":"WuYaoSanJiaWei","names":{"pinyin":"wu yao san jia wei","hanzi":"烏藥散加味","english":"modified lindera powder","commonEnglish":"Modified Lindera Powder","aka":[""]},"herbs":[{"herb":"WuYao","dosage":"9-12g","actions":["Promotes movement of Qi, alleviates pain, warms the Kidneys and disperses Cold.","With Xiang Fu, unblocks Qi in both the Qi and Blood levels, releases constraint from the Liver and Gallbladder, descends Qi in the chest and abdomen and warms Qi which has been slowed by pathogenic Cold for Qi and Blood Stagnation with menstrual irregularity, pain in the lower abdomen and generalized pain and distention throughout the body.","With Dang Gui and Xiang Fu, for menstrual pain."]},{"herb":"XiangFu","dosage":"6-12g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Yan Hu Suo, for Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Gui Zhi, warms and transforms fluids, unblocks Yang and promotes urination."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi."]},{"herb":"ShanZha","dosage":"9-15g","actions":["Transforms Blood Stasis, activates Blood circulation and dissipates clumps."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies Blood, regulates the menses, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Wu Yao, disperses Cold and stops pain, for abdominal pain due to External Cold.","With Xiang Fu and Yan Hu Suo, for dysmenorrhea.","With Bai Shao, nourishes Yin and Blood."]},{"herb":"BaiShao","dosage":"6-15g","actions":["Nourishes the Blood, regulates menstruation, softens the Liver and alleviates pain.","With Dang Gui, regulates and harmonizes Qi and Blood.","With Xiang Fu and Yan Hu Suo, for abdominal pain with menstruation."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Activates the Blood, circulates Qi and stops pain.","With Gui Zhi and Dang Gui, for dysmenorrhea due to Cold in the Blood."]},{"herb":"GuiZhi","dosage":"9-15gg","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms the Qi and thin mucus and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Bai Shao, warms and tonifies the Middle Jiao."]}],"actions":["Warms the channels","Disperses Cold","Regulates Qi","Nourishes and Activates the Blood","Calms the Stomach","Stops pain"],"syndromes":["Blood Stasis due to Cold"],"manifestations":{"symptoms":["Late menses","Painful menses with clots","The menstrual pain will be relieved by warmth and aggravated by Cold","Mild persistent uterine bleeding","Irregular menstruation (either early or late)","Scanty purple red blood with large clots","Cold pain in lower abdomen","Complexion is white/blue","Whole body feels cold","Cold limbs","Prolonged menstruation","Skipped period","Metrorrhagia","Extended or continuous menstrual flow","Pain","Lower abdominal distention","Cold-pain in the lower abdomen that is alleviated by warmth","Infertility","Dry lips","Dry mouth","Pale complexion","Leukorrhea","Amenorrhea","Bleeding between periods","No desire to drink","Distending breast pain","Low back coldness and pain","Loose stools","Cold limbs","Aversion to Cold","Menstruation becomes delayed and the menses decreased","Menses are dark or grayish in color"],"tongue":"Pale or Purple with petechiae or Pale","tongueCoat":"White","pulse":"Tight maybe choppy (stasis) and deep (internal) or Thready and choppy"},"conditions":[{"condition":"LateMenstruation","name":"Delayed menstruation "},{"condition":"Amenorrhea","name":"Amenorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"low back pain","modifications":[{"herb":"DuZhong","modification":"+ Cx. Eucommiae"},{"herb":"XuDuan","modification":"+ Rx. Dipsaci"}]}]}