{"formula":"XiangShaPingWeiWan","names":{"pinyin":"xiang sha ping wei wan","hanzi":"香砂平胃囊","english":"cyperus and amomum calm the stomach pill","commonEnglish":"Cyperus and Amomum Calm the Stomach Pill","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"6g","actions":["Strongly dries Dampness and tonifies the Spleen.","With Hou Po and Chen Pi, for epigastric fullness, fatigue and discomfort, anorexia, vomiting and/or diarrhea with a turbid, greasy tongue due to Dampness Obstructing the Middle Jiao.","With Xiang Fu, for chest, epigastric and abdominal pain, distention and discomfort due to Dampness and Qi Obstruction."]},{"herb":"HouPo","dosage":"6g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, resolves Food Stagnation and promotes the movement of Qi downward.","With Cang Zhu, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi.","With Shan Zha, Mai Ya and Shen Qu, for Food Stagnation causing accumulation and leading to belching with a rotten odor.","With Cang Zhu and Chen Pi, for Stomach Excess with epigastric fullness and distention, acid regurgitation, distasteful belching, and nausea and vomiting.","With Gan Jiang, for acute diarrhea from Cold attacking the Middle."]},{"herb":"ZhiKe(Qiao)","dosage":"0.9g","actions":["Promotes the movement of Qi, reduces distention and pressure, resolves hardenings and removes stagnated food."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, descends Qi and relieves the diaphragm.","With Zhi Ke and Mu Xiang, for abdominal distention, fullness and pain."]},{"herb":"ShaRen","dosage":"1.5g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen.","With Cang Zhu, for Cold-Damp induced diarrhea and dysentery.","With Chen Pi, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi."]},{"herb":"XiangFu","dosage":"3g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Cang Zhu, for indigestion, pain and distention in the flanks and abdomen, nausea, vomiting, and acid regurgitation.","With Mu Xiang and Sha Ren, for ulcers and digestive disturbances.","With Mu Xiang, Sha Ren and Shen Qu, for epigastric and abdominal pain, indigestion, vomiting, and diarrhea due to Qi Obstruction of the Liver and Spleen."]},{"herb":"MuXiang","dosage":"1.5g","actions":["Promotes the movement of Qi, alleviates pain, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, Dispels Damp-Heat and harmonizes the Liver and Spleen."]},{"herb":"ShanZha","dosage":"0.9g","actions":["Reduces and guides out Food Stagnation, transforms accumulations and stops diarrhea.|","With Mai Ya, Shen Qu, Mu Xiang and Zhi Ke, for abdominal distention, belching, and anorexia due to Food Stagnation with more intense symptoms such as pain.","With Zhi Ke, for epigastric and abdominal distention.","With Shen Qu, for general indigestion and Food Stagnation.","With Zhi Ke and Mu Xiang, for indigestion with abdominal distention and pain."]},{"herb":"MaiYa","dosage":"0.9g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi.","With Gan Jiang, for indigestion due to Spleen and Stomach Deficiency.","With Chao Mai Ya, for indigestion due to Food Stagnation."]},{"herb":"ShenQu","dosage":"0.9g","actions":["Reduces Food Stagnation, promotes digestion, moves Qi and harmonizes the Stomach.","With Zhi Ke, for reduced appetite and fullness and distention of the epigastrium and abdomen due to Cold Stagnation.","With Mu Xiang and Sha Ren, for abdominal pain associated with Food Stagnation.","With Mai Ya and Shan Zha, for abdominal distention, belching, diarrhea and anorexia due to Food Stagnation and indigestion."]},{"herb":"GanJiang","dosage":"0.9g","actions":["Warms the Middle and expels Cold.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Hou Po, for epigastric distention and pain due to Cold-induced congested fluids."]},{"herb":"GanCao","dosage":"0.9g","actions":["Tonifies the Spleen, augments Qi, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Harmonizes the Middle Jiao","Resolves Dampness","Regulates Qi","Reduces Food Stagnation"],"syndromes":["Spleen and Stomach Disharmony"],"manifestations":{"symptoms":["Nausea/Vomiting","Belching","Chest fullness and distention","Abdominal pain","Indigestion"],"tongue":"Normal or Dark","tongueCoat":"White","pulse":"Wiry"},"conditions":[{"name":"Infantile malnutrition"},{"condition":"Indigestion","name":"Indigestion"},{"condition":"Anorxia","name":"Anorexia"},{"name":"Gastrointestinal disorders"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"condition":"AbdominalPain","name":"Abdominal pain"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Spleen Deficiency","modifications":[{"herb":"BaiZhu","modification":"+ Rz. Atractylodis Macrocephalae"},{"herb":"ShanYao","modification":"+ Rz. Dioscoreae"},{"herb":"DangShen","modification":"+ Rx. Codonopsis"}]},{"purpose":"Spleen and Stomach Deficiency","modifications":[{"herb":"HuangQi","modification":"+ Rx. Astragali"}]},{"purpose":"nausea and vomiting due to Food Stagnation","modifications":[{"herb":"HuoXiang","modification":"+ Hb. Agastaches"},{"herb":"ZhuRu","modification":"+ Caulis Bambusae in Taeniam"}]},{"purpose":"long-term Food Stagnation","modifications":[{"herb":"GanJiang","modification":"- Rz. Zingiberis"},{"herb":"DaHuang","modification":"+ Rx. et Rz. Rhei"}]}]}