{"formula":"XiangShaYangWeiTang","names":{"pinyin":"xiang sha yang wei tang","hanzi":"香砂養胃湯","english":"nourish the stomach decoction with aucklandia and amomum","commonEnglish":"Nourish the Stomach Decoction with Aucklandia and Amomum","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"1.5-2g","actions":["Tonifies Spleen and Stomach Qi.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen."]},{"herb":"DangShen","dosage":"3-4.5g","actions":["(Substitutes for Ren Shen.)"]},{"herb":"BaiZhu","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"FuLing","dosage":"2.4-3g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools.","With Mu Xiang, for diarrhea and borborygmus due to Dampness."]},{"herb":"HouPo","dosage":"2-2.4g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Rebellious Qi, dries Dampness reduces Phlegm.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi."]},{"herb":"ChenPi","dosage":"2-2.4g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, descends Qi, dries Dampness and transforms Phlegm.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea, belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi and vomiting of unadulterated, or scanty but viscous fluids."]},{"herb":"XiangFu","dosage":"2-2.4g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Sha Ren and Mu Xiang, for ulcer and digestive disturbance."]},{"herb":"BaiDouKou","dosage":"2-2.1g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Stomach, warms the Middle Jiao, descends Qi and stops vomiting.","With Sha Ren, for fullness and a stifling sensation in the chest, epigastric pain and fullness, nausea, vomiting, diarrhea, anorexia and a thick tongue coat due to Qi Obstruction from Cold-Dampness.","With Chen Pi, for fullness and discomfort in the chest and abdomen, belching, nausea, vomiting, and diarrhea due to Spleen and Stomach Deficiencies with turbid Dampness Accumulation."]},{"herb":"MuXiang","dosage":"1.5g","actions":["Promotes the movement of Qi, alleviates pain, adjusts and regulates stagnant Qi in the Intestines, dispels Damp-Heat and harmonizes the Liver and Spleen.","With Sha Ren, for distention, epigastric and abdominal pain, anorexia, nausea, vomiting, diarrhea, dysentery, or tenesmus due to Qi Obstruction and/or Food Stagnation.","With Bai Zhu, for Anorexia with epigastric and abdominal pain and distention.","With Sha Ren, Ren Shen and Bai Zhu, for anorexia and abdominal distention and fullness which improves with warmth applied locally."]},{"herb":"ShaRen","dosage":"1.5-2.4g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Hou Po and Bai Dou Kou, for epigastric and abdominal pain, distention, nausea, and vomiting due to Spleen/Stomach Qi Stagnation.","With Ren Shen and Bai Zhu, for Spleen and Stomach Deficiency."]},{"herb":"ShengJiang","dosage":"1.5-3g","actions":["Warms the Middle, stops vomiting, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Dan Zao , alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, protects Stomach Qi and reduces irritation of the gastrointestinal tract by other herbs."]},{"herb":"GanCao","dosage":"0.6-3g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Ren Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi."]},{"herb":"DaZao","dosage":"1.5-3g","actions":["Tonifies the Spleen and Stomach, augments Qi, and moderates and harmonizes the harsh properties of other herbs"]}],"actions":["Strengthens and harmonizes the Spleen and Stomach","Resolves Dampness","Improves the appetite"],"syndromes":["Disharmony between the Spleen and Stomach with Dampness"],"manifestations":{"symptoms":["Anorexia","Loss of the sense of taste","Inability to eat more than a little at a time","Bloating after eating","Focal distention","Diarrhea","Nausea/Vomiting","Palpitatiojs","Indigestion","Epigastric discomfort","Generalized weakness","Maybe chest distention"],"tongue":"Pale","tongueCoat":"White","pulse":"Deep and soft"},"conditions":[{"condition":"Anorxia","name":"Anorexia"},{"condition":"Gastritis","name":"Chronic gastritis"},{"condition":"Gastroptosis","name":"Gastroptosis"},{"condition":"AIDS-HIV","name":"AIDS/HIV"},{"condition":"MorinigSickness","name":"Morning sickness"},{"name":"Underdeveloped physique in children "},{"condition":"AbdominalFullnessandDistention","name":"Abdominal fullness and distention"},{"condition":"Palpitations","name":"Palpitations"},{"condition":"StomachCancer","name":"Stomach cancer"},{"condition":"Gastroenteritis","name":"Gastroenteritis"},{"condition":"Ulcer","name":"Gastric and duodenal ulcers "},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"condition":"Gastrectasis","name":"Gastrectasis"},{"name":"Chronic peritonitis"},{"condition":"Weakness","name":"Weakness"},{"condition":"Indigestion","name":"Indigestion"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Heat type fullness and dull pain in the upper abdomen","modifications":[{"herb":"MuDanPi","modification":"+ Cx. Moutan"},{"herb":"ChiShao","modification":"+ Rx. Paeoniae Rubra"}]}]}