{"formula":"XiangSuYin","names":{"pinyin":"xiang su yin","hanzi":"杏苏飲","english":"cyperus and perilla drink","commonEnglish":"Cyperus and Perilla Drink","aka":[""]},"herbs":[{"herb":"ZiSuYe","dosage":"1.5g","actions":["Releases the Exterior , disperses Cold, promotes the movement of Spleen and Stomach Qi, harmonizes the Middle Jiao, relieves intestinal gas, alleviates seafood poisoning, improves Lung function, expands the chest and relieves Cold induced wheezing.","With Xiang Fu, releases the Exterior in a patient with pre-existing Qi Stagnation with chills, fever, headache, anhidrosis, a stuffy chest, belching and flatulence.","With Chen Pi, for Wind-Cold with Qi Stagnation and chest congestion."]},{"herb":"XiangFu","dosage":"9g","actions":["Regulates pain due to Qi Stagnation.","With Zi Su Ye, for nasal congestion, epigastric and abdominal distention and discomfort associated with externally contracted disorders.","With Dang Gui, tonifies the Blood and moves Qi.","with Yan Hu Suo, treats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body."]},{"herb":"YanHuSuo","dosage":"9g","actions":["Invigorates the Blood, circulates Qi, stops pain and disperses extravasation.","With Gui Zhi and Dang Gui, for Cold in the Blood."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis."]},{"herb":"GuiZhi","dosage":"9g","actions":["Unblocks Yang, transforms Qi and thin mucus, adjusts the Ying and Wei, warms the Middle, directs Turbid Yin downward, warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels and warms the channels and collaterals to relieve pain."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi."]},{"herb":"MuTong","dosage":"4.5g","actions":["Promotes urination, unblocks painful urinary dysfunction and unblocks Blood vessels.","With Dang Gui, promotes the circulation of Blood."]},{"herb":"GanCao","dosage":"6g","actions":["Moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Disperses Cold","Unblocks Yang","Warms the Middle","Directs Turbid Yin downward","Promotes the movement of Spleen and Stomach Qi","Harmonizes the Middle Jiao","Regulates pain due to Qi Stagnation","Tonifies, invigorates and harmonizes the Blood","Dries Dampness","Transforms Phlegm"],"syndromes":["Cold Stagnation in the Stomach"],"manifestations":{"symptoms":["General signs and symptoms: Epigastrium Cold with pain","Mild cases: Constant pain","Severe cases: Sudden bouts of sharp pain Pain is aggravated by Cold and relieved by warmth and hot drinks Cold hands and feet"],"tongue":"Stomach Deficiency with Stagnation of Cold: Pain is dull Pain is relieved by warmth and pressure Vomiting clear, watery fluid  Pale C: Thin and white P: Deep and slow or Deep and thready"},"conditions":[{"condition":"StomachCancer","name":"Stomach cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}