{"formula":"XiangBeiYangYingTang","names":{"pinyin":"xiang bei yang ying tang","hanzi":"香貝养颖汤","english":"cyperus and fritillaria decoction to nourish the nutritive qi","commonEnglish":"Cyperus and Fritillaria Decoction to Nourish the Nutritive Qi","aka":[""]},"herbs":[{"herb":"BaiZhu","dosage":"6-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"RenShen","dosage":"6-9g","actions":["Tonifies Spleen and Stomach Qi.","With Shu Di Huang, for severe Qi and Blood Deficiency.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue.","With Shu Di Huang, Bai Zhu, Fu Ling and Bai Shao, for Qi and Blood Deficiency."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Ren Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and helps prevent Stagnation from tonic herbs.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Ren Shen, Bai Zhu, Fu Ling, Dang Gui and Bai Shao, for anemia with fatigue and weakness."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, Reduces swelling, expels pus, generates flesh and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Xiang Fu, tonifies the Blood and moves Qi."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"ZheBeiMu","dosage":"3-12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat, expels pus and opens and raises Lung Qi, directing the effects of other herbs to the upper body.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus due to Wind-Heat."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, moistens the Lungs, resolves Phlegm, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Jie Geng, for pain and swelling of the throat."]},{"herb":"ShengJiang","dosage":"3-10g","actions":["Adjusts the Ying and Wei.","With Da Zao, prevents Phlegm accumulation, nourishes the Blood, prevents injury from harsh Blood movers and assists the movement of Qi."]},{"herb":"DaZao","dosage":"10-30g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, adjusts the Ying and Wei."]}],"actions":["Tonifies Qi","Nourishes the Blood","Regulates Qi","Transforms Phlegm"],"syndromes":["Masses in patients with Qi and Blood Deficiency"],"manifestations":{"symptoms":["Hard masses on the side of the neck","Hard masses on the breasts or axillae"]},"conditions":[{"condition":"CervicalLymphadenopathy","name":"Cervical lymphadenopathy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}