{"formula":"XianQiTang","names":{"pinyin":"xian qi tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Xiang Fu, tonifies Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Sheng Di Huang and Bai Shao, for headache due to Blood Deficiency."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With E Jiao, for coughing, hematemesis, epistaxis, and uterine hemorrhage due to Heat from Deficiency.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, astringes Yin, softens the Liver, relieves pain and regulates menstruation.","With Gan Cao, regulates the relationship between the Liver and Spleen.","With Sheng Di Huang and E Jiao, for Internal Stirring of Liver Wind, as in the aftermath of a febrile disease.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness and clears Deficiency Fire."]},{"herb":"HuangLian","dosage":"1.5-10g","actions":["Clears Heat, drains Dampness and stops bleeding.","With Zhi Mu, for Blazing Stomach Fire with intense hunger, dry stools, dry, yellow tongue coat and a slippery rapid pulse.","With E Jiao and Bai Shao, for insomnia and irritability due to overwhelming Heart Fire and Yin and Blood Deficiency."]},{"herb":"HuangJing","dosage":"6-30g","actions":["Tonifies Spleen Qi, nurtures Stomach Yin, tonifies the Kidneys and strengthens Jing.","With Dang Gui, for Kidney Jing and Blood Deficiency."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Damp-Heat especially from the Lower Jiao and drains Deficiency Heat.","With Zhi Mu, for Yin Deficiency fever with steaming bones and night sweats and Lower Jiao Damp-Heat."]},{"herb":"EJiao","dosage":"3-16g","actions":["Tonifies and nourishes the Blood, stops bleeding and nourishes and moistens Yin.","With Bai Shao and Ai Ye, for excessive menstrual bleeding.","With Huang Lian, for Heat toxin clumping in the Intestines, injuring the Blood collaterals causing Blood and pus in the stools especially during pregnancy or postpartum."]},{"herb":"AiYe","dosage":"3-10g","actions":["Warms the channels, warms the womb,","stops bleeding, calms the fetus, disperses Cold and alleviates pain.","With E Jiao, for heavy, painful periods due to Cold obstruction and prolonged uterine bleeding and menorrhagia.","With Xiang Fu, for abdominal pain from Deficiency Cold and Stagnant Qi.","With E Jiao, Dang Gui, Bai Shao, Sheng Di Huang, Gan Cao and Chuan Xiong, for unstable pregnancy with vaginal bleeding due to Deficiency Cold.","With Xiang Fu, Chuan Xiong, Dang Gui and Bai Shao, for Deficiency Cold of the Lower Jiao with Cold and pain and irregular menstruation with pain."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen and augments Qi and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Nourishes the Blood","Clears Blood Heat"],"syndromes":["Blood Deficiency with Blood Heat"],"manifestations":{"symptoms":["Short menstrual cycle","Early menstruation","Purple Blood","Heavy flow","Red, sticky vaginal discharge","Tidal fever","Greenish complexion","Metrorrhagia with thick Blood","Dizziness","Blurred vision","Palpitations","Insomnia","Irritability"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Thready, forceful and rapid"},"conditions":[{"condition":"EarlyMenstruation","name":"Early menstruation"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}