{"formula":"XiangLengWan","names":{"pinyin":"xiang leng wan","hanzi":"香棱丸","english":"cyperus and zedoaria pill","commonEnglish":"Cyperus and Zedoaria Pill","aka":[""]},"herbs":[{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness, transforms Phlegm and dissipates accumulations.","With San Leng and E Zhu, for masses where prolonged Qi Stagnation has led to Blood Stagnation."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi, reduces distention and pressure and resolves hardenings."]},{"herb":"MuXiang","dosage":"1.5-10g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines and alleviates pain."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, dissolves accumulations, regulates menstruation and alleviates pain."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With Qing Pi, for stagnant Qi with chest and abdominal fullness and pain.","With San Leng, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"ChuanLianZi","dosage":"3-15g","actions":["Dredges Liver Qi, releases Stagnation and stops pain.","With Xiao Hui Xiang, strongly stops pain and regulates Qi to treat bulging disorders and mobile masses in the lower abdomen."]},{"herb":"XiaoHuiXiang","dosage":"3-12g","actions":["Warms the Liver and Kidneys, expels Cold, regulates Qi, harmonizes the Stomach and alleviates pain."]},{"herb":"DingXiang","dosage":"1-5g","actions":["Warms the Middle Jiao, relieves pain, descends Qi, warms the Kidneys and assists Yang."]}],"actions":["Circulates Qi","Activates the Blood","Breaks up Stasis","Eliminates Phlegm","Warms Cold"],"syndromes":["Qi, Blood And Phlegm Stagnation with Phlegm Stagnation predominant"],"manifestations":{"symptoms":["Facial color dark and dull","Emaciation","Sides and ribs distended on both sides (maybe with sharp pain)","Enlargement of the Liver and Spleen","Suffocating sensation in chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses","Anorexia","Edema","Abdominal distention","Chest and hypochondriac distention","Dizziness","Nausea","Vomiting","Thirst with no desire to drink","Maybe no thirst","Palpitations","Shortness of Breath"],"tongue":"Varies from Normal to Dark purple (maybe purple spots on edge of tongue)","tongueCoat":"Thick and slippery","pulse":"Wiry, choppy and slow or Slippery, full and maybe wiry"},"conditions":[{"condition":"UterineMyoma","name":"Uterine myoma"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}