{"formula":"XiangShaPingWeiSan","names":{"pinyin":"xiang sha ping wei san","hanzi":"香砂平胃散","english":"cyperus and amomum calm the stomach powder","commonEnglish":"Cyperus and Amomum Calm the Stomach Powder","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"6g","actions":["Strongly dries Dampness and tonifies the Spleen.","With Hou Po and Chen Pi, for epigastric fullness, fatigue and discomfort, anorexia, vomiting and/or diarrhea with a turbid, greasy tongue due to Dampness Obstructing the Middle Jiao.","With Xiang Fu, for chest, epigastric and abdominal pain, distention and discomfort due to Dampness and Qi Obstruction."]},{"herb":"HouPo","dosage":"4g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, resolves Food Stagnation and promotes the movement of Qi downward.","With Cang Zhu, for Dampness obstructing Spleen Yang with epigastric fullness, abdominal and epigastric distention, nausea, vomiting, anorexia, loss of taste and a thick, greasy tongue coat.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi.","With Shan Zha, Mai Ya and Shen Qu, for Food Stagnation causing accumulation and leading to belching with a rotten odor.","With Cang Zhu and Chen Pi, for Stomach Excess with epigastric fullness and distention, acid regurgitation, distasteful belching, and nausea and vomiting."]},{"herb":"ZhiKe(Qiao)","dosage":"4g","actions":["Promotes the movement of Qi, reduces distention and pressure, resolves hardenings and removes stagnated food."]},{"herb":"ChenPi","dosage":"4g","actions":["Regulates Qi, adjusts the Middle, descends Qi and relieves the diaphragm.","With Sheng Jiang, for vomiting and hiccups due to Disharmony of the Stomach Qi."]},{"herb":"ShaRen","dosage":"4g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Cang Zhu, for Cold-Damp induced diarrhea and dysentery.","With Chen Pi, for belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi."]},{"herb":"XiangFu","dosage":"4g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Cang Zhu, for indigestion, pain and distention in the flanks and abdomen, nausea, vomiting, and acid regurgitation."]},{"herb":"ShanZha","dosage":"4g","actions":["educes and guides out Food Stagnation, transforms accumulations and stops diarrhea.|","With Mai Ya, Shen Qu and Zhi Ke, for abdominal distention, belching, and anorexia due to Food Stagnation with more intense symptoms such as pain.","With Zhi Ke, for epigastric and abdominal distention.","With Shen Qu, for general indigestion and Food Stagnation."]},{"herb":"MaiYa","dosage":"4g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi.","With Chao Mai Ya, for indigestion due to Food Stagnation."]},{"herb":"ShenQu","dosage":"4g","actions":["Reduces Food Stagnation, promotes digestion, moves Qi and harmonizes the Stomach.","With Zhi Ke, for reduced appetite and fullness and distention of the epigastrium and abdomen due to Cold Stagnation.","With Mai Ya and Shan Zha, for abdominal distention, belching, diarrhea and anorexia due to Food Stagnation and indigestion."]},{"herb":"ShengJiang","dosage":"2g","actions":["Warms the Middle, stops vomiting, normalizes the flow of Qi at the center and reduces the toxicity of other herbs.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]},{"herb":"BaiShao","dosage":"4g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain."]},{"herb":"GanCao","dosage":"2g","actions":["Tonifies the Spleen, augments Qi, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]}],"actions":["Strengthens the Spleen","Resolves Dampness","Promotes digestion"],"syndromes":["Food Stagnation"],"manifestations":{"symptoms":["Epigastric fullness, distention and pain with dislike of pressure","Chest and diaphragm oppression","Full, painful abdomen","Belching with rotten food smell","Acid regurgitation","Detests food or","Vomits after eating","Vomiting sour, rotten food","Distention is reduced after vomiting","Unformed stools or","Knotted constipation or","Stool are hot and foul-smelling","Diarrhea","Anorexia","Foul gas"],"tongue":"Pink","tongueCoat":"Thick and greasy","pulse":"Slippery"},"conditions":[{"condition":"Indigestion","name":"Indigestion"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"condition":"AcidReflux","name":"Acid reflux"},{"condition":"Anorxia","name":"Anorexia"},{"condition":"Diarrhea","name":"Diarrhea"},{"condition":"Constipation","name":"Constipation"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}