{"formula":"XiaoJiRuanJianPian","names":{"pinyin":"xiao ji ruan jian pian","hanzi":"tablet for removing qi stagnation and softening masses","commonEnglish":"Tablet for Removing Qi Stagnation and Softening Masses","aka":[""]},"herbs":[{"herb":"BanZhiLian","dosage":"15g","actions":["Clears Heat, resolves Fire toxins, invigorates the Blood,reduces swellings and treats various types of cancer.","With Bai Hua She she Cao, for cancer."]},{"herb":"BaiHuaSheSheCao","dosage":"30g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses and inhibits the growth of cancer cells."]},{"herb":"FengWeiJiaoYe","dosage":"30g","actions":["Regulates Qi, invigorates the Blood, breaks up Blood Stasis, dispels Wind, eliminates toxins and inhibits the growth of cancer cells."]},{"herb":"SanLeng","dosage":"9g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, alleviates pain, dissolves accumulations and inhibits the growth of cancer cells.","With E Zhu, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts.","With Dang Shen and Bai Zhu, for epigastric and abdominal pain from Spleen Deficiency."]},{"herb":"EZhu","dosage":"9g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations, alleviates pain and inhibits the growth of cancer cells.","With San Leng, for hepatosplenomegaly with distention, pain and immobile, palpable epigastric, sub costal and abdominal masses.","With Dang Shen and Bai Zhu, for abdominal fullness and pain due to Qi Deficiency."]},{"herb":"TuBieChong","dosage":"9g","actions":["Breaks up and drives out Blood Stasis, invigorates Blood circulation, disperses lumps and masses and inhibits the growth of cancer cells."]},{"herb":"BieJia","dosage":"15g","actions":["Nourishes Yin, anchors Yang, invigorates the Blood, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"DangShen","dosage":"15g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"BaiShao","dosage":"15g","actions":["Nourishes the Blood, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen and augments Qi and inhibits the growth of cancer cells.","With Zhi Shi, for Spleen Deficiency with Qi Stagnation with anorexia, epigastric focal distention and fullness."]},{"herb":"ZhiShi","dosage":"10g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels,d removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Bai Shao, for abdominal pain due to Qi and Blood Stagnation."]},{"herb":"YiYiRen","dosage":"10g","actions":["Strengthens the Spleen, resolves Dampness, clears Heat, expels pus and inhibits the growth of cancer cells."]}],"actions":["Clears Heat","Eliminates toxins","Invigorates the Blood","Circulates Qi","Tonifies Qi","Nourishes the Blood","Inhibits the growth of cancer cells"],"syndromes":["Qi and Blood Deficiency with Toxic Heat and Qi and Blood Stagnation"],"manifestations":{"symptoms":["Fatigue","Loose stools","Poor appetite","Dizziness","Pale face","Weak voice","Shortness of breath","Reluctance to speak","Sweating with little or no exertion","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Scanty periods","Jaundice","Hypochondriac pain","A lump under the ribs","Fever","Thirst","Epistaxis","Spots on the skin","Constipation","Scanty, red urine","Hemorrhaging","Weakness","Bleeds easily","Pain that is fixed, stabbing and /or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots or Pale or Pale, thin and dry or Red","tongueCoat":"White or Yellow","pulse":"Choppy or Wiry and choppy or Weak or Thin and choppy or Tight or Thready and rapid"},"conditions":[{"condition":"LiverCancer","name":"Early-stage Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a powder and make into tablets. Take4 tablets 3 times a day."],"modifications":[]}