{"formula":"XiaoHeSan","names":{"pinyin":"xiao he san","hanzi":"小合散","english":"reduce masses powder","commonEnglish":"Reduce Masses Powder","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"10g","actions":["Spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Bai Shao, for vertigo, dizziness, thoracic and costal pain, due to Liver Qi Stagnation."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis,clears Heat, cools the Blood and relieves pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation."]},{"herb":"BaiShao","dosage":"15g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Gan Cao, for epigastric, hypochondriac or flank pain."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood, reduces abscesses, nourishes the Blood and calms the Spirit."]},{"herb":"QingPi","dosage":"10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm.","With Bai Jie Zi, for cough with chest and flank pain due to congested fluids.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"WuYao","dosage":"10g","actions":["Promotes the movement of Qi and alleviates pain."]},{"herb":"BaiJieZi","dosage":"15g","actions":["Promotes Qi movement, dissipates nodules, unblocks the collaterals and alleviates pain."]},{"herb":"BanZhiLian","dosage":"15g","actions":["Clears Heat, resolves Fire toxins, reduces swellings, invigorates the Blood, mildly dispels Blood Stasis and inhibits the growth of cancer cells.","With Bai Hua She She Cao and Shan Ci Gu, for cancer."]},{"herb":"ShanCiGu","dosage":"15g","actions":["Clears Heat, resolves toxicity, reduces abscesses, reduces swelling, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"MuLi","dosage":"20g","actions":["Calms the Liver, benefits Yin, anchors Floating Yang, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"BaiHuaSheSheCao","dosage":"20g","actions":["Clears Heat, strongly relieves Fire toxins, reduces abscesses and inhibits the growth of cancer cells."]},{"herb":"GanCao","dosage":"5g","actions":["Resolves Phlegm, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Invigorates the Blood","Moves Qi","Breaks up Stagnation"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["A sensation of oppression in the chest","A feeling of distention in the hypochondrium","The chest pain is worse just prior to and after menstruation","The pain is worse with emotional upset","Breast masses that are moderately hard and painful on palpation","Pale red or Blood-tinged secretions from the nipple","Pain that is fixed, stabbing and/or severe or","Pains that move around","Distention","Depression","Irritability","Pan is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots"],"tongue":"Purple, possible purple or red spots","tongueCoat":"White","pulse":"Choppy or Wiry and choppy"},"conditions":[{"condition":"FibrocysticBreastDisease","name":"Fibrocystic breast disease"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}