{"formula":"XiaoLiuFang","names":{"pinyin":"xiao liu fang","hanzi":"小瘤方","english":"mass reducing formula","commonEnglish":"Mass Reducing Formula","aka":[""]},"herbs":[{"herb":"DanShen","dosage":"3-30g","actions":["Invigorates the Blood, dispels Blood Stasis, cools the Blood and reduces abscesses."]},{"herb":"SanLeng","dosage":"3-10g","actions":["Forcefully breaks up Blood Stasis, regulates Qi, Dissolves accumulations, Regulates menstruation and alleviates pain.","With E Zhu, for Qi and Blood Stagnation with clumping and accumulation leading to pain with distending pain in the chest, epigastrium and abdomen, amenorrhea, dysmenorrhea, uterine myoma and ovarian cysts."]},{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain."]},{"herb":"WaLengZi","dosage":"9-30g","actions":["Invigorates the Blood, dissolves Phlegm, resolves Stagnation, softens hardness and dissipates nodules.","With San Leng and E Zhu, for fixed abdominal masses."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Ren Shen and E Jiao, for chronic Blood Stasis with Qi and Blood Deficiency."]},{"herb":"XiaKuCao","dosage":"6-18g","actions":["Clears Liver Fire, clears Hot Phlegm and dissipates nodules.","With Chai Hu, for neck nodules due to Liver Qi Stagnation.","With Chai Hu and Xiang Fu, for Liver Qi Stagnation."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi, relieves Stagnation and resolves Phlegm and congestion.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"QingPi","dosage":"3-10g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dries Dampness, transforms Phlegm and dissipates accumulations.","With Xiang Fu, for pain and distention of the flanks due to Liver Qi Stagnation.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain."]},{"herb":"SanQi","dosage":"2-10g","actions":["Stops bleeding, transforms Blood Stasis, invigorates the Blood, reduces swelling and alleviates pain."]},{"herb":"EJiao","dosage":"3-16g","actions":["Nourishes the Blood and nourishes and moistens Yin."]},{"herb":"PuGongYing","dosage":"9-30g","actions":["Reduces abscesses, dissipates nodules, clears Heat, resolves Dampness and relieves Fire toxicity."]}],"actions":["Circulates Qi","Activates the Blood","Breaks up Stasis","Tonifies Qi","Softens masses"],"syndromes":["Qi and Blood Stagnation with Qi Deficiency"],"manifestations":{"symptoms":["Hard masses","Violent pain","Anorexia","Sallow or dark-yellow complexion"],"tongue":"Purple or Red and glossy","tongueCoat":"Gray and coarse tongue or None","pulse":"Thready and rapid or Taut and thready"},"conditions":[{"condition":"UterineMyoma","name":"Uterine fibroids "},{"name":""}],"contra":{"contraindications":["Contraindicated during menstruation."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"Qi Deficiency","modifications":[]}]}