{"formula":"XiaoKeFangYiHao","names":{"pinyin":"xiao ke fang yi hao","hanzi":"消渴方一","english":"wasting and thirsting formula #1","commonEnglish":"Wasting and Thirsting Formula #1","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach and generates Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, nourishes Stomach Yin, stops diarrhea, tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing.","With Huang Qi, lowers plasma glucose levels to treat diabetes mellitus especially due to Qi and Yin Deficiencies."]},{"herb":"XiYangShen","dosage":"2.4-10g","actions":["Tonifies the Qi, generates fluids, nurtures the Stomach, nourishes the Yin, benefits Lung Yin and clears Fire from the Lungs.","With Shi Gao and Zhi Mu, for a high fever, thirst, diarrhea and dehydration associated with Warm-Heat pathogen disease in which both the Qi and Fluids have been injured and Yang Ming Stage with concurrent Qi and Yin Deficiencies."]},{"herb":"XuanShen","dosage":"7-30g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity."]},{"herb":"ShiGao","dosage":"15-60g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst, clears Excess Heat from the Lungs and clears Blazing Stomach Fire.","With Zhi Mu, for a high fever from Wind-Heat or Qi Stage Heat or Yang Ming Heat with irritability and extreme thirst."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire , clears Heat from the Qi Stage, from the Lungs and from the Stomach, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"CangZhu","dosage":"3-10g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao.","With Shi Gao, for Warm-Damp febrile disease with fever, profuse sweating, and generalized body aches.","With Shi Gao and Zhi Mu, for Early-Stage Damp-Heat when Dampness and Heat are of equal strength, marked by fevers that fail to recede, focal distention in the chest, heavy lethargy, and thirst with no desire to drink."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain."]},{"herb":"LianXu","dosage":"1.5-9g","actions":["Stabilizes the Kidney, astringes Jing, clears Heart Heat and s tops bleeding."]},{"herb":"LianZiXin","dosage":"1.5-6g","actions":["Drains Heart Fire, relieves irritability, stops bleeding and astringes Jing."]}],"actions":["Tonifies Qi","Clears Heat","Nourishes Yin","Invigorates the Blood"],"syndromes":["Wasting and Thirsting syndrome with underlying Qi and Yin Deficiencies accompanied by Deficiency Fire Rising and Blood Stagnation"],"manifestations":{"symptoms":["Polyuria","Dry mouth","General Yin Xu Symptoms a. Night sweats b. Five Sole Heat c. Tidal fever","Eyes are black or green","Ears are wilted","Limbs emaciated","Feet and shins painful and weak","Sallow complexion","Fatigue","Anorexia","Four limbs feel tired and heavy","Abdominal and epigastric distention after eating","Maybe acid regurgitation or vomiting","Loose stools","Shortness of breath"],"tongue":"Red or Pale and flabby - may have teethmarks","tongueCoat":"White or Thin or None","pulse":"Thready and rapid or Even, forceless and Deficient"},"conditions":[{"condition":"Diabetes","name":"Diabetes"},{"condition":"AtopicDermatitis","name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}