{"formula":"XiaRuYongQuanSan","names":{"pinyin":"xia ru yong quan san","hanzi":"下乳涌泉散","english":"promoting lactation gushing spring powder","commonEnglish":"Promoting Lactation Gushing Spring Powder","aka":["Xian Ru Yong Chuan San"]},"herbs":[{"herb":"DangGui","dosage":"6-9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","with Bai Shao and Chai Hu, for dysmenorrhea from Liver Qi Stagnation and Blood Deficiency.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"BaiShao","dosage":"6-9","actions":["Nourishes the Blood, regulates menstruation, softens the Liver, relieves pain and calms Liver Yang.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ChuanXiong","dosage":"3-9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Sheng Di Huang, Bai Shao and Dang Gui, for headache due to Blood Deficiency."]},{"herb":"ShengDiHuang","dosage":"6-15g","actions":["Clears Heat, cools the Blood, nourishes Yin, and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"TianHuaFen","dosage":"6-9g","actions":["Drains Heat, generates Fluids, clears and drains Lung Heat, transforms Phlegm, moistens Lung Dryness, relieves toxicity, expels pus and reduces swelling, especially in the breast."]},{"herb":"QingPi","dosage":"4.5-9g","actions":["Spreads Liver Qi, breaks up Stagnant Qi , dries Dampness and transforms Phlegm."]},{"herb":"ChaiHu","dosage":"6-9","actions":["Spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and resolves Phlegm and congestion.","With Bai Shao, Dang Gui and Chuan Xiong, harmonizes the Blood for irregular menstruation.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver Channel."]},{"herb":"JieGeng","dosage":"3-9g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, expels pus and benefits the throat.","With Gan Cao, for Excess disorders in the Upper Jiao with no disorder in the Lower Jiao."]},{"herb":"TongCao","dosage":"3-9g","actions":["Promotes urination, resolves Dampness and","clears Heat and promotes lactation.","With Wang Bu Liu Xing and Chuan Shan Jia, for insufficient lactation."]},{"herb":"LouLu","dosage":"4.5-9","actions":["Clears Heat, resolves toxicity, drains abscesses, swellings and expels pus and promotes lactation.","With Tian Hua Fen and Dang gui, for breast abscess with pus that has ruptured.","With Wang Bu Liu Xing and Chuan Shan Jia, for insufficient lactation."]},{"herb":"ChuanShanJia","dosage":"4.5-15","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks menstruation and promotes lactation.","With Wang Bu Liu Xing, for insufficient lactation or lack of lactation and lactostasis."]},{"herb":"WangBuLiuXing","dosage":"4.5-9g","actions":["Promotes the movement of Blood, promotes lactation and invigorates the channels."]},{"herb":"MuTong","dosage":"6-9g","actions":["Promotes lactation and unblocks Blood vessels.","With Dang Gui, promotes the circulation of Blood.","With Chuan Shan Jian and Wang Bu Liu Xing, promotes secretion of breast milk."]},{"herb":"GanCao","dosage":"3-9g","actions":["Moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Nourishes and InvigorateS the Blood","Regulates Qi","Opens the breasts","Scatters nodulation"],"syndromes":["Insufficient lactation due to Liver Qi Stagnation.","Breast milk Accumulation"],"manifestations":{"symptoms":["Postpartum swollen lumps in the breast which begin soft and gradually harden","Absent or scanty lactation","Breast distention","Hardness of the breasts","Painful breasts","Vexation","Hypochondriac distension","Irritability","Chest oppression","Epigastric distension","Agitation"],"tongue":"Red edges","tongueCoat":"Slimy","pulse":"Wiry or Deep and wiry"},"conditions":[{"condition":"InsufficientLactation","name":"Insufficient lactation "},{"condition":"Mastitis","name":"Mastitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"breast abscess","modifications":[{"herb":"PuGongYing","modification":"+ Hb. Taraxaci"},{"herb":"GuaLou","modification":"+ Fr. Trichosanthis"},{"herb":"SiGuaLuo","modification":"+ Fr. Luffae Retinervus"},{"herb":"LuLuTong","modification":"+ Fr. Liquidamberis"}]}]}