{"formula":"XieDingRuAiTang","names":{"pinyin":"xie ding ru ai tang","hanzi":"协定乳癌汤","english":"decoction for treating mammary carcinoma","commonEnglish":"Decoction for Treating Mammary Carcinoma","aka":[""]},"herbs":[{"herb":"QingPi","dosage":"9g","actions":["Spreads Liver Qi, breaks up Stagnant Qi, dissipates accumulations, dries Dampness and transforms Phlegm.","With Chai Hu, restores the Qi circulation between the Upper and Lower Jiaos to treat long-term Qi Stagnation moving to Blood Stasis with fixed pain and occasional palpable lumps."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, Dries Dampness and transforms Phlegm.","With Qing Pi, for flank pain and chest and abdominal distention due to Liver Qi Stagnation."]},{"herb":"MuLi","dosage":"9g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin, anchors Floating Yang, softens hardness, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"GuaLou","dosage":"45g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi, unbinds the chest, reduces abscesses, dissipates nodules and eliminates pus.","With Pu Gong Ying and Jin Yin Hua, for breast carbuncles."]},{"herb":"SiGuaLuo","dosage":"45g","actions":["Resolves toxicity, reduces swelling, unblocks the channels and collaterals in the breast and expels Phlegm."]},{"herb":"PuGongYing","dosage":"45g","actions":["Reduces abscesses, dissipates nodules, clears the Liver, clears Heat, relieves Fire toxicity, promotes lactation and inhibits the growth of cancer cells.","With Gua Lou and Qing Pi, for breast lumps and abscesses."]},{"herb":"MaiYa","dosage":"45g","actions":["Reduces Food Stagnation, improves digestion, strengthens the Stomach and facilitates the smooth flow of Liver Qi."]},{"herb":"XuanShen","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin, transforms Phlegm-Heat, softens hardness, dissipates nodules, Drains Fire and relieves toxicity.","With Mu Li and Chuan Bei Mu, for scrofula, goiter and other nodules due to Phlegm."]},{"herb":"ChuanShanJia","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, promotes lactation, reduces swelling, promotes the discharge of pus and inhibits the growth of cancer cells.","With Pu Gong Ying, for inflammatory lesions of the skin that have not yet pustulated."]},{"herb":"ChaiHu","dosage":"6g","actions":["Resolves Shao Yang disorders, reduces fever, spreads Liver Qi, relieves Stagnation, disperses Wind-Heat and","resolves Phlegm and congestion.","With Qing Pi, for intercostal pain due to Qi obstruction in the Liver channel."]},{"herb":"ChuanBeiMu","dosage":"6g","actions":["Clears Heat, transforms Phlegm, clears Heat and dissipates nodules."]},{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat, resolves Fire toxicity and inhibits the growth of cancer cells."]}],"actions":["Relieves Liver Stagnation","Resolves Phlegm","Clears Heat","Resolves toxicity","Subdues masses"],"syndromes":["Liver Qi Stagnation with Phlegm"],"manifestations":{"symptoms":["Anxiety","Easily angered","Breast full and painful","Dry mouth","Dry pharynx","Dizziness"],"tongue":"Dark","tongueCoat":"Whit or Light yellow","pulse":"Wiry"},"conditions":[{"condition":"BreastCancer","name":"Breast cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}