{"formula":"XingJunSan","names":{"pinyin":"xing jun san","hanzi":"行军散","english":"troop","commonEnglish":"Troop-Marching Powder","aka":[""]},"herbs":[{"herb":"SheXiang","dosage":"3g","actions":["Strongly opens the Orifices and Luo vessels, revives the Spirit, unblocks closed disorders, activates the Blood, dissipates masses, reduces swellings, detoxifies, opens the channels and alleviates pain.","With Zhen Zhu, Xiong Huang and Niu Huang, for severe hot sores and ulcerations, especially of the throat."]},{"herb":"BingPian","dosage":"3g","actions":["Aromatically opens the Orifices, revives the Spirit, unblocks closed disorders, clears Heat, drains Fire, resolves toxicity, clears the eyes and removes superficial visual obstructions.","With She Xiang, for convulsions, loss of consciousness and coma due to extreme Heat or Phlegm Blocking the Orifices.","With Niu Huang, for coma due to Heat and a sore throat.","With Niu Huang and Zhen Zhu, for ulceration with pain and swelling of the skin, ears or nose."]},{"herb":"NiuHuang","dosage":"3g","actions":["Clears the Heart, opens the Orifices aromatically, awakens the Spirit, vaporizes Phlegm, clears the Liver, relieves Fire toxicity, extinguishes Wind, stops tremors, drains Heat and resolves Fire toxicity.","With Zhen Zhu, for delirium, high fever and convulsions.","With She Xiang and Bing Pian, for unconsciousness, delirious speech, a high fever and convulsions."]},{"herb":"XiaoShi","dosage":"0.9g","actions":["Promotes diuresis, softens hardness, eliminates accumulations, dissolves abscesses, removes toxins and relieves swellings."]},{"herb":"PengSha","dosage":"3g","actions":["Relieves toxicity, prevents purification, resolves toxicity, reduces swellings, treats the eyes, clears Heat and dissolves Phlegm."]},{"herb":"XiongHuang","dosage":"24g","actions":["Relieves toxicity, kills parasites, dries Dampness, expels Phlegm, stops malarial disorders and settles Wind.","With Peng Sha, for ulcerations of the mouth, tongue and throat."]},{"herb":"ZhenZhu","dosage":"3g","actions":["Sedates the Heart, settles tremors and palpitations, clears the Liver and eliminates superficial visual obstructions.","With Niu Huang and Bing Pian, for severe, chronic, non-healing ulcers anywhere on the body."]},{"herb":"JinBo","dosage":"20 leaves","actions":["Calms Spirit, sedates the Heart, stops madness, clears Heat, removes toxins, transforms pus and stops convulsions."]}],"actions":["Opens the sensory Orifices","Dispels filth and fetidness","Eliminates toxins"],"syndromes":["Sudden Turmoil disorder due to unclean food"],"manifestations":{"symptoms":["Vomiting","Diarrhea","Abdominal pain","Extreme irritability","Corneal opacity caused by Wind-Heat","Chest oppression","Altered consciousness or","Loss of consciousness","Oral lesions"]},"conditions":[{"name":"Gastrointestinal infection "},{"condition":"NauseaVomiting","name":"Vomiting"},{"name":"Coma"},{"name":"Oral lesions "},{"condition":"Diarrhea","name":"Traveler's diarrhea"},{"condition":"AbdominalPain","name":"Abdominal pain"},{"condition":"Delirium","name":"Delirium "},{"name":"Corneal opacity "}],"contra":{"contraindications":["Contraindicated during pregnancy."],"interactions":[""]},"notes":[""],"modifications":[]}