{"formula":"XiongJuShangQingWan","names":{"pinyin":"xiong ju shang qing wan","hanzi":"芎菊上清囊","english":"chuanxiong and chrysanthemum ascend and clear pills","commonEnglish":"Chuanxiong and Chrysanthemum Ascend and Clear Pills","aka":[""]},"herbs":[{"herb":"JuHua","dosage":"10g","actions":["Disperses Wind, clears Heat, calms the Liver and clears the eyes.","With Bo He, for Wind-Heat patterns with fever, chills, headache, dizziness, sore eyes and sore throat.","With Fang Feng, for Wind-Heat irritating the Exterior with slight chills, mild fever, a headache and itchy eyes.","With Chuan Xiong, for headaches due to Wind-Heat or Liver Yang Rising."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.|","With Fang Feng and Jing Jie, for headaches due Wind-Cold Invasion.","With Qiang Huo, Gao Ben and Fang Feng, for Wind-Damp lateral headaches.","With Gao Ben, for severe headaches without Interior Fire."]},{"herb":"HuangQin","dosage":"10g","actions":["Clears Heat and dries Dampness.","With Qiang Huo, for Cold-Dampness at the Exterior with Heat in the Interior."]},{"herb":"BaiZhi","dosage":"6g","actions":["Expels Wind, eliminates Dampness, unblocks the nasal passages, dispels Cold, alleviates pain, reduces swelling, eliminates toxins and expels pus.","With Gao Ben, for Wind-Cold induced headaches, especially those at the vertex.","With Chuan Xiong, for headaches.","With Chuan Xiong, Huang Qin and Ju Hua, for Wind-Heat headaches.","With Qiang Huo, for Wind-Cold Dampness causing fever, chills and headaches.","With Fang Feng and Qiang Huo, for Wind-Cold with headache and stuffy nose.","With Chuan Xiong, Ju Hua and Fang Feng, for headaches (especially frontal) due to Wind."]},{"herb":"ZhiZi","dosage":"6g","actions":["Clears Heat, reduces Fire, eliminates irritability and drains Damp-Heat."]},{"herb":"ManJingZi","dosage":"10g","actions":["Disperses Wind, clears Heat, dispels Wind-Heat in the Liver channel, clears and benefits the head and eyes, expels Wind-Dampness and relieves pain.","With Bo He, Jing Jie and Ju Hua, for headaches, facial swelling and pain due to Wind-Heat."]},{"herb":"LianQiao","dosage":"10g","actions":["Clears Heat (especially in the Upper Jiao) and relieves toxicity."]},{"herb":"JingJie","dosage":"10g","actions":["Releases the Exterior and expels Wind.","With Bo He, disperses Wind in the head.","With Fang Feng and Qiang Huo, for External Wind-Cold with chills, fever and anhidrosis.","With Huang Qi and Ju Hua, for eye inflammation associated with Wind-Heat."]},{"herb":"JieGeng","dosage":"6g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, benefits the throat and opens and raises Lung Qi, directing the effects of other herbs to the upper body."]},{"herb":"FangFeng","dosage":"6g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Jing Jie, for Exterior patterns in any season.","With Bo He and Lian Qiao, for Wind-Heat.","With Qiang Huo, for Wind-Dampness.","With Jing Jie, Bo He, Huang Qin and Lian Qiao, for Wind-Heat.","With Jing Jie, Lian Qiao and Bo He, for Wind-Heat with red eyes and a sore throat.","With Bo He, Lian Qiao, Huang Lian and Huang Qin, for acne due to Wind-Heat Attacking the upper body."]},{"herb":"BoHe","dosage":"3g","actions":["Disperses Wind-Heat, cools and clears the head and eyes and benefits the throat.","With Jing Jie, for Wind-Heat.","With Ju Hua, for headaches due to Wind-Heat."]},{"herb":"HuangLian","dosage":"3g","actions":["Clears Heat and drains Dampness.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease."]},{"herb":"QiangHuo","dosage":"6g","actions":["Releases the Exterior, disperses Cold and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold or painful obstruction.","With Jie Geng, for pain due to External Wind-Dampness.","With Jing Jie and Fang Feng, for occipital headache from Wind-Cold without perspiration."]},{"herb":"GaoBen","dosage":"6g","actions":["Expels Wind-Cold, dispels Wind-Dampness and alleviates pain.","With Chuan Xiong and Bai Zhi, for for headaches.","With Qiang Huo, for headaches and stiffness of the nape of the neck due to Wind-Dampness in the Du channel.","With Fang Feng and Qiang Huo, for External Wind-Cold-Dampness."]}],"actions":["Expels Wind Cold and Heat","Clears Heat","Stops pain"],"syndromes":["Wei Stage: Wind-Heat"],"manifestations":{"symptoms":["Headache with distention","Splitting headache","Distention in the eyeballs","Pain or aching of the superciliary arch when the distention is severe","Weak eyelids","Inability to look for a long time","Cough with thick sticky, yellow sputum","Sore, red, swollen throat","Thirst, with a desire to drink cold liquids","Runny or blocked nose with thick yellow discharge","Red face","Red eyes","Slight aversion to Cold","Fever with perspiration","Slight chills","Aversion to Wind","Sudden, splitting headache","Maybe dyspnea with flared nostrils","Maybe chest pain","Pain in the bones","Constipation","Dark urine"],"tongue":"Red tip","tongueCoat":"Thin and yellow","pulse":"Superficial and rapid"},"conditions":[{"name":"Distention in the eyes"},{"name":"Eye inflammation"},{"condition":"Headache","name":"Headache"},{"condition":"Perspiration","name":" Perspiration"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}