{"formula":"XiongGuiJiaoAiTang","names":{"pinyin":"xiong gui jiao ai tang","hanzi":"芎歸膠艾湯","english":"dang gui and gelatin combination","commonEnglish":"Dang Gui and Gelatin Combination","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"24g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With E Jiao, for uterine hemorrhage due to Heat from Deficiency.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"AiYe","dosage":"16g","actions":["Warms the channels, warms the womb, stops bleeding, calms the fetus, disperses Cold and alleviates pain.","With E Jiao, for heavy, painful periods due to Cold obstruction, prolonged uterine bleeding, menorrhagia, bleeding during pregnancy, postpartum bleeding, restless fetus and threatened miscarriage with cold abdominal pain.","With E Jiao and Bai Shao, for excessive loss of Blood and profuse bleeding due to Deficiency Cold.","With Sheng Di Huang, Bai Shao, Dang Gui, Gan Cao, Chuan Xiong and E Jiao, for unstable pregnancy with vaginal bleeding due to Deficiency Cold."]},{"herb":"BaiShao","dosage":"16g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, softens the Liver and relieves pain.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews for abdominal pain due to disharmony between the Liver and Stomach.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"DangGui","dosage":"16g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Gan Cao, moderates spasms and relieves abdominal pain.","With Bai Shao, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GanCao","dosage":"10g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ChuanXiong","dosage":"10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea.","With Sheng Di Huang, Bai Shao and Dang Gui, for Headaches due to Blood Deficiency."]},{"herb":"EJiao","dosage":"8g","actions":["Tonifies and nourishes the Blood, stops bleeding and Nourishes and moistens Yin.","With Ai Ye, for excessive menstrual bleeding."]}],"actions":["Stops bleeding related to the lower part of the body","Nourishes and replenishes Blood"],"syndromes":["Spleen Not Governing Blood","Insufficiency of the Chong and Ren","Habitual miscarriage","Yin maculae due to Blood Deficiency with Cold"],"manifestations":{"symptoms":["Pain and weakness of the low back and legs","Fetal restlessness","Weakness of the limbs and body","Dizziness","Tinnitus","Abdominal pain","Vaginal bleeding or","A drooping sensation in the hypogastrium"],"tongue":"Pale","tongueCoat":"Thin and white or Whitish and moist","pulse":"Thready and weak or Deep, thready and slippery"},"conditions":[{"condition":"Metrorrhagia","name":"Excessive uterine bleeding and spotting"},{"condition":"Endometriosis","name":"Endometriosis"},{"condition":"HabitualMiscarriage","name":"Miscarriage "},{"condition":"Menorrhagia","name":"Excessive menstruation"},{"condition":"FetalRestlessness","name":"Fetal restlessness"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}