{"formula":"YangFeiQuWeiTang","names":{"pinyin":"yang fei qu wei tang","hanzi":"养肺去萎湯","english":"decoction for nourishing the lungs and treating atrophy","commonEnglish":"Decoction for Nourishing the Lungs and Treating Flaccidity","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"30g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and inhibits the growth of cancer cells.","With Gan Cao, for toxic swellings and sores."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"MaiMenDong","dosage":"10g","actions":["Moistens the Lungs, nourishes Yin and stops coughing.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"ZiWan","dosage":"9g","actions":["Relieves coughs, expels Phlegm and inhibits the growth of cancer cells.","With Kuan Dong Hua, for coughing and wheezing with copious sputum and rebellious Qi.","With Bai Bu, for acute or chronic coughing with Blood streaked sputum."]},{"herb":"BaiBu","dosage":"9g","actions":["Moistens the Lungs and stops coughing."]},{"herb":"BaiHe","dosage":"10g","actions":["Nourishes Yin, moistens the Lungs, clears Heat and stops coughing.","With Kuan Dong Hua and Bai Bu, for chronic cough due to Lung Heat, usually with blood-streaked sputum.","With Kuang Dong Hua, Sheng Di Huang and Mai Men Dong, for a dry cough."]},{"herb":"KuanDongHua","dosage":"12g","actions":["Moistens the Lungs, descends Qi, stops coughing and transforms Phlegm.","With Zi Wan, for coughing with difficult-to-expectorate sputum.","With Bai He, for a chronic dry cough or Yin Deficiency cough with bloody sputum."]},{"herb":"ZheBeiMu","dosage":"6g","actions":["Clears Heat, transforms Phlegm, stops coughing, dissipates nodules and inhibits the growth of cancer cells."]},{"herb":"BaiWei","dosage":"9g","actions":["Cools the Blood and clears Deficiency Heat."]}],"actions":["Stops coughing and wheezing","Moistens the Lungs","Nourishes Lung Yin"],"syndromes":["Lung Yin Deficiency"],"manifestations":{"symptoms":["Severe, dry hacking cough","No sputum expectorated","Small amounts of difficult to expectorate sputum","Blood tinged sputum (when Yin Deficiency Fire is present)","Afternoon fever","Night sweats","Malar flush (especially in afternoon)","Five Sole Heat","Dry mouth and throat","Itching in throat","Hoarse voice, low voice or loss of voice","Emaciation"],"tongue":"Red and dry","tongueCoat":"None","pulse":"Thready and rapid"},"conditions":[{"condition":"LungCancer","name":"Early-stage Pulmonary carcinoma"},{"condition":"LungCancer","name":"Lung cancer"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}