{"formula":"YangXinTangJiaJian","names":{"pinyin":"yang xin tang jia jian","hanzi":"養心湯加減","english":"modified nourish the heart decoction","commonEnglish":"Modified Nourish the Heart Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood, strengthens the Spleen and raises the Yang Qi of the Spleen and Stomach.","With Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao, augments Qi, tonifies the Lungs, restores the constitution, assists herbs that release the exterior or drain downward when there is significant Qi Deficiency, Nourishes Blood and promotes the generation of Body fluids.","With Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs.","With Dang Shen, for palpitations due to Heart Qi Deficiency and anorexia, fatigue and loose stools due to Spleen Deficiency."]},{"herb":"FuLing","dosage":"9g","actions":["Quiets the Heart, calms the Spirit and soothes the nerves."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen, quiets the Heart, calms the Spirit and soothes the nerves.","With Gui Zhi, warms and transforms fluids, unblocks Yang and promotes urination.","With Suan Zao Ren, Yuan Zhi and Wu Wei Zi, for palpitations and insomnia."]},{"herb":"GuiZhi","dosage":"9g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang and warms and facilitates the flow of Yang Qi in the chest.","With Chuan Xiong, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves the discomfort of painful obstruction.","with Fu Ling, for palpitations and dyspnea due to Heart Yang Deficiency."]},{"herb":"WuWeiZi","dosage":"9g","actions":["Tonifies Qi, quiets the Spirit and calms and contains Heart Qi.","With Huang Qi, for Yang Deficiency with spontaneous sweat."]},{"herb":"DangGui","dosage":"5g","actions":["Tonifies Blood, regulates the menses, Invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Huang Qi, for Qi and Blood Deficiency.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"5g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"YuanZhi","dosage":"5g","actions":["Calms the Spirit and sedates the Heart and clears the channel joining the Heart and Kidney.","With Suan Zao Ren, balances the contrasting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"SuanZaoRen","dosage":"5g","actions":["Nourishes Heart Yin, tonifies Liver Blood, calms the Spirit, astringes sweat and generates fluids."]}],"actions":["Nourishes the Heart","Calms the Shen"],"syndromes":["Heart Qi Deficiency"],"manifestations":{"symptoms":["Palpitations","Dull pain in the chest","An empty sensation in the Heart region","Easily frightened","Shortness of breath (especially on exertion)","Excessive perspiration (in daytime)","Symptoms worse after exertion or when tired","Facial pallor","Fatigue","Weakness","Suffocating sensation in chest"],"tongue":"Pale and swollen","tongueCoat":"White","pulse":"Weak or Weak and tight or Big and weak or Intermittent"},"conditions":[{"condition":"CoronaryHeartDisease","name":"Coronary Heart disease "},{"condition":"Palpitations","name":"Palpitations"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"marked Qi Deficiency","modifications":[{"herb":"BaiZhu","modification":"+ 12g Rz. Atractylodis Macrocephalae"},{"herb":"JiXueTeng","modification":"+ 15g Caulis Spatholobi"},{"herb":"DangShen","modification":"- Rx. Codonopsis"},{"herb":"RenShen","modification":"+ 6g Rx. Ginseng"}]},{"purpose":"Blood Deficiency","modifications":[{"herb":"BaiZiRen","modification":"+ 9g Sm. Platycladi"}]},{"purpose":"severe sweating","modifications":[{"herb":"FuXiaoMai","modification":"+ 18g Fr. Tritici Levis"},{"herb":"LongGu","modification":"+ 15g Raw Fossilia Ossis Mastodi"},{"herb":"MuLi","modification":"+ 15g Raw Concha Ostreae"}]},{"purpose":"abdominal distention and reduced food intake","modifications":[{"herb":"ChenPi","modification":"+ 9g. Per. Citri Reticulatae"},{"herb":"ShaRen","modification":"+ 6g Fr. Amomi"}]},{"purpose":"Heart Yang Deficiency","modifications":[{"herb":"XieBai","modification":"+ 15g Bul. Allii"}]}]}