{"formula":"YangXueRunFuTang","names":{"pinyin":"yang xue run fu tang","hanzi":"nourish the blood and moisten the skin decoction","commonEnglish":"Nourish the Blood and Moisten the Skin Decoction","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"DanShen","dosage":"10g","actions":["Invigorates the Blood and dispels Blood Stasis Clears Heat and soothes irritability Cools the Blood and reduces abscesses"]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","with Chi Shao, for Blood Stasis disorders with Heat."]},{"herb":"ChiShao","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses."]},{"herb":"HeShouWu","dosage":"12g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood, nourishes Jing and expels Wind from the skin by nourishing the Blood."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Mu Dan Pi, for Kidney Yin Deficiency.","With Mu Dan Pi and Chi Shao, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes Jing and Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency."]},{"herb":"BeiDouGen","dosage":"12g","actions":["Clears Heat, resolves toxicity, resolves Dampness and reduces swelling."]},{"herb":"TianMenDong","dosage":"12g","actions":["Nourishes the Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, nourishes the Kidneys and generates fluids.","With Mai Men Dong, for Yin Deficiency with injured fluids.","With Dang Gui and He Shou Wu, for constipation due to Blood Deficiency."]},{"herb":"MaiMenDong","dosage":"12g","actions":["Moistens the Lungs and Intestines, nourishes Lung and Stomach Yin and generates fluids.","With Sheng Di Huang, for Yin Deficiency with Excess Heat."]},{"herb":"ChongLou","dosage":"15g","actions":["Drains Heat, relieves Fire toxicity, reduces swelling and inflammation and stops pain."]},{"herb":"BaiXianPi","dosage":"15g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"Bai(Ci)JiLi","dosage":"15g","actions":["Dispels Wind and stops itching."]}],"actions":["Enriches Yin","Moistens Dryness","Clears Heat","Expels Wind"],"syndromes":["Blood Dryness due to Yin Deficiency"],"manifestations":{"symptoms":["This pattern tends to linger with persistent lesions distributed over the trunk and limbs","The lesions are dark red, brownish-red or pale red and appear in various shapes, but mostly present as patches with thick or thin layers of dry silvery-white scales that are difficult to peel off","Itching may be slight or severe","Dry throat and lips","A feverish sensation in the chest, palms and soles or in the palms alone","Dry mouth","Dry skin","Thirst without a desire for drinks","Constipation"],"tongue":"Dry and red","tongueCoat":"Thin, dry and yellow","pulse":"Wiry and thready or Thready and rapid"},"conditions":[{"condition":"Psoriasis","name":"Psoriasis"},{"condition":"DrySkin","name":"Dry skin"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"purple skin scratches and a deep purple tongue","modifications":[{"herb":"TianMa","modification":"+ Rz. Gastrodiae"},{"herb":"SuMu","modification":"+ Lignum Sappan"},{"herb":"TaoRen","modification":"+ Sm. Persicae"},{"herb":"ZaoJiaoCi","modification":"+ Spina Gleditsiae"}]},{"purpose":"itching worsened by emotional changes","modifications":[{"herb":"GouTeng","modification":"+ Ram. cum Uncis Uncariae"},{"herb":"LongGu","modification":"+ Fossilia Ossis Mastodi"},{"herb":"MuLi","modification":"+ Concha Ostreae"}]}]}