{"formula":"YangWeiTangShaShen","names":{"pinyin":"yang wei tang sha shen","hanzi":"養胃湯沙參","english":"nourish the stomach decoction with glehnia","commonEnglish":"Nourish the Stomach Decoction with Glehnia","aka":[""]},"herbs":[{"herb":"ShaShen","dosage":"9-30g","actions":["Nourishes Stomach Yin and generates fluids.","With Mai Men Dong, for dry throat, constipation, thirst and a red tongue with little coat due to pathogenic Warmth or Heat injuring the Stomach Yin or long-term Yin Deficiency.","With Mai Men Dong, Yu Zhu and Shi Hu, for chronic Stomach Yin Deficiency."]},{"herb":"MaiMenDong","dosage":"6-15g","actions":["Nourishes Stomach Yin, moistens the Intestines and generates fluids.","With Bei Sha Shen, Yu Zhu, Sheng Di Huang and Bing Tang, for insufficient Stomach Yin from Yang Ming Stage or Qi Level disease with profuse sweating.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"BingTang","dosage":"10-15g","actions":["Strengthens the Spleen and harmonizes the Stomach."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Nourishes Yin, generates fluids and increases saliva.","With Mai Men Dong, Bei Sha Shen and Yu Zhu, for a dry mouth, thirst, dry lips and a red tongue due to Stomach Yin Deficiency.","With Mai Men Dong, Bei Sha Shen, Shi Hu and Yu Zhu, for consumption of Body Fluids due to febrile disease."]},{"herb":"YuZhu","dosage":"6-30g","actions":["Nourishes Yin, moistens Dryness, moistens the Lungs, nourishes the Stomach and generate fluids.","With Mai Men Dong and Bei Sha Shen, for a dry cough, thirst, and other symptoms associated with injured fluids due to Lung and Stomach Yin Deficiency."]},{"herb":"PiPaYe","dosage":"4.5-16g","actions":["Harmonizes the Stomach, clears Stomach Heat and descends Stomach Qi."]},{"herb":"ShiHu","dosage":"6-20g","actions":["Nourishes Stomach and Lung Yin, clears Heat and generates fluids."]},{"herb":"ShiDi","dosage":"3-12g","actions":["Descends Qi and stops hiccups."]}],"actions":["Nourishes Stomach Yin"],"syndromes":["Stomach Yin Deficiency"],"manifestations":{"symptoms":["Hiccup","Shortness of breath","Dry mouth","No appetite or","Famished but with no desire to eat","Abdominal distention after meals","Dry stools","Irritability with low grade fever","Maybe dry retching or","Thirst","Anxiety"],"tongue":"Red","tongueCoat":"Little and dry","pulse":"Thready and rapid"},"conditions":[{"condition":"Hiccup","name":"Hiccup"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}