{"formula":"YangRongZhuangShenTang","names":{"pinyin":"yang rong zhuang shen tang","hanzi":"养荣状肾汤","english":"nourishing and flourishing strengthening the kidneys decoction","commonEnglish":"Nourishing and Flourishing Strengthening the Kidneys Decoction","aka":[""]},"herbs":[{"herb":"SangJiSheng","dosage":"15g","actions":["Tonifies Liver and Kidney Yin, strengthens the sinews and bones, expels Wind-Dampness, nourishes the Blood and calms the womb."]},{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"XuDuan","dosage":"15g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, stops uterine bleeding, calms the fetus, prevents miscarriage, promotes the movement of Blood and alleviates pain.","With Du Zhong, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees and weakness of the legs which makes walking difficult."]},{"herb":"DuZhong","dosage":"15g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and tonifies Kidney Yang."]},{"herb":"DuHuo","dosage":"15g","actions":["Dispels Wind-Dampness and alleviates pain.","With Sang Ji Sheng, Du Zhong and Dang Gui, for Wind-Dampness in a patient with underlying Kidney Deficiency, with low back pain and knee pain and stiffness.","With Fang Feng, for numbness in the legs."]},{"herb":"FangFeng","dosage":"9g","actions":["Expels Wind-Dampness, expels Internal Wind, stops spasms and alleviates pain."]},{"herb":"RouGui","dosage":"5g","actions":["Warms the Kidneys, Spleen and Heart, strengthens the Yang and Ming Men Fire, disperses deep Cold, warms and unblocks the channels and vessels and alleviates pain."]},{"herb":"ShengJiang","dosage":"6g","actions":["Warms the Middle and reduces the toxicity of the other herbs."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]}],"actions":["Tonifies Liver and Kidney Yin","Warms the Kidneys","Strengthens the Yang","Strengthens the sinews and bones","Expels Wind-Dampness","Nourishes the Blood"],"syndromes":["Kidney Deficiency"],"manifestations":{"symptoms":["Joints, back and limbs are sore and numb","The pain occurs especially lower part of body","Other Kidney Deficiency symptoms","Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Cold limbs","General debility","Pale face","Urinary frequency with abundant, clear urine or","Oliguria with edema","Maybe nocturia","Lassitude","Withdrawn, subdued behavior","Knees feel cold and aching","Dizziness","Tinnitus","Low libido","Maybe anorexia","Maybe loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white","pulse":"Deep and thready - maybe slow"},"conditions":[{"condition":"PostpartumBodyPain","name":"Postpartum body pain"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}