{"formula":"YangXueRunFuTangYiHao","names":{"pinyin":"yang xue run fu tang yi hao","hanzi":"nourish the blood and moisten the skin decoction #1","commonEnglish":"Nourish the Blood and Moisten the Skin Decoction #1","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes Jing and Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, moistens the Intestines, unblocks the bowels, reduces swelling, expels pus, generates flesh and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Huang Qi, for many Blood Deficiency patterns.","With Tao Ren and Hong Hua, for symptoms associated with Blood Stasis.",""]},{"herb":"HuangQi","dosage":"15g","actions":["Tonifies Qi and Blood Tonifies Wei Qi, stabilizes the Exterior tonifies the Lungs, aids the circulation of moisture downward from the face and generates Body Fluids."]},{"herb":"MaiMenDong","dosage":"6g","actions":["Moistens the Lungs and Intestines, nourishes Lung and Stomach Yin and generates fluids.","With Sheng Di Huang, for Yin Deficiency with Excess Heat.","With Tian Men Dong, for Lung and Kidney Yin Deficiency."]},{"herb":"TianMenDong","dosage":"6g","actions":["Nourishes the Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, nourishes the Kidneys and generates fluids.","With Mai Men Dong, for Yin Deficiency with injured fluids."]},{"herb":"TaoRen","dosage":"6g","actions":["Dispels Blood Stasis, invigorates Blood circulation and moistens Intestines."]},{"herb":"HongHua","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"JingJie","dosage":"9g","actions":["Releases the Exterior, expels Wind, vents rashes and relieves itching."]},{"herb":"BaiJiLi","dosage":"9g","actions":["Dispels Wind and stops itching."]},{"herb":"HuangQin","dosage":"6g","actions":["Clears Heat and dries Dampness."]}],"actions":["Enriches Yin","Moistens Dryness","Clears Heat","Expels Wind"],"syndromes":["Blood Deficiency"],"manifestations":{"symptoms":["Dizziness","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Fatigue","Scanty periods"],"tongue":"Pale","tongueCoat":"Thin, white and dry","pulse":"Thready and rapid or Weak"},"conditions":[{"condition":"DrySkin","name":"Dry skin"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}