{"formula":"YangJingZhongYuTangJiaNuZhenZiMoHanLian","names":{"pinyin":"yang jing zhong yu tang jia nu zhen zi han lian cao","hanzi":"养精种玉汤加女真子旱莲草","english":"nourishing the essence and growing jade decoction with ligustrum and eclipta","commonEnglish":"Nourishing the Essence and Growing Jade Decoction with Ligustrum and Eclipta","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9-12g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold,stops pain due to Blood Stasis and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"BaiShao","dosage":"9-15g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, calms Liver Yang, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"ShanZhuYu","dosage":"9-12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin, strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Dang Gui and Shu Di Huang, for night sweats due to Yin Deficiency."]},{"herb":"NuZhenZi","dosage":"4.5-18g","actions":["Nourishes and tonifies Liver and Kidney Yin and clears Deficiency Heat.","With Mo Han Lian, strengthens the Yin to blacken the hair."]},{"herb":"MoHanLian(Cao)","dosage":"9-15g","actions":["Nourishes and tonifies Liver and Kidney Yin, cools the Blood and stops bleeding.","With Nu Zhen Zi, for dizziness, blurred vision, and premature graying of the hair due to severe Liver and Kidney Yin Deficiency with ascendant Yang."]}],"actions":["Tonifies the Kidneys","Nourishes Jing","Strengthens the Blood"],"syndromes":["Infertility due to Kidney Yin Deficiency"],"manifestations":{"symptoms":["Long-term infertility","Early menstruation","Possibly a history of late menarche","Irregular periods","Infrequent menstruation","Decreased menses with light colored Blood and no blood clots","Period either scanty or heavy","Prolonged menstrual cycle","Amenorrhea","Loss of libido","Emaciation","Dizziness","Night sweating","Blurred vision","Palpitations","Insomnia","Tinnitus","Hearing loss","A weak lower body","Five sole Heat or","Low-grade fever in the afternoon","Back soreness","Aches and weakness in the waist and legs","Dry mouth","Dry bowl movements","Dry vagina","Cold limbs","A dusky complexion","Dull-pale complexion"],"tongue":"Red","tongueCoat":"Little or None","pulse":"Thready and rapid or Floating and Empty"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"emaciation or a thin body with Five Sole Heat and Fire Rising","modifications":[{"herb":"MuDanPi","modification":"+ Cx. Moutan"},{"herb":"DiGuPi","modification":"+ Cx. Lycii"},{"herb":"HuangBai","modification":"+ Cx. Phellodendri"},{"herb":"GuiBan","modification":"+ Plastrum Testudinis"}]}]}