{"formula":"YangXueXiaoFengZaoShiFang","names":{"pinyin":"yang xue xiao feng zao shi fang","hanzi":"养血消風燥湿方","english":"nourish the blood, disperse wind and dry dampness formula","commonEnglish":"Nourish the Blood, Disperse Wind and Dry Dampness Formula","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"25g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"BaiXianPi","dosage":"25g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"LianQiao","dosage":"25g","actions":["Clears Heat, especially in the Upper Jiao, and relieves toxicity"]},{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChiShao","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and clears Liver Fire.","With Chuan Xiong and Dang Gui, for abscesses, boils and trauma induced pain."]},{"herb":"ChanTui","dosage":"15g","actions":["Disperses Wind, clears Heat, vents rashes, relieves itching, stops spasms and extinguishes Liver Wind."]},{"herb":"HuangBai","dosage":"15g","actions":["Drains Damp-Heat especially from the Lower Jiao, drains Fire and relieves Fire toxicity.","With Cang Zhu, regulates painful obstruction in the legs and knees for Lower Jiao Damp-Heat with pain, swelling and weakness in the lower limbs."]},{"herb":"CangZhu","dosage":"15g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao.","With Huang Bai, for pain, swelling, and weakness of the lower extremities or skin lesions due to Wind-Dampness."]},{"herb":"BaiJiLi","dosage":"15g","actions":["Calms the Liver, anchors Yang, dredges Liver Qi, disperses Stagnation and clumping, dispels Wind-Heat, stops itching and extinguishes Liver Wind."]},{"herb":"HeShouWu","dosage":"15g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and expels Wind from the skin by nourishing the Blood."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood,d promotes the movement of Qi, expels Wind and alleviates pain.","With Dang Gui, for Wind-Damp Invasion blocking the Blood vessels causing pain, numbness and paralysis."]},{"herb":"JiangCan","dosage":"9g","actions":["Extinguishes Wind, stops spasms and convulsions, dispels Wind, disperses Wind-Heat and stops itching and pain."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat and relieves Fire toxicity."]}],"actions":["Disperses Wind","Clears Heat","Dries Dampness","Nourishes and invigorates the Blood"],"syndromes":["Wind-Damp-Heat Damaging the Blood"],"manifestations":{"symptoms":["Dark, red, swollen skin lesions which may itch","Generalized pain and weakness which tends to be worse in hot weather","Aggravation of symptoms in women before and during menstruation","Possible hot, swollen, red, painful joints"],"tongue":"Red or Pale with a red tip or Dry or Scanty (may be slimy at the root)","tongueCoat":"Yellow","pulse":"Thready, slippery and rapid"},"conditions":[{"condition":"Polymyositis-Dermatomyositis","name":"Polymyositis/Dermatomyositis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe itching","modifications":[{"herb":"WuShaoShe","modification":"+ 9g Zaocys"}]},{"purpose":"hot, swollen, painful joints","modifications":[{"herb":"RenDongTeng","modification":"+ 12g Caulis Lonicerae"},{"herb":"HongTeng","modification":"+ 12g Caulis Sargentodoxae"},{"herb":"HaiTongPi","modification":"+ 12 Cx. Erythrinae"}]}]}