{"formula":"YangXueRunFuYinSanHao","names":{"pinyin":"yang xue run fu yin san hao","hanzi":"养血润肤饮三号","english":"nourish the blood and moisten the skin decoction #3","commonEnglish":"Nourish the Blood and Moisten the Skin Decoction #3","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"9g","actions":["Tonifies, activates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for Qi and Blood Deficiency.","With Tao Ren and Hong Hua, for symptoms associated with Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes Jing and Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Sheng Ma, cools Heat in the Lungs and Stomach, stopping hemoptysis and hematemesis."]},{"herb":"HuangQi","dosage":"12g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores."]},{"herb":"TianMenDong","dosage":"6g","actions":["Nourishes Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, and generates fluids."]},{"herb":"MaiMenDong","dosage":"6g","actions":["Moistens the Lungs and nourishes Yin.","With Tian Men Dong, for Lung and Kidney Yin Deficiency.","With sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"ShengMa","dosage":"3g","actions":["Releases the Exterior, vents rashes, clears Heat, relieves toxicity, raises Yang and lifts sunken Qi.","With DAng Gui and Tao Ren, raises the clear Qi, allowing turbidity to descend and moistening the Intestines."]},{"herb":"HuangQin","dosage":"3g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies."]},{"herb":"TaoRen","dosage":"2g","actions":["Breaks up Blood Stasis , activates Blood circulation, moistens the Intestines and unblocks the bowels."]},{"herb":"HongHua","dosage":"2g","actions":["Activates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, activates the Blood for all types of Blood Stagnation."]},{"herb":"TianHuaFen","dosage":"4.5g","actions":["Drains Heat, generates Fluids, relieves toxicity, expels pus and reduces swelling."]}],"actions":["Expels Wind","Clears Heat","Nourishes Yin and Blood","Eliminates Dampness"],"syndromes":["Wind-Heat with Blood Dryness"],"manifestations":{"symptoms":["The lesions have a slightly erythematous base","The scales are dry and powdery","The scales may be very thick on the scalp"]},"conditions":[{"condition":"SeborrheicDermatitis","name":"Seborrheic dermatitis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"dry stools","modifications":[{"herb":"HuoMaRen","modification":"+ 9-15g Sm. Cannabis"},{"herb":"YuLiRen","modification":"+ 9-15g Sm. Pruni"}]},{"purpose":"Wind predominant with severe itching","modifications":[{"herb":"TianMa","modification":"+ 4.5g Rz. Gastrodiae"}]}]}