{"formula":"YanHuSuoSan","names":{"pinyin":"yan hu suo san","hanzi":"延胡索散","english":"corydalis powder","commonEnglish":"Corydalis Powder","aka":["Yan Hu Suo Tang","Corydalis Decoction"]},"herbs":[{"herb":"DangGui","dosage":"15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Zhi Gan Cao, moderates spasms and relieves abdominal pain."]},{"herb":"YanHuSuo","dosage":"15g","actions":["Regulates the flow of Qi and Blood, to treat milder cases of menstrual irregularity or dull ache in the epigastrium from clumped Qi in the Spleen and Stomach and rises to the head, descends, reaches the surface and the interior."]},{"herb":"PuHuang","dosage":"15g","actions":["Stops bleeding by astringing, tonifies and invigorates the Blood and dispels Blood Stasis."]},{"herb":"ChiShao","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood."]},{"herb":"RouGui","dosage":"15g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels, alleviates pain and assists in the generation of Qi and Blood."]},{"herb":"JiangHuang","dosage":"9g","actions":["Invigorates the Blood, eliminates Blood Stasis, unblocks menstruation, promotes the movement of Qi, opens the channels and collaterals to alleviate pain.","With Dang Gui and Yan Hu Suo, for amenorrhea and abdominal pain from Liver Qi Stagnation with Blood Stasis.","With Rou Gui, for Blood Stasis causing dysmenorrhea and postpartum abdominal pain."]},{"herb":"RuXiang","dosage":"9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Mo Yao, for Blood Stasis obstructing the channels with epigastric, flank abdominal and joint pain.","With Yan Hu Suo, for chest and abdominal pain."]},{"herb":"MoYao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain and reduces swelling.","With Ru Xiang, for abdominal pain during menstruation and irregular menstruation."]},{"herb":"MuXiang","dosage":"9g","actions":["Promotes the movement of Qi, alleviates pain, adjusts and regulates stagnant Qi in the Intestines and strengthens the Spleen."]},{"herb":"GanCao","dosage":"7.5g","actions":["Moderates spasms, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Invigorates the Blood","Breaks up Stasis","Moves Qi","Regulates menstruation","Stops pain"],"syndromes":["Qi and Blood Stagnation"],"manifestations":{"symptoms":["Scant lochia or","Immediate cessation of lochia after delivery","Paroxysmal spasms of lower abdominal pain which feels as if something were jerking or colliding in the area","Stabbing chest and abdominal pain radiating downward into the low back and flanks or upward into the upper back and arms","Worse with pressure","Difficult menstruation","Late menstruation","Irregular menstruation","Smooth urination","Polyuria"],"tongue":"Dark purple","pulse":"Choppy"},"conditions":[{"condition":"PostPartumAbdominalPain","name":"Postpartum abdominal pain"},{"condition":"Dysmenorrhea","name":"Dysmenorrhea"}],"contra":{"contraindications":["Contraindicated during pregnancy."],"interactions":[""]},"notes":[""],"modifications":[]}