{"formula":"YaoLiuAnJiaoNang","names":{"pinyin":"yao liu an jiao nang","hanzi":"药流安胶囊","english":"yao liu an capsule","commonEnglish":"Yao Liu An Capsule","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis and regulates the menses.","With Huang Qi, for pallor, debility, fatigue and/or low grade fever due to excessive blood loss.","With Tao Ren and Hong Hua, for symptoms associated with Blood Stasis.","With Chuan Xiong and Pau Jiang, for postpartum Blood Deficiency with Cold."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems.","With Dang Gui, Hong Hua and Tao Ren, for abdominal pain accompanying menstruation.","With Yi Mu Cao and Tao Ren, for postpartum Blood Stasis.","With Dang Gui, Pao Jiang, Zhi Gan Cao and Tao Ren, for continuous postpartum bleeding due to Blood Stasis with Blood Deficiency and Cold."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis and invigorates Blood circulation.","With Pau Jiang and Chuan Xiong, for lochioschesis and abdominal pain."]},{"herb":"HongHua","dosage":"3-10g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, unblocks menstruation and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis.","With Yi Mu Cao, for Blood Stasis with abdominal pain or postpartum lochiostasis.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"SanQi","dosage":"2-10g","actions":["Stops bleeding, transforms Blood Stasis and invigorates the Blood."]},{"herb":"EJiao","dosage":"3-16g","actions":["Tonifies and nourishes the Blood and stops bleeding."]},{"herb":"PuHuang","dosage":"3-12g","actions":["Stops bleeding by astringing, invigorates the Blood and dispels Blood Stasis.","With Pau Jiang, for abdominal pain and distention due lochiostasis.","With Yi Mu Cao and Dang Gui, for postpartum bleeding."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood and strengthens the Spleen.","With San Qi and E Jiao, for bleeding due to Qi Deficiency."]},{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis and regulates menstruation.","With Dang Gui, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness, and scanty menstruation.","With Dang Gui and Chuan Xiong, for dysmenorrhea or lower abdominal pain due to postpartum Blood Stasis.","With Pau Huang, for lochioschesis."]},{"herb":"QianCaoGen","dosage":"6-16g","actions":["Cools the Blood, stops bleeding, Invigorates the Blood and dispels Blood Stasis."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, cools the Blood, stops bleeding and calms the fetus."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Stops bleeding associated with Deficiency Cold."]},{"herb":"HuaRuiShi","dosage":"9-15g","actions":["Stops bleeding, invigorates the Blood and disperses Blood Stasis."]}],"actions":["Invigorates the Blood","Dispels Blood Stasis","Stops bleeding","Clears Heat","Disperses Cold"],"syndromes":["Uterine bleeding due to Blood Stagnation"],"manifestations":{"symptoms":["Pos-abortion bleeding","Post-miscarriage bleeding"]},"conditions":[{"condition":"Metrorrhagia","name":"Post-abortion bleeding "},{"condition":"Metrorrhagia","name":"Post-miscarriage bleeding "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}