{"formula":"YeZhongWan","names":{"pinyin":"ye zhong wan","hanzi":"pills for treating dysphagia","commonEnglish":"Pills for Treating Dysphagia","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"120g","actions":["Nourishes Jing and Blood, nourishes Liver and Kidney Yin and fills the Marrow.","With Shan Zhu Yu, Huang Bai and Shan Yao, for dizziness, weak and sore back, impotence, spermatorrhea and night sweats, due to Kidney and Liver Yin Deficiency with Deficiency Heat.","With Huang Bai and Zhi Mu, for Yin Deficiency Heat.","With Shan Yao and Ze Xie, for ascendant Fire due to exhaustion of Kidney Yin.","With Wu Wei Zi, Shan Yao and Shan Zhu Yu, for cough, shortness of breath and accelerated respiration."]},{"herb":"ShanZhuYu","dosage":"30g","actions":["Stabilizes the Kidneys, astringes Jing, tonifies Liver and Kidney Yin and tonifies Kidney Yang.","With Wu Wei Zi, for spermatorrhea, abnormal sweating, palpitations and shortness of breath due to Yin and Yang Deficiency of the Liver and Kidneys.","With Shu Di Huang nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Shu Di Huang and Shan Yao, for Kidney Deficiency.","With Shu Di Huang, Shan Yao, Mu Dan Pi, Ze Xie and Fu Ling, for Kidney and Liver Yin Deficiency."]},{"herb":"ShanYao","dosage":"30g","actions":["Tonifies Spleen and Lung Qi, nourishes Stomach, Lung and Kidney Yin, stops diarrhea and astringes Jing."]},{"herb":"MuDanPi","dosage":"17g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Shan Zhu Yu, Ze Xie and Fu Ling, for spermatorrhea due to Kidney Yin Deficiency with Heat."]},{"herb":"ZeXie","dosage":"30g","actions":["Promotes urination, leaches out Dampness and Drains Kidney Fire.","With Mu Dan Pi, for steaming bone disorder, dizziness, and vertigo."]},{"herb":"ZhiMu","dosage":"20g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst."]},{"herb":"HuangBai","dosage":"20g","actions":["Drains Kidney Fire, drains Fire, relieves Fire toxicity and inhibits the growth of cancer cells.","With Zhi Mu, for Yin Deficiency fever."]},{"herb":"TianMenDong","dosage":"12g","actions":["Nourishes Kidney Yin, clears Lung Heat, sedates Fire, moistens the Lungs, nourishes the Kidneys, generates fluids, resolves Phlegm and inhibits the growth of cancer cells."]},{"herb":"WuWeiZi","dosage":"12g","actions":["Astringes leakage of Lung Qi, stops cough, tonifies Qi, tonifies the Kidneys, astringes Jing, stops diarrhea and spermatorrhea, astringes sweat and generates fluids.","With Shan Zhu Yu, Shan Yao and Shu Di Huang, for Lung and Kidney Deficiency with cough and wheezing."]},{"herb":"FuLing","dosage":"120g","actions":["Strengthens the Spleen, promotes urination and leaches out Dampness and inhibits the growth of cancer cells.","With Ze Xie, facilitates the removal of water."]}],"actions":["Tonifies Qi","Nourishes Yin","Nourishes Blood","Invigorates the Blood","Clears Heat","Clears Deficiency Fire","Astringes Fluids"],"syndromes":["Yin and Blood Deficiency with Empty Fire Rising"],"manifestations":{"symptoms":["Dizziness","Tinnitus or deafness","Poor memory","Aching, soreness or weakness of the low back","Spermatorrhea or","Premature ejaculation","Aching in the bones","Aching in the leg and heel","Dry mouth","Thirst","Night sweats","Five Sole Heat","Malar flush","Low grade fever in the afternoon","Dry throat, maybe recurrent sore throat","Dry stools and/or","Constipation","Urine short and red","Heightened libido","Blurred vision","Palpitations","Insomnia","Dry skin","Dry hair","Poor memory","Paleness","Fatigue","Scanty periods"],"tongue":"Variable","tongueCoat":"Thin, white and dry or Little or None","pulse":"Thready and rapid or Weak"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer recovery stage"},{"condition":"Dysphagia","name":"Dysphagia"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Grind the ingredients into a fine powder and then make into pills with honey. Take 9g twice a day."],"modifications":[]}