{"formula":"YiJingZhuangYangTang","names":{"pinyin":"yi jing zhuang yang tang","hanzi":"医精壮阳汤","english":"stop nocturnal emissions and strengthen kidney yang decoction","commonEnglish":"Stop Nocturnal Emissions and Strengthen Kidney Yang Decoction","aka":[""]},"herbs":[{"herb":"ShanYao","dosage":"20g","actions":["Tonifies Kidney Yin and astringes Jing.","With Shu Di Huang and Shan Zhu Yu, for Kidney Deficiency with spermatorrhea and night sweats."]},{"herb":"ShuDiHuang","dosage":"20g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Shan Yao, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"GouQiZi","dosage":"20g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Shu Di Huang, for Liver and Kidney Deficiency."]},{"herb":"ShanZhuYu","dosage":"20g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Shu Di Huang and Shan Yao, for urinary frequency (day or night), dizziness, tinnitus and lower back pain due to Kidney Deficiency."]},{"herb":"FuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations and shortness of breath."]},{"herb":"RouCongRong","dosage":"15g","actions":["Tonifies the Kidneys, strengthens the Yang","and benefits Jing and marrow.","With Suo Yang, for impotence, Cold and discomfort in the low back."]},{"herb":"SuoYang","dosage":"15g","actions":["Tonifies the Kidneys, benefits Jing and marrow, strengthens Yang, nourishes Liver Yin and Blood and strengthens sinews and bones."]},{"herb":"BaJiTian","dosage":"15g","actions":["Tonifies the Kidneys and strengthens Yang.","With Rou Cong Rong and Tu Si Zi, for Impotence, spermatorrhea and premature ejaculation due to Kidney Yang Deficiency.","With Ren Shen and Shan Yao, for impotence or infertility.","With Rou Cong Rong, tonifies Yang without injuring Yin."]},{"herb":"RenShen","dosage":"15g","actions":["Powerfully tonifies Yuan Qi Tonifies Lung, Heart, Spleen and Stomach Qi, generates Body Fluids, stops thirst and treats impotence.","With Shu Di Huang and Tian Men Dong, for Qi and Yin Deficiency."]},{"herb":"SuanZaoRen","dosage":"15g","actions":["Nourishes Heart Yin, tonifies Liver Blood, calms the Spirit, astringes sweat and generates fluids."]},{"herb":"TuSiZi","dosage":"15g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver and improves vision."]},{"herb":"TianMenDong","dosage":"10g","actions":["Moistens the Lungs, nourishes the Kidneys,","generates fluids and resolves Phlegm.","With Ren Shen and Shu Di Huang, for debility and low grade fever due to Yin Deficiency."]},{"herb":"GanCao","dosage":"10g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Tonifies Kidney Yang","Nourishes the Liver and Kidneys","Nourishes Yin","Relieves Empty Fire due to Deficiency of Yin"],"syndromes":["Kidney Yin and Yang Deficiency"],"manifestations":{"symptoms":["Impotence","Failure to maintain an erection","Dizziness","Tinnitus","Weak legs","Lower back ache","Low-grade fever in the afternoon","Cold hands and feet","Fatigue","Red cheeks","Hot flushed face","Spermatorrhea due to Deficient Yin","Nocturnal emissions","Fever with thirst","Burning soles of feet","Hot flashes","Night sweating","Spontaneous sweat","Dry cough","Headache","Restlessness","Early periods","Pale dilute menstrual Blood","Nocturia","General feeling of being Cold","Restless insomnia","Vertigo,"],"tongue":"Pale and swollen or Red or a Red tip","tongueCoat":"Thin and white or Little or None","pulse":"Deep and weak or Thready and rapid"},"conditions":[{"condition":"Impotence","name":"Impotence"},{"condition":"Spermatorrhea","name":"Nocturnal emissions"},{"condition":"Spermatorrhea","name":"Spermatorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}