{"formula":"YinChenWeiLingTang","names":{"pinyin":"yin chen wei ling tang","hanzi":"阴陈胃苓汤","english":"capillaris and poria stomach decoction","commonEnglish":"Capillaris and Poria Stomach Decoction","aka":[""]},"herbs":[{"herb":"YinChen(Hao)","dosage":"30g","actions":["Clears Damp-Heat from the Gallbladder and Liver, relieves jaundice and is the principle herb for treating jaundice.","With Fu Ling, Gui Zhi and Ze Xie, for Damp predominant jaundice with marked urinary dysfunction.","With Hou Po, for Summer-Heat with Damp turbidity Obstructing the Middle Jiao or jaundice."]},{"herb":"CangZhu","dosage":"9g","actions":["Dispels Dampness, tonifies the Spleen and strengthens the transporting function of the Spleen.","With Hou Po, for Dampness Obstructing the middle Jiao."]},{"herb":"HouPo","dosage":"9g","actions":["Circulates Qi, dispels Dampness, disperses fullness and warms the Spleen.","With Cang Zhu, dries Damp and tonifies the Spleen.","With Chen Pi, revives the Spleen and increases appetite.","With Cang Zhu and Chen Pi, for stomach Excess with epigastric fullness and distention, acid regurgitation, distasteful belching, and nausea and vomiting and Dampness Accumulation with Qi Stagnation."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, transforms Dampness, strengthens the Spleen and descends Qi.","Assists Hou Po in descending Qi and eliminating distention.","With Bai Zhu, for anorexia and other manifestations of Damp-Obstruction due to Spleen Deficiency.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drinks."]},{"herb":"BaiZhu","dosage":"9g","actions":["Strengthens the Spleen, resolves dampness and aids transformation and transportation of Fluids.","With Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema.","With Cang Zhu, for Damp Cold Painful Obstruction, musculoskeletal disorders of the arms and shoulders due to Phlegm Stagnation and vaginal discharge.","With Zhu Ling and Ze Xie, for edema due to Internal Dampness.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiencies.","With Fu Ling, Zhu Ling and Ze Xie, for edema with Spleen Deficiency.","With Gui Zhi, Fu Ling and Gan Cao, for Phlegm Accumulation."]},{"herb":"GuiZhi","dosage":"6g","actions":["Warms the Ming Men, assists the Bladder in transforming and passing urine, helps the Spleen resolve Dampness and releases the exterior.","With Zhi Gan Cao, for palpitations and shortness of breath due to injured Yang of the chest.","With Fu Ling, Zhu Ling, Ze Xie and Bai Zhu, for edema and dysuria due to Yang Deficiency."]},{"herb":"ZhuLing","dosage":"6g","actions":["Eliminates Dampness and promotes urination.","With Ze Xie, drains Dampness, promotes urination and drains Heat from the Bladder."]},{"herb":"FuLing","dosage":"6g","actions":["Assists Yang, drains Dampness, promotes urination and strengthens the Spleen.","With Zhu Ling, promotes urination to treat Lin Syndrome, scanty urine, edema, loose stools, vaginal discharge, jaundice, leg Qi and diarrhea.","With Zhu Ling and Ze Xie, strengthens its ability to promote urination and leach out Dampness and treats dysuria and Phlegm accumulation","With Bai Zhu, strengthens the Spleen and promotes urination.","With Gui Zhi, warms and transforms Fluids, unblocks Yang, promotes urination and reduces edema.","With Ze Xie, Gui Zhi and Bai Zhu, for Damp Obstruction causing Lin Syndrome, edema, heaviness of the body, and irritability.","With Zhi Gan Cao, for Spleen and Heart Deficiencies causing facial edema, palpitations, and shortness of breath."]},{"herb":"ZeXie","dosage":"6g","actions":["Drains Dampness and promotes urination.","With Bai Zhu, for thin mucus beneath the Heart leading to cough, vertigo, dizziness and tinnitus, Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea Milky Lin or vaginal discharge and Meniere's Disease.","With Fu Ling, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Fu Ling and Zhu Ling, for generalized edema."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Promotes urination","Drains Dampness","Strengthens the Spleen","Regulates flow of Qi in the Spleen and Stomach","Purges Heat from Liver and Gallbladder"],"syndromes":["Damp-Heat in the Liver and Gallbladder with more Dampness than Heat"],"manifestations":{"symptoms":["Jaundice","No fever or","Mild fever","The head is heavy and full","Heaviness of the body","Wrapping headache","A sensation of obstruction, fullness, or discomfort in the chest and epigastrium","Anorexia","Nausea","Vomiting","Abdominal distention","Fatigue","Lack of strength","Loose stools with difficult defecation","Thirst with no desire to drink","Aversion to oily, greasy foods","Scanty, concentrated urine","Aversion to cigarette smoke"],"tongue":"Flabby","tongueCoat":"Thick and yellow or Whitish and greasy","pulse":"Soggy and moderate or Wiry and slippery"},"conditions":[{"condition":"Jaundice","name":" Jaundice"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}