{"formula":"YinChenSiLingSan","names":{"pinyin":"yin chen si ling san","hanzi":"茵陳四苓散","english":"four ingredients powder with poria and artemisia","commonEnglish":"Four Ingredients Powder with Poria and Artemisia","aka":[""]},"herbs":[{"herb":"YinChen(Hao)","dosage":"30-60g","actions":["Clears Damp-Heat from Liver and Gallbladder, treats all types of jaundice, especially Damp-Heat jaundice and inhibits the growth of cancer cells.","With Zhi Zi strongly relieves Damp-Heat jaundice.",""]},{"herb":"ZhiZi","dosage":"9g","actions":["Clears Heat from the three Jiaos through the urine, drains Damp-Heat,d invigorates the Blood and inhibits the growth of cancer cells.","With Bai Mao Gen, for epistaxis, hematemesis or hematuria."]},{"herb":"CheQianZi","dosage":"12g","actions":["Promotes urination, clears Damp-Heat, clears Liver Heat and clears the eyes.","With Ze Xie, for Lin Syndrome, edema and distention.","With Bai Mao Gen, unblocks Lin , cools the Blood and stops bleeding for Damp-Heat clumping to cause scanty urination with pain and hematuria and edema in the lower limbs due to accumulation of water and Dampness.","With Cang Zhu, for Damp-Heat vaginal discharge with Spleen Deficiency."]},{"herb":"ZeXie","dosage":"12g","actions":["Promotes urination, resolves Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge."]},{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness, tonifies the Spleen and clears Dampness from the Lower Jiao."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"BaiZhu","dosage":"12g","actions":["Strengthens the Spleen, aids transformation and transportation of fluids, resolves Dampness and inhibits the growth of cancer cells.","With Cang Zhu, for vaginal discharge."]},{"herb":"ZhuLing","dosage":"15g","actions":["Promotes urination, leaches out Dampness, dispels Heat and inhibits the growth of cancer cells.","With Ze Xie, drains Damp, unblocks and drains urinary pathways and drains Heat from the Bladder."]},{"herb":"CaoDouKou","dosage":"9g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen."]},{"herb":"BaiMaoGen","dosage":"30g","actions":["Cools the Blood, stops bleeding, clears Heat, promotes urination and inhibits the growth of cancer cells.","With Yin Chen Hao and Zhi Zi, for jaundice due to Damp-Heat."]}],"actions":["Clears Heat","Resolves Dampness","Reduces jaundice"],"syndromes":["Damp-Heat in the Liver and Gall Bladder with more Dampness that Heat"],"manifestations":{"symptoms":["Light yellow coloration","Heaviness of the head and body","Epigastric and abdominal fullness and distention","Anorexia","Thirst with no desire to drink","Loose stools"],"tongue":"Pink with red tip and edges","tongueCoat":"Whitish-gray","pulse":"Soft or slippery"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}