{"formula":"YingErShiZhenNeiFuFangYi","names":{"pinyin":"ying er shi zhen nei fu fang yi","hanzi":"婴儿湿疹内复方一","english":"internal formula for infantile eczema #1","commonEnglish":"Internal Formula for Infantile Eczema #1","aka":[""]},"herbs":[{"herb":"ChiShao","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat, cools the Blood and reduces swelling from sores and abscesses."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat and cools the Blood.","With Chi Shao and Mu Dan Pi, for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"MuDanPi","dosage":"6g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Chi Shao, for purpuric rash, hematemesis and Heat injuring the Ying and Xue levels.","With Sheng Di Huang, for a rash all over the body."]},{"herb":"ChanTui","dosage":"4g","actions":["Disperses Wind, clears Heat, vents rashes and relieves itching."]},{"herb":"BaiXianPi","dosage":"12g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"QianCaoGen","dosage":"9g","actions":["Cools and Invigorates the Blood, dispels Blood Stasis and disperses Wind-Dampness."]},{"herb":"ZiSuYe","dosage":"4g","actions":["Releases the Exterior and disperses Cold.","With Chan Tui, for rashes or itching."]},{"herb":"DengXinCao","dosage":"5pcs","actions":["Promotes urination, and leaches out Dampness."]},{"herb":"ShanZha","dosage":"9g","actions":["Reduces and guides out Food Stagnation, transforms accumulations and Blood Stasis, invigorates Blood circulation and dissipates clumps."]},{"herb":"GuYa(DaoYa)","dosage":"15g","actions":["Reduces Food Stagnation, promotes digestion, strengthens and opens the Stomach and harmonizes the Center."]}],"actions":["Clears Heat","Transforms Dampness","Alleviates itching"],"syndromes":["Damp-Heat"],"manifestations":{"symptoms":["Particularly in fat babies","Main sites involved: Face Head Neck May spread to other areas","Lesions: Erythema Papules and Vesicles Thick exudation","As the disease develops, crusts appear and itching becomes increasingly pronounced, leading to disturbance of sleeping patterns.","The body is leaner and weaker","The lesions, usually dark red, are on the face, neck and often the hands and feet, with no clear boundaries","Often small lesions covered with lichens form thin white scales, with signs of itching and can create a little bleeding, but no discharge","Itching","Insomnia","These babies are pale looking, with poor appetite"],"tongue":"Additional Symptoms: Constipation Short yellow urine  Pale red or Red or Red tip C: Thin white or yellow P: Rapid or Slippery and rapid"},"conditions":[{"condition":"AtopicDermatitis","name":"Atopic dermatitis"},{"condition":"Erythema","name":"Erythema"},{"condition":"AtopicDermatitis","name":"Infantile eczema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}