{"formula":"YinHuaHuZhangTangJiaJian","names":{"pinyin":"yin hua hu zhang tang jia jian","hanzi":"银花胡杖汤加減","english":"modified lonicera and polygoni cuspidati decoction","commonEnglish":"Modified Lonicera and Polygoni Cuspidati Decoction","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"15g","actions":["Clears Heat, resolves Fire toxicity, vents and disperses External Wind-Heat and cools the Blood.","With Dang Gui, reduces obstruction and toxicity for swollen, painful sores and necrosis of surrounding tissue."]},{"herb":"HuZhang","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the channels, stops pain, clears Heat, resolves Dampness, discharges toxins and disperses swelling."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates, cools and nourishes the Blood, dispels Blood Stasis, clears Heat and soothes irritability.","With Mu Dan Pi and Sheng Di Huang, for Ying Stage Heat."]},{"herb":"JiXueTeng","dosage":"15g","actions":["Invigorates and tonifies the Blood."]},{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"DangGui","dosage":"12g","actions":["Invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis."]},{"herb":"ChiShao","dosage":"12g","actions":["Clears Heat, cools and Invigorates the Blood, dispels Blood Stasis, reduces swelling from sores and abscesses and relieves pain.","With Mu Dan Pi and Sheng Di Huang, for Heat entering the Xue Stage causing maculae or hemorrhage."]},{"herb":"HuaiHuaMi","dosage":"12g","actions":["Cools the Blood."]},{"herb":"DaQingYe","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood and dissipates maculae.","With Jin Yin Hua, for toxic Heat sores, and erysipelas."]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat,cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Chi Shao, cools the Blood and disperses Stasis, for Ying Stage Heat with skin rashes.","With Sheng Di Huang, for Ying and Xue Stage Heat."]},{"herb":"ZiCao","dosage":"10g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins, encourages rashes clears Damp-Heat from the skin and aids healing of tissues."]},{"herb":"BeiDouGen","dosage":"10g","actions":["Clears Heat, resolves toxicity, resolves Dampness, reduces swelling, dispels Wind and stops pain."]},{"herb":"ShaShen","dosage":"10g","actions":["Nourishes Yin, moistens the Lungs, nourishes the Stomach, generates fluids and clears Heat."]}],"actions":["Cools the Blood","Relieves toxicity","Invigorates the Blood","Reduces erythema"],"syndromes":["Blood Heat"],"manifestations":{"symptoms":["This pattern occurs in the early stages of an initial attack or subsequent episode of guttate or plaque psoriasis.","Small coin sized red maculae located on the scalp, body, extremities, and other areas that increase rapidly","The lesions may manifest as bright red or dark red papules, maculopapules or macular patched of varying sizes scattered throughout the body or distributed mostly on the trunk and limbs","Sometimes lesions start on the scalp before spreading gradually to other parts of the body","New lesions appear continuously,","The area involved is large","There is a covered silvery-white scale","The scales are heaped up","The scales are easily shed when scratched","The scales elicit the characteristic Auspitz’s sign on removal of the underlying moist layer.","Usually affects people under age 40","Itching may be intense","Worse during the summer","Aversion to Heat","Irritability","Restlessness","Thirst","Dry throat","Dry tongue","Bitter taste in the mouth","Dry stools","Constipation","Yellow, scanty urine"],"tongue":"With Dryness: Lesions are on the elbows, knees or lumbar area They are reddish at the beginning White covered lesions become fissures Pain  Red C: None or Thin yellow P: Thready and rapid","tongueCoat":"Thin yellow or white or Yellow and grimy","pulse":"Slippery or Taut and rapid or Thin and rapid or Wiry and rapid, or Slippery and rapid."},"conditions":[{"condition":"Psoriasis","name":"Psoriasis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}