{"formula":"YinQiaoBaiDuSan","names":{"pinyin":"yin qiao bai du san","hanzi":"银翘败毒丸","english":"honeysuckle and forsythia powder to overcome pathogenic influences","commonEnglish":"Honeysuckle and Forsythia Powder to Overcome Pathogenic Influences","aka":["Antiphlogistic Powder of Lonicera Flower and Forsythia"]},"herbs":[{"herb":"JinYinHua","dosage":"6-9g","actions":["Clears Heat, resolves Fire toxicity and vents and disperses External Wind-Heat.","With Lian Qiao, for various Heat disorders."]},{"herb":"LianQiao","dosage":"6-9g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses and dissipates clumps.","With Jin Yin Hua, for initial-stage Wind-Heat."]},{"herb":"QiangHuo","dosage":"6-9g","actions":["Releases the Exterior, disperses Cold and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headaches and generalized body aches and pains associated with the common cold.","with Du Huo, for Wind-Dampness."]},{"herb":"DuHuo","dosage":"6-9g","actions":["Disperses Wind-Cold-Dampness and releases the Exterior.","With Qiang Huo, for joint pain and numbness."]},{"herb":"ChuanXiong","dosage":"6-9g","actions":["Activates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"ChaiHu","dosage":"6-9g","actions":["Disperses Wind-Heat and resolves Phlegm and congestion.","With Gan Cao, for Wind-Heat fever."]},{"herb":"BoHe","dosage":"3-6g","actions":["Disperses Wind-Heat, cools and clears the head and eyes, vents rashes and benefits the throat."]},{"herb":"ZhiKe(Qiao)","dosage":"6-9g","actions":["Promotes the movement of Qi, reduces distention and pressure, resolves hardenings and removes stagnated food.","With Chai Hu and Bo He, for Upper Jiao surface Heat problems.","With Jie Geng, regulates the flow of Qi in the chest and aids in the transformation of Phlegm for chest congestion."]},{"herb":"JieGeng","dosage":"6-9g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm, expels pus, benefits the throat and directs the effects of other herbs to the upper body.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus for productive coughing with hoarseness, pain and swelling of the throat due to Wind-Heat ."]},{"herb":"QianHu","dosage":"6-9g","actions":["Expels Phlegm, descends Qi and expels Wind-Heat.","With Chai Hu, for Wind-Heat constraining the Lungs, leading to a stifling sensation in the chest and cough with profuse sputum."]},{"herb":"FuLing","dosage":"6-9g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao."]},{"herb":"ShengJiang","dosage":"3-6g","actions":["Releases the Exterior, induces perspiration, disperses Cold, warms the Lungs, stops coughing and reduces the toxicity of other herbs."]},{"herb":"GanCao","dosage":"3-6g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dispels External Wind Heat and Dampness","Relieves toxicity"],"syndromes":["Toxic-Wind-Heat","Internal Heat toxin with simultaneous External Wind-Heat-Damp"],"manifestations":{"symptoms":["Fever","Anhidrosis","Aversion to Cold","Headache","Muscle aches","Nasal congestion","Cough with sputum","Suppurative infection","Carbuncles","Stiffness of the muscles","White and greasy or Yellow and greasy"],"tongue":"Red","pulse":"Floating and feeble or Floating and rapid or Deep and rapid"},"conditions":[{"condition":"CommonCold","name":"Common cold"},{"condition":"Influenza","name":"Influenza"},{"condition":"AcuteLaryngitis","name":"Acute laryngitis"},{"name":"Carbuncles "},{"condition":"Furuncles","name":"Furuncles"},{"condition":"NasalCongestion","name":"Nasal congestion"},{"name":"Suppurative infections"},{"condition":"AcuteTonsillitis","name":"Tonsillitis"},{"name":"Parotitis "},{"name":"Abscess"},{"condition":"Cough","name":"Cough"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}