{"formula":"YiPiTang","names":{"pinyin":"yi pi tang","hanzi":"益脾汤","english":"benefit the spleen decoction","commonEnglish":"Benefit the Spleen Decoction","aka":[""]},"herbs":[{"herb":"TaiZiShen","dosage":"12g","actions":["Strengthens the Spleen, tonifies Qi and generates Body Fluids.","With Shan Yao and Bai Bian Dou, moistens Spleen Yin, for Spleen Deficiency with lethargy and reduced appetite.","With Bai Zhu and Gu Ya, for poor appetite due to Spleen and Stomach Deficiency."]},{"herb":"FuLing","dosage":"9g","actions":["Strengthens the Spleen, harmonizes the Middle Jiao, promotes urination and leaches out Dampness.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Tai Zi Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Yi Yi Ren, for Spleen and Stomach Deficiency with Dampness.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Zhi Gan Cao, encourages Yang to produce Yin."]},{"herb":"JieGeng","dosage":"3g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm.","With Gu Ya, lifts Qi and assists transportation."]},{"herb":"ShanYao","dosage":"9g","actions":["Tonifies the Spleen, nourishes Stomach Yin and stops diarrhea.","With Fu Ling and Bai Zhu, for Spleen Deficiency with loose watery stools."]},{"herb":"LianZi","dosage":"9g","actions":["Tonifies the Spleen and astringes diarrhea.","With Shan Yao and Bai Zhu, for chronic diarrhea due to Spleen Deficiency.","With Qian Shi, inhibits chronic diarrhea or dysentery and watery, thin vaginal discharge, due to Spleen Deficiency and encourages the tonifying consolidation of Spleen Yin."]},{"herb":"YiYiRen","dosage":"9g","actions":["Strengthens the Spleen and resolves Dampness.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema."]},{"herb":"QianShi","dosage":"6g","actions":["Strengthens the Spleen and stops diarrhea.","With Lian Zi, Fu Ling and Bai Zhu, for chronic diarrhea due to Spleen Deficiency.","With Bai Bian Dou, Lian Zi and Shan Yao, for chronic diarrhea due to Spleen Deficiency with Dampness."]},{"herb":"BaiBianDou","dosage":"9g","actions":["Strengthens the Spleen.","With Bai Zhu and Shan Yao, for diarrhea or vaginal discharge due to Spleen Deficiency.","With Tai Zi Shen, Gu Ya and Shan Yao, for a slight Deficiency of the Spleen and Stomach.",""]},{"herb":"ShiHu","dosage":"12g","actions":["Nourishes Stomach Yin, clears Heat and generates fluids."]},{"herb":"GuYa(DaoYa)","dosage":"9g","actions":["Strengthens the Spleen and encourages appetite."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Tonifies the Spleen","Nourishes Yin","Eliminates Dampness"],"syndromes":["Spleen Yin Deficiency"],"manifestations":{"symptoms":["Poor appetite","Disordered digestion","Easily full after eating a small amount","Distension after eating","Loss of taste","Dry stools","Dry mouth and throat","Maybe mouth ulceration","Dry lips","Thin body","Dull complexion without luster","Night sweating","Five Sole Heat (only if there is Empty Heat)","Bleeding (in small quantity)","Difficulty putting on weight","Wasting of the flesh","Emaciation","Bowel movements alternate between slow and loose","Lack of strength in the limbs"],"tongue":"Normal or Red if there is Empty Heat","tongueCoat":"Little or None (the middle may be peeled)","pulse":"Thready, rapid and weak"},"conditions":[{"name":"Spleen Yin Deficiency"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}