{"formula":"YiQiFengYangBuXueFang","names":{"pinyin":"yi qi feng yang bu xue fang","hanzi":"翊气峰阳补血方","english":"boost qi, raise yang and nourish the blood formula","commonEnglish":"Boost Qi, Raise Yang and Nourish the Blood Formula","aka":[""]},"herbs":[{"herb":"BaiShao","dosage":"15g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei and calms Liver Yang and Liver Wind."]},{"herb":"DanShen","dosage":"15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, nourishes the Blood and calms the Spirit."]},{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting.","With Huang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia."]},{"herb":"HuangQi","dosage":"12g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach and generates Body Fluids.","With Sheng Ma, raises the Yang Qi of the Spleen, allowing turbid Yin to descend and be eliminated, treating chronic diarrhea, a dragging sensation in the abdomen, fatigue, shortness of breath, uterine bleeding and prolapses."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow."]},{"herb":"ChiShao","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Liver Fire and relieves eye pain.","With Bai Shao, for spasms and cramping pain associated with Blood Deficiency and Blood Stagnation.","With Mu Dan Pi, for Blood Stasis disorders."]},{"herb":"YuJin","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, regulates Qi flow, speeds healing of chronic sores and alleviates pain.","With Chai Hu, for Liver Qi and Blood Stagnation.",""]},{"herb":"MuDanPi","dosage":"12g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis and clears Liver Fire."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen and augments Qi.","With Dang Gui, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm and helps prevent Stagnation from tonic herbs."]},{"herb":"GouQiZi","dosage":"9g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Shu Di HUang, for Liver and Kidney Deficiency."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis and invigorates Blood circulation."]},{"herb":"ChaiHu","dosage":"6g","actions":["Spreads Liver Qi and relieves Stagnation Raises Yang Qi.","With Bai Shao, for Liver Blood Deficiency with Liver Qi Stagnation.","With Bai Shao, Dang Shen and Bai Zhu, fortifies Qi.","With Huang Qi, raises the Clear Yang due to abnormal descent of Qi.","With Huang Qi and Sheng Ma, for Central Qi Sinking."]},{"herb":"ShiChangPu","dosage":"6g","actions":["Promotes Blood flow, awakens the Spleen, promotes the movement of Qi and reduces swelling.","With Yu Jin, for Qi, Blood or Phlegm Stagnation."]},{"herb":"ShengMa","dosage":"3g","actions":["Raises Yang and lifts sunken Qi.","With Yu Jin, for toxins in either the upper or lower body.","With Tao Ren, raises the clear Qi, allowing turbidity to descend and moistening the Intestines.","With Chai Hu and Huang Qi, for prolapse of internal organs.",""]}],"actions":["Strengthens Qi","Raises Yang","Harmonizes and dredges the Liver","Nourishes and invigorates the Blood","Brightens the eyes"],"syndromes":["Qi and Blood Deficiency with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Decreased visual acuity","Dizziness","Fatigue","Weakness","Shortness of breath","A pale white, sallow yellow or dark, sooty facial complexion","Irritability","Depression","Taciturnity","Disinclination to move or speak","Dry, scaly skin","Brittle nails","Dry, falling hair","Itching","Age spots","Cherry hemangiomas","Spider naevi or other varicosities","Maybe constipation or","Loose stools"],"tongue":"Pale, large and darkish with possible static maculae","tongueCoat":"White","pulse":"Thready, forceless and wiry"},"conditions":[{"condition":"MacularDegeneration","name":"Macular degeneration"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}