{"formula":"YiQiYangRongTang","names":{"pinyin":"yi qi yang rong tang","hanzi":"翊气养荣汤","english":"boost the qi and nourish the constructive decoction","commonEnglish":"Boost the Qi and Nourish the Constructive Decoction","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"1-9g","actions":["Powerfully tonifies Qi.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness with anorexia, diarrhea, vomiting, abdominal distention and fatigue.","With Huang Qi, for Qi Deficiency with general debility, anorexia, and spontaneous sweat."]},{"herb":"FuLing","dosage":"9-18g","actions":["Strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Ren Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools.","With Gan Cao, for Spleen and Heart Deficiency."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm and helps prevent Stagnation from tonic herbs."]},{"herb":"ZheBeiMu","dosage":"3-12g","actions":["Clears Heat and dissipates nodules."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores, numbness, painful obstruction and paresthesias."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes the Blood, nourishes Liver and Kidney Yin, nourishes Jing and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Ren Shen, for Qi and Blood Deficiency.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia.","With Ren Shen, Bai Zhu, Dang Gui, Bai Shao and Fu Ling, for anemia with fatigue and weakness."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, softens the Liver and relieves pain.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis.","With Chai Hu, for flank pain due to Liver Qi Stagnation.","With Huang Qi and Ren Shen, restrains sweating from Deficiency."]},{"herb":"JieGeng","dosage":"3-10g","actions":["Expels pus.","With Gan Cao, for Lung abscess with expectoration of pus and pain in the chest and flanks."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi.and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen and augments Qi.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency.","With Ren She, Fu Ling, Gan Cao, Dang Gui, Bai Shao, Shu Di Huang and Chuan Xiong, for Blood Deficiency."]},{"herb":"ChaiHu","dosage":"3-12g","actions":["Spreads Liver Qi, relieves Stagnation and raises Yang Qi.","With Bai Shao, Ren Shen and Bai Zhu, fortifies Qi."]}],"actions":["Tonifies Qi and Blood"],"syndromes":["Qi and Blood Deficiency"],"manifestations":{"symptoms":["Pallor","Fatigue","Somnolence","Less severe pain in the breast","The swelling is rock hard","Difficulty erupting"],"tongue":"Pale","tongueCoat":"Thin white","pulse":"Thready and weak"},"conditions":[{"condition":"Mastitis","name":"Mastitis"},{"condition":"LiverCancer","name":"Liver cancer"},{"condition":"BreastCancer","name":"Breast cancer (post surgery) "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"breast cancer","modifications":[{"herb":"RenShen","modification":"- Rx. Ginseng"}]}]}