{"formula":"YiQiShenShiTangJiaWei","names":{"pinyin":"yi qi shen shi tang jia wei","hanzi":"翊气渗湿汤加味","english":"modified boost the qi and seep dampness decoction","commonEnglish":"Modified Boost the Qi and Seep Dampness Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, strengthens the Spleen, raises Yang Qi, tonifies the Lungs, aids the circulation of moisture downward from the face, promotes urination and reduces edema.","With Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweating.","with Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Han Fang Ji, for Wind edema with numbness, pain, swelling of the face and extremities, sweating, sensitivity to Wind and reduced urination.","With Han Fang Ji and Bai Zhu, for Wind edema with sweating, heavy sensations of the body and aversion to Wind.","With Han Fang Ji, Fu Ling and Gui Zhi, for superficial floating edema with swelling of the extremities.","With Gui Zhi, for Qi and Blood Deficiency."]},{"herb":"YiMuCao","dosage":"30g","actions":["Activates the Blood, dispels Stasis, promotes urination and reduces swelling and edema.","With Ze Lan, for disorders which include both Blood Stasis and accumulation of pathogenic water."]},{"herb":"DangShen","dosage":"9g","actions":["Restores the constitution, assists herbs that release the Exterior or drain downward when there is significant Qi Deficiency and tonifies the Lungs.","With Fu Ling, for Spleen and Stomach Deficiency with fatigue, a sensation of fullness in the abdomen, dizziness, lethargy, shortness of breath, anorexia and loose stools or diarrhea.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Gui Zhi, for Spleen Deficiency with chest distention and edema.","With Zhu ling and Ze Xie, for edema due to Internal Dampness."]},{"herb":"HanFangJi","dosage":"9g","actions":["Promotes urination, reduces edema especially in the lower body, expels Wind-Dampness and alleviates pain.","With Fu Ling and Gui Zhi, for edema in constitutionally weak patients and swelling due to Leg Qi.","With Huang Qi, Bai Zhu and Fu Ling, for Wind-Dampness invasion with Wei Qi Deficiency causing superficial edema, heaviness of the body and sweating."]},{"herb":"ZhuLing","dosage":"9g","actions":["Promotes urination and leaches out Dampness.","With Fu Ling, for Lin syndrome, scanty urine, edema, loose stools, vaginal discharge, jaundice, leg Qi and diarrhea.","With Fu Ling and Ze Xie, for edema due to Spleen Deficiency."]},{"herb":"ZeXie","dosage":"9g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Bai Zhu, for Spleen Deficiency leading to accumulation of Dampness with urinary difficulty, loose stools, diarrhea, Milky Lin or vaginal discharge.","With Fu Ling, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention.","With Fu Ling and Zhu Ling, for generalized edema."]},{"herb":"FuLing","dosage":"9g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Gui Zhi, Bai Zhu and Ze Xie, for Dampness Obstruction causing Lin Syndrome, edema, heaviness of the body and irritability.","With Bai Zhu, strengthens the Spleen and resolves Dampness."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Activates the Blood and promotes the movement of Qi.","With Gui Zhi, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves Bi pain for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis, activates Blood circulation, moistens the Intestines and unblocks the bowels."]},{"herb":"GuiZhi","dosage":"6g","actions":["Releases the Exterior, assists Yang and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Han Fang Ji, for Wind-Cold Damp Bi.","With Fu Ling, unblocks Yang and facilitates the removal of congested fluids associated with Yang Deficiency edema.","With Fu Ling, Zhu Ling, Bai Zhu and Ze Xie, for edema and dysuria due to Yang Deficiency."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Cang Zhu and Fu Ling, for a thick white tongue coat with no desire to drink."]}],"actions":["Tonifies Qi","Dispels water","Activates the Blood","Transforms Stasis"],"syndromes":["Qi Deficiency with Blood Stagnation"],"manifestations":{"symptoms":["Edema in the cheeks, face and feet which is aggravated by over exertion","Bodily form empty and debilitated","Fatigue","Weakness of the four limbs","A sallow, yellow complexion","Epigastric and abdominal distention and prolapse","Anorexia","Inhibited urination","Difficult defecation","Maybe diarrhea"],"tongue":"Swollen with stasis spots","tongueCoat":"Thin and slimy","pulse":"Wiry and choppy"},"conditions":[{"condition":"ChronicGlomerulonephritis","name":"Chronic glomerulonephritis"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"marked Blood Stasis","modifications":[{"herb":"HongHua","modification":"+ 9g Flos Carthami"},{"herb":"ZeLan","modification":"+ 9g Hb. Lycopi"}]},{"purpose":"Kidney Deficiency","modifications":[{"herb":"NiuXi","modification":"+ 12g Rx. Achyranthis Bidentatae"},{"herb":"SangJiSheng","modification":"+ 12g Hb. Taxilli"}]},{"purpose":"Yang Deficiency","modifications":[{"herb":"YinYangHuo","modification":"+ 9g Hb. Epimedii"}]},{"purpose":"Yin Deficiency","modifications":[{"herb":"ShuDiHuang","modification":"+ 12g Rx. Rehmanniae Preparata"}]}]}