{"formula":"YiSuiTang","names":{"pinyin":"yi sui tang","hanzi":"翊髓汤","english":"boost the marrow decoction","commonEnglish":"Boost the Marrow Decoction","aka":[""]},"herbs":[{"herb":"GuiBan","dosage":"9-45g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys, strengthens the bones and nourishes the Blood.","With Zhi Mu, Huang Bai and Sheng Di Huang, for afternoon fever, night sweats, and steaming bone disorder due to Yin Deficiency.","With Liu Jiao Jiao, for weakness and debility due to Kidney Deficiency."]},{"herb":"LuRong","dosage":"4-12g","actions":["Nourishes and tonifies Qi and Blood.","With Gui Ban, it is made into a glue to tonify Yin and Yang."]},{"herb":"ShengDiHuang","dosage":"5-30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"XuDuan","dosage":"6-21g","actions":["Tonifies the Liver and Kidneys, strengthens and reconnects the sinews and bones, promotes the movement of Blood, alleviates pain and generates flesh."]},{"herb":"TuSiZi","dosage":"6-18g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow and tonifies the Kidneys and Liver."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood and relieves numbness and pain.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools."]},{"herb":"GanCao","dosage":"3-14g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, moderates and harmonizes the harsh properties of other herbs and alleviates pain.","With Bai Shao, moderates spasms and alleviates pain, for painful spasms of the leg or abdomen."]},{"herb":"BuGuZhi","dosage":"3-9g","actions":["Tonifies the Kidneys, strengthens Yang and stabilizes Jing."]},{"herb":"GouJi","dosage":"4.5-15g","actions":["Tonifies the Liver and Kidneys, strengthens the sinews and bones, expels Wind-Dampness and relieves Bi syndrome.","With Dang Gui, for long term disease leading to lower extremity swelling.","With Tu Si Zi, for Kidney disorders with Wind-Damp Bi manifesting as low back and knee pain."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes the Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and stops pain due to Blood Stasis.","With Huang Qi, for many Blood Deficiency patterns.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood and astringes Yin.","With Gan Cao, regulates the relationship between the Liver and Spleen and nourishes the sinews."]},{"herb":"JiXueTeng","dosage":"9-20g","actions":["Invigorates and tonifies the Blood, invigorates the channels and relaxes the sinews."]},{"herb":"HuangBai","dosage":"3-12g","actions":["Drains Kidney Fire.","With Zhi Mu, for Yin Deficiency fever with steaming bones and night sweats.","With Sheng Di Huang and Gui Ban, for steaming bone disorder and spermatorrhea due to Yin Deficiency.","With Dang Gui and Niu Xi, for a sore and weak low back and legs."]},{"herb":"ZhiMu","dosage":"6-12g","actions":["Clears Heat, drains Fire, nourishes Yin, moistens Dryness, generates Fluids, clears Deficiency Fire and quenches thirst.","With Huang Bai, clears Heat and Drains Fire for Yin Deficiency Fire."]}],"actions":["Tonifies the Liver and Kidneys","Nourishes Yin","Tonifies Yang","Nourishes the Blood","Clears Heat","Activates the Blood","Nourishes the sinews and bones"],"syndromes":["Atrophy disorder (Wei Syndrome) due to Liver and Kidney Deficiency"],"manifestations":{"symptoms":["Weakness and soreness of the lower back and knees","Deterioration of the sinews and bones with a general reduction in function","Wasting of the muscles of the legs and feet","Difficulty walking","Dizziness","Tinnitus","Spontaneous emissions","Urinary incontinence"],"tongue":"Red","tongueCoat":"Little or None","pulse":"Thready and rapid or Thready and weak"},"conditions":[{"condition":"MyastheniaGravis","name":"Myasthenia gravis"},{"condition":"MultipleSclerosis","name":"Multiple sclerosis"},{"condition":"Neuritis","name":"Polyneuritis "},{"condition":"Gullaine-BarreSyndrome","name":"Guillain-Barre disease"},{"name":" Acute myelitis (inflammation of the spinal cord) "},{"name":"Progressive muscular dystrophy"},{"name":"The sequelae of poliomyelitis"},{"condition":"LowBackPain","name":"Lumbago"},{"condition":"Spermatorrhea","name":"Spermatorrhea"},{"condition":"UrinaryIncontinence","name":"Urinary incontinence"},{"condition":"WeiSyndrome","name":"Atrophy (Wei) Syndrome"},{"condition":"ALS","name":"Amyotrophic lateral sclerosis (ALS) "},{"condition":"Gullaine-BarreSyndrome","name":"Acute infectious multiple neuritis"},{"name":"Progressive myodystrophy "},{"name":"Progressive myodystrophia "},{"condition":"Parylysis","name":"Hysterical paralysis "},{"condition":"Parylysis","name":"Periodic paralysis"},{"condition":"FacialParalysis","name":"Facial paralysis"},{"condition":"Weakness","name":"Weakness"},{"condition":"Spermatorrhea","name":"Nocturnal emissions"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}