{"formula":"YiWuChaiGeJieJiTang","names":{"pinyin":"yi wu chai ge jie ji tang","hanzi":"医务柴葛解肌汤","english":"bupleurum and kudzu decoction to release the muscle layer","commonEnglish":"Bupleurum and Kudzu Decoction to Release the Muscle Layer","aka":[""]},"herbs":[{"herb":"ChaiHu","dosage":"6g","actions":["Disperses Wind-Heat and resolves Phlegm and congestion.","With Gan Cao, for Wind-Heat fever.","With Ge Gen, for Wind-Heat with neck and shoulder pain."]},{"herb":"GeGen","dosage":"9g","actions":["Discharges Exterior conditions, releases the muscles, especially of the neck and upper back, relieves Heat and thirst and generates fluids.","With Chai Hu, for Exterior patterns where the the chills gradually improve while the fever gradually increases along with stiffening of the neck and upper back and absence of sweating.","With Chai Hu and Huang Qin, for Wind-Heat."]},{"herb":"ChiShao","dosage":"6g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and stops bleeding.","With Chai Hu, for Heat in the Shao Yang with alternating chills and fever and nausea."]},{"herb":"ZhiMu","dosage":"6g","actions":["Clears Heat and drains Fire from the Qi Stage (Lungs Stomach).","With Zhe Bei Mu, for cough due to Lung Heat or Yin Deficiency with expectoration of thick, yellow sputum.","With Huang Qin, for cough with Excess Lung Heat."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Mu Dan Pi, for Ying and Xue Stage Heat and residual Warm pathogen which has injured the Yin.","With Mu Dan Pi and Chi Shao , for purpura or bleeding with maculae and blotches on the skin."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools, invigorates and harmonizes the Blood and dispels Blood Stasis.","With Chi Shao, cools the Blood and disperses Stasis, for Ying Stage Heat."]},{"herb":"ZheBeiMu","dosage":"6g","actions":["Clears Heat, transforms Phlegm and stops cough."]},{"herb":"GanCao","dosage":"3g","actions":["Moistens the Lungs, resolves Phlegm, stops cough, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Releases the muscle layer","Clears Heat"],"syndromes":["External Wind-Heat with Stagnant Interior Heat"],"manifestations":{"symptoms":["Fever and chills","Headache","Painful muscles","Stiffness of the muscles","Fever with no chills","Cough","Thirst"],"tongue":"Red","tongueCoat":"Yellow","pulse":"Rapid"},"conditions":[{"condition":"Influenza","name":"Influenza"},{"condition":"Cough","name":"Cough"},{"condition":"Fever","name":"Fever"},{"condition":"CommonCold","name":"Common cold "},{"condition":"Toothache","name":"Toothache"},{"condition":"Pneumonia","name":"Pneumonia"}],"contra":{"contraindications":["Contraindicated for those with simple Wind-Heat disorders without Internal Heat."],"interactions":[""]},"notes":["This condition is common in warm-febrile diseases contracted in the spring that surface in the summer.","The deeper the level of penetration of the pathogenic influence, the larger the dosage."],"modifications":[{"purpose":"incoherent speech","modifications":[{"herb":"ShiGao","modification":"+ Gypsum"}]}]}