{"formula":"YongXueRenChuangTang","names":{"pinyin":"yong xue ren chuang tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, moistens the Intestines and unblocks the bowels.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Rou Cong Rong, for constipation in the elderly with insufficiency of Yin and Blood.","With Rou Cong Rong and Huo Ma Ren, for chronic constipation due to Blood Deficiency."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes the Blood and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"JingJie","dosage":"3-10g","actions":["Releases the Exterior and expels Wind.","With Dang Gui, for Intestinal Wind with bleeding from the rectum."]},{"herb":"ZhiKe(Qiao)","dosage":"3-10g","actions":["Promotes the movement of Qi, reduces distention and pressure, resolves hardenings and removes stagnated food."]},{"herb":"HuoMaRen","dosage":"9-15g","actions":["Nourishes, moistens and lubricates the Intestine and nourishes Yin.","With Dang Gui and Shu Di Huang, for constipation due to lack of fluids and Blood Deficiency, especially in the elderly and postpartum.","With Zi Su Zi, for constipation in the elderly, especially if accompanied by coughing and wheezing.",""]},{"herb":"XingRen","dosage":"3-10g","actions":["Stops coughing, calms wheezing, moistens the Intestines and unblocks the bowels.","With Zi Su Zi, for coughing and wheezing with constipation.","With Huo Ma Ren and Dang Gui, for constipation due to Deficient Qi and dry Intestines."]},{"herb":"RouCongRong","dosage":"6-21g","actions":["Tonifies the Kidneys, strengthens Yang,","benefits Jing and marrow, warms the Womb, moistens the Intestines and facilitates the passage of stool."]},{"herb":"ZiSuZi","dosage":"3-10g","actions":["Stops coughing, calms wheezing, descends Qi, dissolves Phlegm, moistens the Intestines and unblocks the stool.","With Huo Ma Ren, moistens the Intestines and unblocks the bowels."]},{"herb":"ChenPi","dosage":"3-6g","actions":["Regulates Qi, expands the chest, dries Dampness, transforms Phlegm and reduces Food Stagnation."]},{"herb":"EJiao","dosage":"3-16g","actions":["Nourishes the Blood, stops bleeding, nourishes and moistens Yin and moistens the Lungs and Large Intestine."]}],"actions":["Strengthens Blood and Yin","Moistens the Intestines"],"syndromes":["Blood and Yin Deficiency"],"manifestations":{"symptoms":["A history of constipation","Usually an older person","Tenesmus","Eliminates every one to two weeks","Dry mouth","Dizziness","Palpitations","Pale lips and nails","Maybe coughing"],"tongue":"Pale or Red","tongueCoat":"Thin and white or Little or None","pulse":"Thready and rapid or Forceless"},"conditions":[{"condition":"Constipation","name":"Constipation"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}