{"formula":"YueJuBaoHeWan","names":{"pinyin":"yue ju bao he wan","hanzi":"越鞠保和丸","english":"escape restraint and preserve harmony pill","commonEnglish":"Escape Restraint and Preserve Harmony Pill","aka":["&#xA0;"]},"herbs":[{"herb":"ShanZha","dosage":"9g","actions":["Reduces all types of Food Stagnation especially meat and fatty foods.","With Shen Qu, for general indigestion and Food Stagnation.","With Lai Fu Zi and Shen Qu, reduces stagnation and accumulation caused by overindulgence in food and drink of all types.","With Mai Ya and Shen Qu, for abdominal distention, belching, diarrhea and anorexia due to Food Stagnation and childhood nutritional impairment due to improper breast feeding."]},{"herb":"ShenQu","dosage":"6g","actions":["Reduces Food Stagnation, promotes digestion, reduces stagnant alcohol, moves Qi and harmonizes the Stomach ."]},{"herb":"LaiFuZi","dosage":"6g","actions":["Descends Qi and reduces accumulation of Phlegm from stagnant grains.","With Shan Zha, Shen Qu and Chen Pi, for abdominal distention, borborygmus, belching and acid regurgitation due to stagnation in the Stomach or Intestines.","With Zhi Ban Xia, for distention and vomiting due to Food Stagnation."]},{"herb":"ChenPi","dosage":"6g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Zhi Ban Xia, moves Qi and transforms stagnation to harmonize the Stomach and stop nausea and vomiting."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Descends Qi, transforms Phlegm, harmonizes the Stomach and reduces distention.","With Chen Pi, for Stomach Qi Disharmony with epigastric and abdominal distention or pain.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools, treats Phlegm, Thin Mucus and turbid Dampness and prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia."]},{"herb":"FuLing","dosage":"9g","actions":["Strengthens the Spleen, drains Dampness, harmonizes the Middle Jiao and transforms Phlegm.","With Zhi Ban Xia, expels Phlegm and stops nausea and vomiting.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention, and anorexia due to congested fluids."]},{"herb":"XiangFu","dosage":"9g","actions":["Spreads and regulates Liver Qi.","With Cang Zhu, for indigestion, pain and distention in the flanks and abdomen, nausea, vomiting, and acid regurgitation."]},{"herb":"LianQiao","dosage":"9g","actions":["Clears Heat due to Stagnation."]},{"herb":"CangZhu","dosage":"6g","actions":["Strongly dries Dampness and tonifies the Spleen.","With Xiang Fu, for chest, epigastric and abdominal pain, distention and discomfort due to Dampness and Qi Obstruction."]},{"herb":"ZhiZi","dosage":"6g","actions":["Clears Heat, reduces Fire, eliminates irritability, and resolves Dampness.","With Chuan Xiong, Xiang Fu and Shen Qu, for depression with irritability."]},{"herb":"XiangFu","dosage":"3g","actions":["Spreads and regulates Liver Qi.","With Cang Zhu, for indigestion, pain and distention in the flanks and abdomen, nausea, vomiting, and acid regurgitation."]}],"actions":["Disperses Food","Harmonizes the Stomach","Releases all types of Stagnation (Qi, Blood, Phlegm, Fire, Food and Dampness)"],"syndromes":["Food Stagnation in the Stomach"],"manifestations":{"symptoms":["Distention and fullness in the chest and epigastrium","Abdominal distention with occasional pain","Rotten smelling belching","Acid regurgitation","Nausea and vomiting","Aversion to food","Maybe diarrhea","A stifling sensation in the chest and abdomen","Fixed pain in the hypochondria","Belching with a fetid odor","Dysentery","Maybe constipation","Anorexia","Bad breath","Intermittent fever","Acid reflux","Mild coughing with copious sputum","Indigestion"],"tongue":"Normal","tongueCoat":"Thin and white or Greasy or Slippery or Yellow and greasy","pulse":"Wiry and taut or Running or Slippery"},"conditions":[{"condition":"Ulcer","name":"Peptic ulcer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}