{"formula":"YuQingWan","names":{"pinyin":"yu qing wan","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ChenPi","dosage":"","actions":["Regulates and descends Qi, adjusts the Middle, relieves the diaphragm, dries Dampness and transforms Phlegm.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ShanZhuYu","dosage":"6-12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin, strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Dang Gui and Shu Di Huang, for Night sweats due to Yin Deficiency.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Xiang Fu and Dang Gui, for dysmenorrhea from Qi Stagnation and Blood Stasis.","with Chuan Xiong, for body aches and headaches due to Blood Stagnation."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Sha Ren, for Blood loss with Spleen Deficiency."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Yan Hu Suo, teats everything from Liver Qi Stagnation to Deep Blood Stasis with pain anywhere in the body including stabbing chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorder in the lower body and dysmenorrhea."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Xiang Fu and Yan Hu Suo, for dysmenorrhea.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Xiang Fu, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation."]},{"herb":"HuangQin","dosage":"3-18g","actions":["Clears Heat, dries Dampness, cools the Blood, stops bleeding and calms the fetus.","With Bai Zhu and Dang Gui, for a restless fetus due to Heat.","With Bai Zhu, for a restless fetus due to Blood Heat.",""]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen, augments Qi, dries Dampness, promotes water metabolism and calms the fetus."]},{"herb":"FuPenZi","dosage":"2-12g","actions":["Tonifies and stabilizes the Kidneys and astringes Jing and urine."]},{"herb":"ShaRen","dosage":"1.5-7g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, calms the fetus and prevents miscarriage.","With Sha Ren, for a restless fetus due to Heat.","With Chen Pi, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Xiang Fu, for Qi Stagnation combined with Blood Stasis.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]}],"actions":["Tonifies the Kidneys","Transforms Phlegm","Rectifies Qi","Regulates menstruation"],"syndromes":["Kidney Yin Deficiency with Phlegm-Dampness and Qi Stagnation"],"manifestations":{"symptoms":["Long-term infertility","Early menstruation","Possibly a history of late menarche","Irregular periods","Infrequent menstruation","Decreased menses with light colored Blood and no blood clots","Period either scanty or heavy","Prolonged menstrual cycle","Amenorrhea","Loss of libido","Emaciation","Dizziness","Night sweating","Blurred vision","Palpitations","Insomnia","Tinnitus","Hearing loss","A weak lower body","Five sole Heat or","Low-grade fever in the afternoon","Back soreness","Aches and weakness in the waist and legs","Dry mouth","Dry bowl movements","Dry vagina","Cold limbs","A dusky complexion","Dull-pale complexion","Anorexia","Edema","Abdominal distention","Chest and hypochondriac distention","Nausea","Vomiting","Vertigo","Thirst with no desire to drink","Maybe no thirst","Palpitations","Shortness of breath","Distention and pain in the sides or flanks","Suffocating sensation in the chest","Tendency to sigh","Melancholy","Depression","Irritability","Inappropriate anger","Irregular menses","Dysmenorrhea","Breast distention and pain before and during menses"],"tongue":"Red","tongueCoat":"Little or None or Thin and white or Thick and slippery","pulse":"Thready and rapid or Floating and Empty or Wiry or Slippery, full and maybe wiry"},"conditions":[{"condition":"conditions/Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}