{"formula":"YuYInBuXueTang","names":{"pinyin":"yu yin bu xue tang","hanzi":"瘉阴補血湯","english":"heal yin and tonify the blood decoction","commonEnglish":"Heal Yin and Tonify the Blood Decoction","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes the Blood, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Shan Zhu Yu, nourishes Kidney Yin and secures Jing, while restraining urination and sweating.","With Shan Zhu Yu and Shan Yao, for dizziness, weak and sore low back, impotence, spermatorrhea and night sweats, due to Kidney and Liver Yin Deficiency.","With Gui Ban, for dizziness, insomnia, tinnitus, forgetfulness, afternoon fevers and night sweats due Yin Deficiency with Yang Rising."]},{"herb":"ShanYao","dosage":"9-30g","actions":["Tonifies the Spleen, tonifies Kidney Yin and astringes Jing."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Bai Shao, nourishes, regulates and harmonizes Qi and Blood.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation and astringes Yin.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis.","With Zhi Gan Cao, for epigastric, hypochondriac or flank pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"GouQiZi","dosage":"5-18g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Shu Di Huang, Shan Yao, Shan Zhu Yu an Gui Ban, for severe Yin Deficiency with lower back pain, spermatorrhea, sweating and diminished visual and aural acuity."]},{"herb":"ShanZhuYu","dosage":"6-12g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin, strengthens Kidney Yang, stabilizes the menses and stops bleeding.","With Dang Gui and Shu Di HUang, for night sweats due to Yin Deficiency.","With Shu Di Huang and Shan Yao, a basic combination to tonify the Kidneys."]},{"herb":"MuDanPi","dosage":"6-12g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis and clears Liver Fire."]},{"herb":"GuiBan","dosage":"9-45g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys, nourishes the Blood, enriches Yin, stabilizes the Chong and Ren channels, cools the Blood and stops uterine bleeding.","With Bie Jia, calms the Liver, subdues Yang and extinguishes Wind to treat vertigo and tinnitus associated with Yin Deficiency with Yang Rising and deficient Wind moving internally and steaming bones and night sweats due to Liver and Kidney Yin Deficiencies with Heat Rising."]},{"herb":"BieJia","dosage":"9-30g","actions":["Nourishes Yin, anchors Yang, invigorates the Blood and promotes menstruation."]},{"herb":"GanCao","dosage":"3-6g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Nourishes the Blood","Nourishes Jing","Strengthens the Liver and the Kidneys"],"syndromes":["Blood and Yin Deficiency"],"manifestations":{"symptoms":["Infertility","Delayed cycle","Scanty periods","Pale Blood","Maybe copious, watery menses","Maybe amenorrhea","Insidious pain after menstruation","Tiredness","Withered, sallow complexion","Depression","Dizziness","Palpitations","Five-Sole-Heat","Breathlessness","Pale complexion","Blurred vision","Insomnia","Poor memory","Dry skin","Constipation","A thin, weak body"],"tongue":"Pale and thin","tongueCoat":"Little or Thin and white","pulse":"Choppy or Fine or Thin and soft"},"conditions":[{"condition":"conditions/Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}