{"formula":"ZaiZaoSan","names":{"pinyin":"zai zao san","hanzi":"再造散","english":"renewal powder","commonEnglish":"Renewal Powder","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"6g","actions":["Tonifies Qi and Blood, Strengthens the Spleen, raises the Yang Qi of the Spleen and Stomach, tonifies Wei Qi, stabilizes the Exterior, tonifies the Lungs, promotes the discharge of pus, generates flesh, expels toxins and relieves numbness and pain.","With Gui Zhi, for Qi and Blood Deficiency and Ying and Wei Deficiency with numbness and painful obstruction of the musculature.","With Gui Zhi, Bai Shao, Sheng Jiang and Da Zao, for skin and muscle numbness and pain due to Qi and Blood Deficiency."]},{"herb":"RenShen","dosage":"3g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions.","With Huang Qi, for Qi Deficiency with general debility, anorexia, and spontaneous sweat."]},{"herb":"ZhiFuZi","dosage":"3g","actions":["Warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Ren Shen, for severe Deficiency of the Source Qi and Collapse of Yang with Cold extremities, sweating, weak breathing, dizziness, and an extremely pale complexion.","With Huang Qi, for spontaneous sweat and chills due to Yang Deficiency.","With Xi Xin, disperses Cold and stops pain for Cold damage both Internal and External with aversion to Cold, headache and generalized body aches with aching joints and Wind-Damp-Cold Bi with spasms of the joints and intolerable pain.","With Chuan Xiong and Fang Feng, for Bi syndrome."]},{"herb":"GuiZhi","dosage":"3g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Bai Shao, for External Wind-Cold with disharmony between the Ying and Wei, with spontaneous sweating, fever and chills.","With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi.","With Chuan Xiong, expels Wind-Dampness, warms the channels and collaterals, facilitates joint movement and relieves the discomfort of painful obstruction."]},{"herb":"XiXin","dosage":"3g","actions":["Disperses Wind-Cold and Internal Cold,Warms the Lungs, transforms Phlegm and Thin Mucus, disperses and unblocks the Qi of the nasal orifices and alleviates pain.","With Chuan Xiong, for Wind-Cold headache, toothache, Bi pain, Shao Yin Cold headache and swelling and pain from sores, boils and trauma.","With Qiang Huo, Fang Feng and Chuan Xiong, for Wind-Cold.","With Qiang Huo, Fang Feng and Gui Zhi, for Wind-Cold-Damp Bi pain."]},{"herb":"QiangHuo","dosage":"3g","actions":["Releases the Exterior, disperses Cold, expels Wind-Cold-Dampness, unblocks painful obstruction, alleviates pain and guides Qi to the Tai Yang and Du channels.","With Chuan Xiong, for headache and generalized body aches and pains associated with the common cold or painful obstruction.","With Fang Feng, for pain due to External Wind-Dampness."]},{"herb":"ChuanXiong","dosage":"3g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain.","With Xi Xin and Fang Feng, for Wind-Cold headaches."]},{"herb":"FangFeng","dosage":"3g","actions":["Releases the Exterior, expels External Wind, expels Wind-Dampness and alleviates pain."]},{"herb":"BaiShao","dosage":"3g","actions":["Moderate the Spleen, relaxes the Liver and alleviates pain."]},{"herb":"GanCao","dosage":"1.5g","actions":["Tonifies the Spleen, augments Qi and moderates and harmonizes the harsh properties of other herbs."]},{"herb":"ShengJiang","dosage":"3g","actions":["Has strong warming and descending actions and is appropriate for harmonizing the Middle and stopping nausea. It is used for Spleen Yang Deficiency Cold with abdominal pain and nausea."]},{"herb":"DaZao","dosage":"4g","actions":["Tonifies the Spleen and Stomach, augments Qi and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Tonifies Yang","Augments Qi","Releases the Exterior","Induces sweating"],"syndromes":["External Wind-Cold Invasion with underlying Qi and Yang Deficiency"],"manifestations":{"symptoms":["Slight fever","Strong chills","Anhidrosis","Headache","Cold extremities","Fatigue with a constant desire to lie down","Drowsiness","Pale face","Lassitude","Low voice","Weak voice"],"tongue":"Pale","tongueCoat":"White","pulse":"Floating, big and forceless or Deep and forceless"},"conditions":[{"condition":"CommonCold","name":"Common cold in the elderly "},{"condition":"Influenza","name":"Influenza"},{"condition":"Arthralgia","name":"Arthralgia"},{"condition":"RheumatoidArthritis","name":"Rheumatoid arthritis "},{"name":"Upper respiratory infection "},{"condition":"Cellulitis","name":"Acute cellulitis"},{"condition":"Fever","name":"Fever"},{"condition":"RheumaticFever","name":"Rheumatic fever"},{"name":"Mumps"},{"name":"Early-stage of a pyogenic infection of the skin "},{"name":"Carbuncle"},{"condition":"Furuncles","name":"Furuncle"},{"condition":"Headache","name":"Headache"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"less pronounced Wind-Cold","modifications":[{"herb":"FangFeng","modification":"- Rx. Saposhnikoviae"},{"herb":"QiangHuo","modification":"- Rz. et Rx. Notopterygii"},{"herb":"JingJie","modification":"+ Hb. Schizonepetae"},{"herb":"CongBai","modification":"+ Bul. Allii Fistulosi"},{"herb":"DanDouChi","modification":"+ Sm. Sojae Preparatum"}]},{"purpose":"joint pain and muscle aches","modifications":[{"herb":"DuHuo","modification":"+ Rx. Angelicae Pubescentis"},{"herb":"WeiLingXian","modification":"+ Rx. Clematidis"},{"herb":"SangJiSheng","modification":"+ Hb. Taxilli"}]},{"purpose":"nasal obstruction, runny nose and a cough with white sputum","modifications":[{"herb":"QianHu","modification":"+ Rx. Peucedani"},{"herb":"JieGeng","modification":"+ Rx. Platycodi"},{"herb":"ZhiKe(Qiao)","modification":"+ Fr. Aurantii"},{"herb":"ZiSuYe","modification":"+ Fol. Perillae"},{"herb":"BaiQian","modification":"+ Rz. Cynanchi Stauntonii"}]}]}