{"formula":"ZedoariaAndDangGuiCombination","names":{"pinyin":"zedoaria and dang gui combination","commonEnglish":"","aka":[""]},"herbs":[{"herb":"EZhu","dosage":"3-10g","actions":["Invigorates Blood circulation, dispels Blood Stasis, regulates Qi, dissolves accumulations and alleviates pain.","With Mu Xiang, for abdominal distention, fullness, and pain."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus and stops pain due to Blood Stasis."]},{"herb":"ChiShao","dosage":"5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling from sores and abscesses and relieves pain.","With Tao Ren, for Blood Stasis induced menstrual disorders."]},{"herb":"BingLang","dosage":"6-15g","actions":["Regulates Qi, reduces accumulations, drains downward and unblocks the bowels."]},{"herb":"KunBu","dosage":"3-15g","actions":["Resolves Phlegm and softens areas of hardness."]},{"herb":"MuXiang","dosage":"3-10g","actions":["Promotes the movement of Q,i adjusts and regulates stagnant Qi in the Intestines and alleviates pain.","With Bing Lang, for&#xA0;Qi Stagnation in the Stomach and Intestines.","With Bing Lang and Da Huang, for epigastric and abdominal fullness, distention, and pain."]},{"herb":"GuiZhi","dosage":"3-10g","actions":["Warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Da Huang, removes Stasis and unblocks the flow of Qi for Blood Stasis."]},{"herb":"TaoRen","dosage":"4-10g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and Drains abscesses.","With Da Huang and Gui Zhi, for Blood Stasis and Heat in the Lower Jiao."]},{"herb":"GuiBan","dosage":"9-45g","actions":["Nourishes and cools the Blood, enriches Yin, stabilizes the Chong and Ren channels and stops uterine bleeding."]},{"herb":"DaHuang","dosage":"3-15g","actions":["Invigorates the Blood and dispels Blood Stasis.","With Dang Gui, for Blood Stasis.","With Chi Shao, for chronic accumulation in the abdomen, blockage of urine, constipation, Qi rushing upward to the Heart, abdominal distention and rebellious damage from food and drink."]},{"herb":"HuPo","dosage":"1.5-3g","actions":["Invigorates the Blood, dissipates Stasis and unblocks the menses."]}],"actions":["Activates the Blood"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Hard enlarged masses","Fixed pain","A dark gray complexion","Emaciation","Lassitude","Anorexia","Fever (or feverish feeling)","Aversion to Cold","Amenorrhea"],"tongue":"Purple","pulse":"Choppy or Taut and smooth"},"conditions":[{"condition":"UterineMyoma","name":"Uterine fibroids"},{"condition":"Amenorrhea","name":"Amenorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}