{"formula":"ZhengAiWan","names":{"pinyin":"zheng ai wan","hanzi":"正癌囊","english":"pills for treating cancer","commonEnglish":"Pills for Treating Cancer","aka":[""]},"herbs":[{"herb":"RuXiang","dosage":"150g","actions":["Invigorates the Blood, promotes the movement of Qi, relaxes the sinews, activates the channels, alleviates pain, reduces swelling and generates flesh."]},{"herb":"MoYao","dosage":"150g","actions":["Invigorates the Blood, dispels Blood Stasis, alleviates pain, reduces swelling, generates flesh and promotes healing.","With Ru Xiang, disseminates and unblocks the organs and dredges the channels and collaterals to treat epigastric, flank, abdominal and joint pain, abdominal pain during menstruation and irregular menstruation and swollen, painful sores and sores that are hard but not painful."]},{"herb":"DaHuang","dosage":"60g","actions":["Drains Heat, purges accumulations, invigorates the Blood, dispels Blood Stasis, clears Heat, reduces Fire toxicity and inhibits the growth of cancer cells."]},{"herb":"ZiShiYing","dosage":"150g","actions":["Warms the Womb and warms and unblocks the Chong and Ren channels."]},{"herb":"ShuYangQuan","dosage":"150g","actions":["Dispels Heat and Dampness, removes toxins, regulates the circulation of Qi, invigorates the Blood, dispels Phlegm and inhibits the growth of cancer cells."]},{"herb":"MingFan","dosage":"60g","actions":["Relieves toxicity, purges Fire, dries Dampness, stops bleeding and inhibits the growth of cancer cells."]},{"herb":"Individualherbsupdate/BaiYaoZi","dosage":"180g","actions":["Clears Heat, removes toxicity, alleviates pain, cools the Blood and stops bleeding."]},{"herb":"ZiCao","dosage":"500g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins, clears Damp-Heat from the skin and inhibits the growth of cancer cells."]},{"herb":"XianHeCao","dosage":"500g","actions":["Astringes leakage of Blood, stops bleeding, reduces swelling, eliminates pus and inhibits the growth of cancer cells."]},{"herb":"XiongHuang","dosage":"90g","actions":["Relieves toxicity, dries Dampness, expels Phlegm and inhibits the growth of cancer cells."]},{"herb":"CaoDouKou","dosage":"150g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen."]},{"herb":"MuXiang","dosage":"60g","actions":["Promotes the movement of Qi, alleviates pain, dispels Damp-Heat and harmonizes the Liver and Spleen.","With Bai Shao, for diarrhea with profuse pus and Blood."]},{"herb":"GanQi","dosage":"15g","actions":["Breaks up Blood Stasis, opens the channels and purges hardness."]},{"herb":"SangBaiPi","dosage":"90g","actions":["Drains Heat from the Lungs, promotes urination, reduces edema and inhibits the growth of cancer cells.","With Huang Qin, drains Heat from the Lungs and stops coughing and wheezing."]},{"herb":"BaiShao","dosage":"400g","actions":["Nourishes the Blood, regulates menstruation, astringes Yin, softens the Liver and relieves pain."]},{"herb":"HuangQin","dosage":"30g","actions":["Clears and eliminates Damp-Heat, drains Fire, detoxifies and inhibits the growth of cancer cells."]}],"actions":["Clears Damp-Heat","Relieves toxicity","Invigorates the Blood","Breaks up Stasis","Moves Qi","Inhibits the growth of cancer cells"],"syndromes":["Toxic Damp-Heat with Qi and Blood Stagnation"],"manifestations":{"symptoms":["Tumor develops quickly","Long-standing illness","Pain","Redness","Ulceration","Discharge of yellow or bloody, foul-smelling fluid","Fatigue","Fever","Anxiety","Dry mouth","Thirst","Dark urine","Bitter taste","Red eyes","Insomnia","Pain that is fixed, stabbing and /or severe","Pain is worse with pressure","Dark complexion","Fixed, palpable masses","Bleeding with clots","Purple lips","Purple nails","Dry skin","Blue, dark or purplish discoloration of skin in small or large areas,","Varicose and spider veins","Cold hands and feet","Tendency to hemorrhage dark blood or clots","Lethargy","Anorexia","Maybe jaundice","No thirst or","Thirst with no desire to drink","Nausea","Vomiting","Afternoon fever","Body aches","A sallow complexion","Scanty urination","Constipation or","Bloody diarrhea or","Dysentery","Chest discomfort","Epigastric pain and distention","Dull appearance","Maybe disorientation","Loose stools","Maybe skin vesicles","Heavy extremities","Lower Jiao pain","Heaviness","Headache","Dull Spirit","Abdominal distention","Mental fuzziness"],"tongue":"Normal or Red or Purple, possible purple or red spots","tongueCoat":"Yellowish white and greasy or Thick, sticky, dry and yellow","pulse":"Soft or Soft and rapid or maybe Slippery and rapid or Wiry or Rolling and rapid or Wiry, overflowing and rapid or Choppy or Wiry and choppy"},"conditions":[{"condition":"CervicalCancer","name":"Cervical cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}