{"formula":"ZhiBaiSiWuTang","names":{"pinyin":"zhi bai si wu tang","hanzi":"知柏四物汤","english":"four substances decoction with anemarrhena and phellodendron","commonEnglish":"Four Substances Decoction with Anemarrhena and Phellodendron","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"12g","actions":["Nourishes and invigorates the Blood, regulates Liver and Kidneys, regulates menses and alleviates pain.","With Shu Di Huang for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Shu Di Huang, Bai Shao and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"6g","actions":["Invigorates Blood, moves Qi, releases Stagnation and alleviates pain.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"BaiShao","dosage":"15g","actions":["Nourishes Blood, preserves Yin, calms Liver Yang and alleviates pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Blood Stasis."]},{"herb":"ShuDiHuang","dosage":"15g","actions":["Nourishes Yin and Blood and tonifies the Kidneys.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Huang Bai and Zhi Mu, for Yin Deficiency with Empty Fire.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia."]},{"herb":"ZhiMu","dosage":"10g","actions":["Clears Heat, drains Fire, enriches Yin, moistens Dryness and generates Fluids.","With Huang Bai, for Yin Deficiency with Fire Flaring, Steaming Bone Disorder and Lower Jiao Damp-Heat.","with Huang Bai and Shu Di Huang, for Yin Deficiency with Empty Fire."]},{"herb":"HuangBai","dosage":"10g","actions":["Drains Damp-Heat, drains Kidney Fire, relieves toxicity and inhibits the growth of cancer cells."]},{"herb":"TianHuaFen","dosage":"10g","actions":["Drains Heat, generates Fluids, relieves toxicity, expels pus and reduces swelling and inhibits the growth of cancer cells."]},{"herb":"GanCao","dosage":"3g","actions":["Moderates and harmonizes the harsh properties of other herbs, inhibits the growth of cancer cells and guides the herbs to all twelve channels."]}],"actions":["Nourishes the Blood and Yin","Clears Heat","Relieves toxicity","Inhibits the growth of cancer cells"],"syndromes":["Blood Deficiency with Damp-Heat"],"manifestations":{"symptoms":["Restlessness","Fever or tidal fever","Red eyes","Dry mouth and throat","Palpitations","Lower abdominal pain","Difficult urination","Painful urination","Increased menstrual flow","Uterine bleeding","Early menstruation","Aching in limbs","Dizziness","Mental instability","Red face","Thirst","Turbid urine","Red cheeks","Wheezing","Nervousness","Headache","Red eyes","Dry mouth","Anorexia","Infertility","Abdominal pain","Spontaneous sweating or night sweats with fever","Anxiety","Dry eyes","Hypochondriac pain","Somnolence","Insomnia","Aching shoulders","Five Sole Heat","Premenstrual tension","Hot flashes","Fatigue","Lassitude","Depression","Constipation with flushing up","Pale complexion","Bitter taste in mouth","Abdominal distention near the umbilicus","Epistaxis","Irregular menstruation","Heaviness in the lower abdomen"],"tongue":"Red or Red edges","tongueCoat":"Thin and yellow","pulse":"Thready and rapid"},"conditions":[{"condition":"ColonCancer","name":"Colon cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}