{"formula":"ZhiFuTang","names":{"pinyin":"zhi fu tang","hanzi":"制附汤","english":"prepared aconite decoction","commonEnglish":"Prepared Aconite Decoction","aka":[""]},"herbs":[{"herb":"ZhiFuZi","dosage":"4.5-9g","actions":["Restores Devastated Yang, rescues from rebellion, warms Ming Men Fire, assists Heart, Kidney and Spleen Yang, disperses Cold and Dampness, warms the channels and stops pain.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang and disperses Cold.","With Gan Jiang and Zhi Gan Cao, strengthens its actions of fortifying Qi and benefiting the Yang for Cold extremities and diarrhea with undigested food due to Collapse of the Spleen and Kidney Yang.","With Bai Zhu, for Spleen Yang Deficiency with a cold, painful abdomen, vomiting and watery diarrhea.","With Bai Zhu and Gan Jiang, for Internal ascendancy of Yin Cold leading to lack of arousal of Spleen Yang with abdominal pain, Cold, and watery diarrhea.","With Rou Gui, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees and Deficiency of Ming Men Fire with impotence or infertility."]},{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao, augments Qi, nourishes the Blood and promotes the generation of Body Fluids.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"GanJiang","dosage":"3-4.5g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao, rescues Devastated Yang and expels Interior Cold.","With Bai Zhu, for diarrhea due to Spleen Deficiency.","With Zhi Fu Zi, for Devastated Yang."]},{"herb":"CangZhu","dosage":"9g","actions":["Strongly dries Dampness, tonifies the Spleen, induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Dang Shen and Gan Jiang, for Deficiency Cold of the Middle Jiao with abdominal pain, distention, vomiting and diarrhea.","With Cang Zhu, for Damp Cold Painful Obstruction.","With Gan Jiang, eliminates Cold Dampness in the Spleen with loss of taste, a sticky sensation in the mouth, nausea, vomiting, diarrhea and a thick, white tongue coat."]},{"herb":"RouGui","dosage":"1.5-3g","actions":["Warms the Kidneys, Spleen and Heart, strengthens Yang and Ming Men Fire, disperses deep Cold, warms the channels, unblocks the channels and vessels and alleviates pain."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"GanCao","dosage":"3-9g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency."]}],"actions":["Harmonizes the Ying","Dispels Cold"],"syndromes":["Jing and Yang (Constitutional) Deficiency"],"manifestations":{"symptoms":["Purple lesions","Swelling of the fingers and toes","A sensation of coldness of the skin","Aversion to Cold","Cold limbs","Abdominal pain","Unformed stools"],"tongue":"Pink or Pale","tongueCoat":"Thin and white","pulse":"Soft"},"conditions":[{"condition":"Erythema","name":"Erythema multiforme"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}