{"formula":"ZhiGanCaoTangJiaJian","names":{"pinyin":"zhi gan cao tang jia jian","hanzi":"炙甘草湯加减","english":"modified prepared licorice decoction","commonEnglish":"Modified Prepared Licorice Decoction","aka":[""]},"herbs":[{"herb":"HuangQi","dosage":"30g","actions":["Tonifies Qi and Blood, promotes the discharge of pus, generates flesh and expels toxins.","With Zhi Fu Zi, for Yang Deficiency with spontaneous sweat.","With Dang Gui, for Qi and Blood Deficiency with chronic non-healing sores."]},{"herb":"ShengDiHuang","dosage":"20g","actions":["Clears Heat, cools Heart Fire and nourishes Blood and Heart Yin.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"GanCao","dosage":"15g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm and nourishes the Heart.","With Dang shen and Gui Zhi, for palpitations due to Heart Qi Deficiency."]},{"herb":"ZhiFuZi","dosage":"9g","actions":["Warms Ming Men Fire, disperses Cold and Dampness and assists Heart, Kidney and Spleen Yang."]},{"herb":"DangShen","dosage":"9g","actions":["Tonifies the Middle Jiao and augments Qi.","With Zhi Gan Cao, for anorexia, fatigue and loose stools due to Spleen Deficiency and palpitations due to Heart Qi Deficiency.","With HUang Qi, for Lung and Spleen Qi Deficiency with fatigue, shortness of breath, diarrhea and anorexia.","With Wu Wei Zi and Mai Men Dong, for injury to Qi and fluids with shortness of breath and thirst."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, stops pain due to Blood Stasis, reduces swelling, expels pus, generates flesh and alleviates pain.","With Huang Qi, for ulcerated abscesses with insufficient drainage or which drain a clear thin discharge.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat."]},{"herb":"ChuanXiong","dosage":"9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Sheng Di Huang, Bai Shao and Dang Gui, for headache due to Blood Deficiency.","With Gui Zhi, for joint and limb pain due to External Wind-Cold invasion."]},{"herb":"GuiZhi","dosage":"9g","actions":["Assists the Heart Yang, unblocks Yang, transforms Qi and thin mucus and warms and facilitates the flow of Yang Qi in the chest.","With Zhi Gan Cao, for palpitations and shortness of breath due to injured Yang of the chest.","With Bai Shao, warms and tonifies the Middle Jiao.","With Zhi Fu Zi, for chills and painful extremities due to Yang Deficiency with Wind-Cold-Damp Bi."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, astringes Yin, softens the Liver and calms Liver Yang and Liver Wind.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"MaiMenDong","dosage":"9g","actions":["Moistens Stomach and Lung Dryness, moistens the Intestines clears the Heart and eliminates irritability.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"WuWeiZi","dosage":"9g","actions":["Tonifies the Kidneys, astringes Jing, tonifies Qi, quiets the Spirit and calms and contains Heart Qi.","With Huang Qi, for Yang Deficiency with spontaneous sweat."]}],"actions":["Tonifies the Heart and Kidneys","Warms Yang"],"syndromes":["Heart and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Cardiac effusion","Heart palpitations","An empty sensation in the Heart","Shortness of breath","Maybe chest oppression or pain","Aversion to Cold","Cold extremities","A pale and puffy face","Apathy","Mental slowness","Fatigue","Dizziness","Tinnitus","Weak limbs","Hypersomnia"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Deep, slow and weak or Tight or Regularly intermittent"},"conditions":[{"condition":"Hashimoto'sThyroiditis","name":"Hashimoto's thyroiditis "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"a weak, deep and slow pulse","modifications":[{"herb":"MaHuang","modification":"+ 6g Hb. Ephedrae"},{"herb":"XiXin","modification":"+ 6g Hb Asari"}]},{"purpose":"a faint, tight or regularly intermittent pulse","modifications":[{"herb":"DangShen","modification":"- Rx. Codonopsis"},{"herb":"RenShen","modification":"+ 6g Rx. Ginseng"},{"herb":"ZhiShi","modification":"+ 6g Fr. Aurantii Immaturus"},{"herb":"GuaLouPi","modification":"+ 24g Per. Trichosanthis"}]},{"purpose":"chest oppression and pain","modifications":[{"herb":"XieBai","modification":"+ 9g Bul. Allii"},{"herb":"YanHuSuo","modification":"+ 9g Rz. Corydalis"},{"herb":"DanShen","modification":"+ 9g Rx. Salviae Miltiorrhizae"}]}]}