{"formula":"ZhiHouFang","names":{"pinyin":"zhi hou fang","hanzi":"治瘊方","english":"recipe for verruca vulgaris","commonEnglish":"Recipe for Verruca Vulgaris","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin."]},{"herb":"HeShouWu","dosage":"12g","actions":["Tonifies the Liver and Kidneys, nourishes the Blood and Jing and expels Wind from the skin by nourishing the Blood."]},{"herb":"DuZhong","dosage":"12g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, and aids the smooth flow of Qi and Blood."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, softens the Liver and relieves pain."]},{"herb":"ChiShao","dosage":"12g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, cools the Blood, reduces swelling from sores and abscesses and relieves pain","With Tao Ren, for Blood Stasis.","With Mu Dan Pi, cools the Blood and disperses Stasis."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channel and alleviates pain.","With Tao Ren, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"ChuanShanJia","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, reduces swelling and promotes the discharge of pus."]},{"herb":"ChiXiaoDou","dosage":"9g","actions":["Promotes urination, disperses Blood Stasis, reduces swelling, dispels pus and reduces Fire toxicity."]},{"herb":"BaiZhu","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"NiuXi","dosage":"9g","actions":["Invigorates the Blood, expels Blood Stasis and nourishes the Liver and Kidney Yin."]}],"actions":["Nourishes the Blood","Invigorates the Blood","Dispels Blood Stasis"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Warts",""]},"conditions":[{"condition":"Warts","name":"Warts"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}