{"formula":"ZhiPoLiuJunZiTang","names":{"pinyin":"zhi po liu jun zi tang","hanzi":"枳朴六君子湯","english":"immature bitter orange and magnolia bark decoction","commonEnglish":"Immature Bitter Orange and Magnolia Bark Decoction","aka":[""]},"herbs":[{"herb":"ZhiShi","dosage":"12g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, transforms Phlegm, reduces distention and resolves hardenings.","With Hou Po, Bai Zhu and Zhi Ban Xia, for epigastric distention and fullness, anorexia, and fatigue due to a Cold-Heat complex obstructing the Qi and leading to Damp Accumulation.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"HouPo","dosage":"12g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Shi, for stagnant Qi failing to move with abdominal distention, wheezing, shortness of breath, nausea and constipation.","With Zhi Shi and Bai Zhu, for epigastric and abdominal distention due to Qi and Food Stagnation.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi, leading to coughing, vomiting or a sense of something stuck in the throat."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Zhi Shi, for Spleen Deficiency with Qi Stagnation with anorexia, epigastric focal distention, and fullness.","With Fu Ling and Yi Yi Ren, for Spleen and Stomach Deficiency with Dampness.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"DangShen","dosage":"30g","actions":["Tonifies the Middle Jiao and augments Qi.","With Fu Ling, for Spleen and Stomach Deficiency.","With Bai Zhu, for Spleen Qi Deficiency with anorexia, loose stools and vomiting."]},{"herb":"YiYiRen","dosage":"30g","actions":["Strengthens the Spleen, resolves Dampness, clears Heat and expels pus.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema.","With Fu Ling and Bai Zhu, for Spleen Deficient diarrhea."]},{"herb":"ChenPi","dosage":"10g","actions":["Regulates Qi, adjusts the Middle, descends Qi, dries Dampness and transforms Phlegm.","With Bai Zhu, for Anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency.","With Sha Ren, for Vomiting of unadulterated, or scanty but viscous fluids.","With Zhi Ban Xia and Fu Ling, for cough due to accumulation of Dampness and Phlegm."]},{"herb":"FuLing","dosage":"10g","actions":["Strengthens the Spleen,d harmonizes the Middle Jiao, promotes urination and leaches out Dampness.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Dang Shen and Bai Zhu, for a weak and deficient Spleen with fatigue, anorexia and loose stools.","With Zhi Ban Xia, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools."]},{"herb":"QuanXie","dosage":"10g","actions":["Attacks and relieves Fire toxins and dissipates nodules and rashes."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Chen Pi, Zhi Ban Xia and Fu Ling, for coughing attacks at night."]},{"herb":"ShaRen","dosage":"3g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Bai Zhu and Dang Shen, for abdominal pain and diarrhea due to Dampness Obstructing the Spleen and Stomach.","With Hou Po, for constrained Dampness with Qi Stagnation leading to distention and fullness in the epigastrium and abdomen.","With Zhi Shi and Bai Zhu, for Spleen and Stomach Qi Stagnation with indigestion."]},{"herb":"GanCao","dosage":"3g","actions":["Tonifies the Spleen and augments Qi, resolves Phlegm, stops cough, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency.","With Dang Shen, Fu Ling and Bai Zhu, strengthens the Spleen and augments Qi."]},{"herb":"ZhiBanXia.htm","dosage":"12g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi, stops vomiting, dissipates nodules, reduces Stagnation, treats sores, skin ulcerations and carbuncles and reduces swelling.","With Chen Pi, for epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Hou Po, for Phlegm-Dampness with Qi Stagnation."]}],"actions":["Tonifies the Spleen","Augments Qi","Breaks up Stagnant Qi","Reduces accumulation","Descends Qi","Dries Dampness","Transforms Phlegm","Resolves hardenings"],"syndromes":["Spleen and Stomach Deficiency Cold with Phlegm"],"manifestations":{"symptoms":["Progressive dysphagia","Vomiting after eating","Frequent epigastric and abdominal distention and fullness which is worse after eating","Vomiting of partially digested food about twelve hours after eating","Vomiting relieves the abdominal discomfort","The vomitus may have thick or thin frothy mucus","Maybe epigastric masses and/or splash on palpation","Stuffiness in the chest","General weakness","Mild constant epigastric pain; relieved by warmth and pressure","Acid regurgitation","Anorexia","Nausea","Loose, unformed stools","Excessive salivation","Cold limbs","Lassitude","Weakness","Sallow or pale, dull complexion","Maybe edema","Maybe scanty urination","Maybe clear, watery, copious vaginal discharge"],"tongue":"Pale","tongueCoat":"White and greasy","pulse":"Deep, thready and forceless"},"conditions":[{"condition":"EsophagealCancer","name":"Esophageal cancer "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}