{"formula":"ZhiSuoErChenTang","names":{"pinyin":"zhi suo er chen tang","hanzi":"枳索二陈汤","english":"two","commonEnglish":"Two-Cured Decoction with Aurantium and Cardamon","aka":["Chih-Shih and Cardamon Combination"]},"herbs":[{"herb":"ZhiShi","dosage":"6g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, unblocks the bowels, removes Stagnant Food, transforms Phlegm, reduces distention and resolves hardenings.","With Hou Po, for distention, swelling and pain due to Food Stagnation and Qi Stagnation.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"ShaRen","dosage":"6g","actions":["Promotes the movement of Qi, aromatically transforms Dampness, strengthens the Spleen, stops vomiting, warms the Middle and stops diarrhea.","With Mu Xiang, increases the flow of Qi in the digestive system while reducing distention and Food Stagnation, alleviating pain and strengthening the Spleen.","With Mu Xiang and Zhi Shi, for Qi Stagnation due to Food Stagnation.","With Hou Po, for constrained Dampness with Qi Stagnation leading to distention and fullness in the epigastrium and abdomen.","With Chen Pi, for Dampness obstructing the Spleen's transforming and transporting functions with reduced intake of food and diarrhea; belching, nausea, and a stifling sensation in the epigastrium due to Disharmony of the Stomach Qi and vomiting of unadulterated, or scanty but viscous fluids."]},{"herb":"ZhiBanXia.htm","dosage":"6g","actions":["Dries Dampness, expels Phlegm, descends Stomach Qi and reduces distention.","With Chen Pi, for Spleen Qi Deficiency or Phlegm-Damp Obstruction manifesting as productive cough and a stuffy chest.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools and treats Phlegm, thin mucus and turbid Dampness.","With Hou Po, for Phlegm-Dampness with Qi Stagnation with a sensation of fullness in the chest with coughing and wheezing, nausea, vomiting and a sensation of distention in the hypochondrium."]},{"herb":"ChenPi","dosage":"6g","actions":["Revives the Spleen, activates Middle Jiao Qi, dries Dampness and transforms Phlegm.","With Zhi Ban Xia, for viscous sputum and a stuffy chest due to Phlegm-Damp Obstruction.","With Zhi Ban Xia, Hou Po and Fu Ling, enhances the Phlegm transforming, Spleen strengthening properties of the formula."]},{"herb":"FuLing","dosage":"6g","actions":["Strengthens the Spleen, transforms Phlegm and drains Dampness from the Middle Jiao.","With Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids.","With Chen Pi, Zhi Ban Xia and Sheng Jiang, for congested Fluids in the Stomach causing distention, nausea and vomiting.","With Mu Xiang, for diarrhea and borborygmus due to Dampness."]},{"herb":"XiangFu","dosage":"6g","actions":["Spreads and regulates Liver Qi and alleviates pain.","With Sha Ren and Mu Xiang, for ulcers and digestive disturbance.","With Yan Hu Suo, for pain anywhere in the body."]},{"herb":"MuXiang","dosage":"1.5g","actions":["Promotes the movement of Qi, adjusts and regulates stagnant Qi in the Intestines, strengthens the Spleen, prevents Stagnation and alleviates pain.","With Sha Ren, for distention, epigastric and abdominal pain, anorexia, nausea, vomiting, diarrhea, dysentery, or tenesmus due to Qi Obstruction and/or Food Stagnation."]},{"herb":"CaoDouKou","dosage":"1.5g","actions":["Dries Dampness, warms the Middle Jiao, stops vomiting and strengthens the Spleen.","With Hou Po, for Cold-Dampness in the Middle Jiao when Dampness predominates.","With Zhi Ban Xia and Chen Pi, for Cold Phlegm affecting the chest and diaphragm with vomiting."]},{"herb":"GanJiang","dosage":"1.5g","actions":["Warms the Middle and expels Cold.","With Zhi Ban Xia, for Vomiting of saliva or dry heaves due to Cold-induced congested fluids.","With Gan Cao, for epigastric pain and vomiting due to Spleen and Stomach Deficiency Cold.","With Hou Po, for epigastric distention and pain due to Cold-induced congested fluids."]},{"herb":"HouPo","dosage":"2.4g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Gan Jiang, for acute diarrhea from Cold attacking the Middle.","With Xiang Fu and Chen Pi, for epigastric and abdominal bloating due to Dampness Obstructing the Qi.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi, leading to coughing, vomiting or a sense of something stuck in the throat.","With Gan Jiang and Cao Dou Kou, for Cold-Dampness in the Middle Jiao."]},{"herb":"XiaoHuiXiang","dosage":"2.4g","actions":["Warms the Liver and Kidneys, expels Cold, regulates Qi, harmonizes the Stomach and alleviates pain.","With Gan Jiang and Mu Xiang, for Qi Stagnation in the Middle Jiao."]},{"herb":"YanHuSuo","dosage":"2.4g","actions":["Invigorates the Blood, circulates Qi, stops pain and induces and prolongs sleep."]},{"herb":"GanCao","dosage":"0.9g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, alleviates pain, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dries Dampness","Dissolves Phlegm","Regulates Qi","Subdues Rebellious Qi","Relieves pain"],"syndromes":["Phlegm-Stagnation above diaphragm and beneath the Heart"],"manifestations":{"symptoms":["Violent nausea and vomiting","Severe vomiting of Phlegm and/or thin fluids","Severe pain","Migrating and shooting pain throughout the upper and lower back","Chest pain","Precordial pain"],"tongue":"Pale","tongueCoat":"Greasy and white","pulse":"Deep and wiry"},"conditions":[{"condition":"Gastritis","name":"Gastritis"},{"condition":"AcidReflux","name":"Acid reflux"},{"condition":"Ulcer","name":"Gastric and duodenal ulcers"},{"condition":"Gastroptosis","name":"Gastroptosis"},{"condition":"NauseaVomiting","name":"Nausea/Vomiting"},{"name":"Back pain"},{"name":"Intercostal neuralgia"},{"name":"Chest pain"},{"condition":"AnginaPectoris","name":"Angina pectoris "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}