{"formula":"ZhiShiXieBaiGuiZhiTang","names":{"pinyin":"zhi shi xie bai gui zhi tang","hanzi":"枳实薤白桂枝汤","english":"unripe bitter orange, chinese garlic and cinnamom twig decoction","commonEnglish":"Unripe Bitter Orange, Chinese Garlic and Cinnamon Twig Decoction","aka":["Chih-Shi, Bakeri and Cinnamon Combination"]},"herbs":[{"herb":"GuaLou","dosage":"12-24g","actions":["Clears Lung Heat, transforms Hot Phlegm, regulates Qi and unbinds the chest."]},{"herb":"XieBai","dosage":"9-12g","actions":["Unblocks Yang Qi, disperses turbid Phlegm, alleviates pain, disperses hardenings, disperses Cold Phlegm Descends Qi and reduces Stagnation.","With Gua Lou, for chest Bi with profuse Phlegm."]},{"herb":"ZhiShi","dosage":"12g","actions":["Breaks up Stagnant Qi, reduces accumulation, descends Qi, transforms Phlegm, reduces distention and resolves hardenings.","With Hou Po, for distention, swelling and pain due to Food Stagnation and Qi Stagnation.","With Xie Bai, Gui Zhi and Gua Lou, for a painful chest with epigastric distention due to Upper Jiao Yang Deficiency with Phlegm-Cold Obstructing the chest."]},{"herb":"HouPo","dosage":"12g","actions":["Promotes the movement of Qi downward, dries Dampness, transforms Phlegm, descends Rebellious Qi and calms wheezing.","With Zhi Shi, for abdominal or chest distention, focal epigastric distention, wheezing, shortness of breath, nausea, rebellious Qi or constipation from Cold, Heat, Dampness or Phlegm as long as clumped Qi is at the root of the problem."]},{"herb":"GuiZhi","dosage":"3-6g","actions":["Warms the channels and collaterals to relieve pain, unblocks Yang, transforms Qi and thin mucus, assists Heart Yang, warms and facilitates the flow of Yang Qi in the chest and warms and facilitates the flow of Qi through the channels and collaterals and Blood through the vessels.","With Xie Bai and Gua Lou, for angina pectoris and chest Bi due to Yang Deficiency in the chest."]}],"actions":["Unblocks Yang","Dissipates clumps","Expels Phlegm","Descends Qi"],"syndromes":["Painful Obstruction of the Chest","Chest Bi"],"manifestations":{"symptoms":["Fullness and pain in the chest or","Stabbing pain that radiates from the chest to the back","Wheezing","Coughing with sputum","Drooling","Shortness of breath","Focal distention in the chest that feels like a flow of Qi proceeding from the flanks to the area around the Heart"],"tongue":"Normal","tongueCoat":"White and greasy","pulse":"Deep and wiry or Deep and tight"},"conditions":[{"name":"Esophageal spasm"},{"condition":"AnginaPectoris","name":"Angina pectoris"},{"condition":"COPD","name":"Chronic obstructive pulmonary disease (COPD)"},{"condition":"Pleurisy","name":"Pleuritis"},{"name":"Intercostal neuralgia"},{"condition":"Dyspnea","name":"Dyspnea"},{"name":"Costochondritis"},{"name":"Hyperventilation disorders"},{"name":"Epigastric pain"},{"name":"Hypochondriac pain"},{"condition":"Cholecystitis","name":"Cholecystitis"},{"name":"Cardiac colic"}],"contra":{"contraindications":["Contraindicated for those with chest pain due to Lung consumption of Phlegm-Heat.","Do not use long-term."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"severe Cold with pain radiating from the chest to the back that is worse with Cold","modifications":[{"herb":"ZhiFuZi","modification":"+ Rx. Aconiti Lateralis Preparata"},{"herb":"GanJiang","modification":"+ Rz. Zingiberis"}]},{"purpose":"intercostal neuralgia","modifications":[]},{"purpose":"angina pectoris","modifications":[{"herb":"ChiShao","modification":"+ Rx. Paeoniae Rubra"},{"herb":"ChuanXiong","modification":"+ Rz. Chuanxiong"},{"herb":"HongHua","modification":"+ Flos Carthami"}]}]}