{"formula":"ZhiTouChuangYiFang","names":{"pinyin":"zhi tou chuang yi fang","hanzi":"治頭疮痍方","english":"forsythia and lonicera formula","commonEnglish":"Forsythia and Lonicera Formula","aka":[""]},"herbs":[{"herb":"CangZhu","dosage":"3-18g","actions":["Strongly dries Dampness, tonifies the Spleen, i Induces sweating, expels Wind-Dampness and clears Dampness from the Lower Jiao."]},{"herb":"LianQiao","dosage":"3-18g","actions":["Clears Heat, especially in the Upper Jiao, relieves toxicity, reduces abscesses, dissipates clumps and clears Blood Heat.","With Jin Yin Hua, for initial-stage Wind-Heat."]},{"herb":"ChuanXiong","dosage":"3-18g","actions":["Invigorates the Blood, promotes the movement of Qi, expels Wind and alleviates pain."]},{"herb":"FangFeng","dosage":"2-12.5g","actions":["Releases the exterior, expels External Wind, expels Wind-Dampness and alleviates pain.","With Jing Jie, Expels Wind and stops itching for Exterior patterns in any season and pruritic rash.","With Cang Zhu, for Wind-Cold-Dampness with chills, anhidrosis, headache, heavy head, lethargy, heavy limbs and stifling fullness in the chest and abdomen."]},{"herb":"JinYinHua","dosage":"2-12.5g","actions":["Clears Heat and resolves Fire toxicity, vents and disperses External Wind-Heat and clears Damp-Heat from the Lower Jiao.","With Lian Qiao, for various Heat disorders."]},{"herb":"HongHua","dosage":"1-6g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Chuan Xiong, for chest and abdominal pain due to Qi and Blood Stasis."]},{"herb":"JingJie","dosage":"1-6g","actions":["Releases the exterior, expels Wind, vents rashes and relieves itching.","With Fang Feng, Jin Yin Hua and Lian Qiao, for Exterior signs and symptoms and early-stage carbuncles, furuncles, and abscesses."]},{"herb":"GanCao","dosage":"1-6g","actions":["Clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Jin Yin Hua, for Damp rashes or acne."]},{"herb":"DaHuang","dosage":"0.5-3g","actions":["Drains Heat, purges accumulations, drains Fire, transforms Dampness and promotes urination."]}],"actions":["Clears Heat","Relieves Toxicity"],"syndromes":["Heat Toxin affecting the skin"],"manifestations":{"symptoms":["Dermatitis of the face, neck and genital area","Skin lesions in children","Eczema of the head"]},"conditions":[{"condition":"ChildhoodEczema","name":"Infantile eczema"},{"condition":"Furuncles","name":"Boils"},{"condition":"Dermatitis","name":"Inflammatory dermatitis "},{"name":"Blisters"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["This formula should be used frequently."],"modifications":[]}