{"formula":"ZhiYouFang","names":{"pinyin":"zhi you fang","hanzi":"止疣方","english":"proven recipe for verruca","commonEnglish":"Proven Recipe for Verruca","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"12g","actions":["Tonifies the Blood, activates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and alleviates pain.","With Tao Ren and Hong Hua, for symptoms associated with Blood Stasis.","With Dang Gui, regulates and harmonizes Qi and Blood."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, calms Liver Yang and Liver Wind and alleviates pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"CiShi","dosage":"12g","actions":["Anchors Liver Yang, calms the Spirit, benefits Yin, nourishes the Kidneys and augments the Liver."]},{"herb":"ZiBeiChi","dosage":"12g","actions":["Calms the Liver, anchors Yang, calms the Shen, clears the Liver and cools Heat."]},{"herb":"DaiZheShi","dosage":"12g","actions":["Calms the Liver, anchors Floating Yang, clears Liver Fire and cools the Blood."]},{"herb":"MuLi","dosage":"12g","actions":["Heavily settles and calms the Spirit, calms the Liver, benefits Yin, anchors Floating Yang, softens hardness and dissipates nodules."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis, activates Blood circulation and drains abscesses."]},{"herb":"HongHua","dosage":"9g","actions":["Activates the Blood, dispels Blood Stasis, opens the channels and alleviates pain.","With Tao Ren, activates the Blood for all types of Blood Stagnation."]},{"herb":"ShanCiGu","dosage":"9g","actions":["Clears Heat, resolves toxicity, reduces abscesses, reduces swelling and dissipates nodules."]},{"herb":"DiGuPi","dosage":"9g","actions":["Clears Heat, cools the Blood and drains Yin Deficiency Fire."]},{"herb":"HuangBai","dosage":"9g","actions":["Drains Damp-Heat, especially from the Lower Jiao, Drains Fire, relieves Fire toxicity and drains Kidney Fire."]}],"actions":["Nourishes the Blood","Calms the Liver","Subdues Rising Liver Yang"],"syndromes":["Qi and Blood Deficiency"],"manifestations":{"symptoms":["Many warts","The surface is dry, withered and rough"]},"conditions":[{"condition":"Warts","name":"Warts"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}