{"formula":"ZhiYinLingShenTang","names":{"pinyin":"zhi yin ling shen tang","commonEnglish":"","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and stops pain due to Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Gan Cao, moderates spasms.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, calms Liver Yang and Liver Wind, softens the Liver and relieves pain.","Wi tn Shu Di HUang and Dang Gui, for dizziness and blurred vision due to Blood Deficiency or Stasis.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations and insomnia.","With Dang Gui and Huang Lian, for Blood Deficiency with Heat.","With Ren Shen, for Qi and Blood Deficiency.","With Dang Gui, Bai Shao and Chuan Xiong, for anemia.","With Ren Shen, Dang Gui, Bai Shao, Bai Zhu and Fu Ling, for anemia with fatigue and weakness."]},{"herb":"RenShen","dosage":"1-9g","actions":["Tonifies Spleen and Heart Qi and calms the Spirit.","With Shu Di Huang, for severe Qi and Blood Deficiency.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu, Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness, anorexia, diarrhea, vomiting, abdominal distention and fatigue."]},{"herb":"FuLing","dosage":"9-18g","actions":["Strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Gan Cao, for Spleen and Heart Deficiency causing facial edema, palpitations, and shortness of breath."]},{"herb":"BaiZhu","dosage":"3-15g","actions":["Tonifies the Spleen and augments Qi.","With Shu Di Huang and Bai Shao, for Blood Deficiency, often with palpitations.","With Gan Cao and Bai Zhu, for Spleen and Stomach Qi Deficiency.","With Ren Shen, Dang Gui, Fu Ling, Bai Shao, Shu Di Huang, Chuan Xiong and Gan Cao, for Blood Deficiency.."]},{"herb":"YuanZhi","dosage":"3-15g","actions":["Calms the Spirit, sedates the Heart, expels Phlegm and opens the Orifices.","With Suan Zao Ren, Bai Zhu and Dang Gui, for palpitations and insomnia due to Qi Deficiency.","With Gan Cao, reduces the irritating effect of Yuan Zhi, to prevent nausea and vomiting.","With Suan Zao Ren, balances the contrasting, introverted and dispersing, extroverted manifestations of Spirit to ensure the proper balance of openness and sobriety."]},{"herb":"SuanZaoRen","dosage":"9-18g","actions":["Nourishes Heart Yin, tonifies the Liver Blood and calms the Spirit."]},{"herb":"GanCao","dosage":"1.5-14g","actions":["Tonifies the Spleen, augments Qi, moderates spasms, alleviates pain, clears Heat, relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs.","With Bai Shao, moderates spasms and alleviates pain.","With Ren Shen, relieves palpitations and anxiety."]},{"herb":"HuangLian","dosage":"1.5-10g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and clears Heart Fire."]},{"herb":"ShengJiang","dosage":"1-10g","actions":["Warms the Middle, stops vomiting and adjusts the Ying and Wei."]},{"herb":"ZhiTianNanXing","dosage":"3-10g","actions":["Disperses Wind-Phlegm in the channels and stops spasms."]}],"actions":["Nourishes and activates the Blood","Calms the Shen","Stops convulsions"],"syndromes":["Heart and Liver Blood Deficiency"],"manifestations":{"symptoms":["Dizziness","Palpitations","Dry eyes","Blurred vision","Acute: Fainting Convulsions","Women may be acute before or after their periods","Pale lips and nails"],"tongue":"Pale","tongueCoat":"Thin and white","pulse":"Thready"},"conditions":[{"condition":"Epilepsy","name":"Epilepsy"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}