{"formula":"ZhiYunTang","names":{"pinyin":"zhi yun tang","hanzi":"止晕汤","english":"stop dizziness decoction","commonEnglish":"Stop Dizziness Decoction","aka":[""]},"herbs":[{"herb":"ZeXie","dosage":"15-30g","actions":["Promotes urination and leaches out Dampness.","With Zhi Ban Xia, for Turbid Dampness in the Middle Jiao causing epigastric and abdominal distention.","With Bai Zhu, for Meniere's disease.","with Fu Ling facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness leading to edema, jaundice, diarrhea, Milky Lin, and scanty, difficult urination with abdominal distention."]},{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids."]},{"herb":"JuHua","dosage":"12g","actions":["Disperses Wind, clears Heat, calms Liver Yang and extinguishes Wind."]},{"herb":"ShiGao","dosage":"12-30g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Blazing Stomach Fire.","With Sheng Di Huang, for excessive Fire with injured fluids."]},{"herb":"FuLing","dosage":"12-25g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Bai Zhu, strengthens the Spleen and resolves Dampness.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention and anorexia due to congested fluids.",""]},{"herb":"BaiZhu","dosage":"12-20g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism.","With Fu Ling and Gan Cao, for Spleen and Stomach Qi Deficiency."]},{"herb":"GuiZhi","dosage":"9g","actions":["Releases the Exterior, assists Yang, adjusts the Ying and Wei, releases the muscle layer, unblocks Yang, transforms Qi and thin mucus, warms the Middle and directs Turbid Yin downward.","With Fu Ling, unblocks Yang and facilitates the removal of congested fluids associated with Yang Deficiency edema.","With Fu Ling and Bai Zhu, for Heart and Spleen Yang Deficiency with palpitations, edema and shortness of breath.","With Fu Ling, Bai Zhu and Gan Cao, for Phlegm accumulation with dizziness, fullness in the chest and hypochondrium, vertigo and palpitations."]},{"herb":"HuangQin","dosage":"9g","actions":["Clears Heat, dries Dampness and calms ascending Liver Yang."]},{"herb":"ChenPi","dosage":"9g","actions":["Regulates Qi, adjusts the Middle, relieves the diaphragm, dries Dampness, transforms Phlegm and descends Qi.","With Bai Zhu, for anorexia and other symptoms of Damp Obstruction due to Spleen Deficiency."]},{"herb":"ZhiBanXia.htm","dosage":"9g","actions":["Dries Dampness, transforms Phlegm, descends Rebellious Qi and stops vomiting.","With Chen Pi, for Epigastric and abdominal distention or pain due to disharmony of the Stomach Qi.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Huang Qin, for Phlegm-Heat induced Rebellious Qi with cough, nausea, and vomiting."]},{"herb":"LongGu","dosage":"25g","actions":["Settles anxiety, calms the Spirit, calms the Liver and anchors and preserves Floating Yang."]},{"herb":"MuLi","dosage":"25g","actions":["Heavily settles, calms the Spirit, calms the Liver, benefits Yin and anchors Floating Yang.","With Long Gu and Gui Zhi, for restlessness, irritability, palpitations and spontaneous sweating due to Floating Yang."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, resolves Phlegm, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Dredges the Liver","Moves Qi","Strengthens the Spleen","Tonifies Qi","Clears Heat","Moistens the Liver and Stomach","Transforms Phlegm","Eliminates Dampness"],"syndromes":["Liver Qi Stagnation and Spleen Qi Deficiency with Heat and Dryness in the Liver and Stomach and Phlegm-Dampness"],"manifestations":{"symptoms":["Dizziness","Vertigo"]},"conditions":[{"condition":"Meniere'sDisease","name":"Meniere's disease"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}