{"formula":"ZhiYouTang","names":{"pinyin":"zhi you tang","hanzi":"止疣汤","english":"decoction for verruca","commonEnglish":"Decoction for Verruca","aka":[""]},"herbs":[{"herb":"JinYinHua","dosage":"12g","actions":["Clears Heat and resolves Fire toxicity.","With Lian Qiao, for various Heat disorders.","With Lian Qiao, Da Qing Ye and Zi Cao, for purpuric rash caused by Heat toxin in epidemic disease."]},{"herb":"LianQiao","dosage":"12g","actions":["Clears Heat, relieves toxicity, reduces abscesses and dissipates clumps.","With Ban Lan Gen, for any externally contracted Heat disorder.","With Ban Lan Gen and Da Qing Ye, for mumps and erysipelas.","With Chi Shao and Zi Cao, for rashes due to Blood Heat.","With Ye Ju Hua, Jin Yin Hua and Pu Gong Ying, for external sores and internal abscesses."]},{"herb":"PuGongYing","dosage":"12g","actions":["Reduces abscesses, dissipates nodules and relieves Fire toxicity.","With Xia Ku Cao, for subcutaneous Phlegm nodules."]},{"herb":"DaQingYe","dosage":"12g","actions":["Clears Heat, resolves Fire toxicity, cools the Blood and dissipates maculae.","With Jin Yin Hua, for Toxic Heat sores, erysipelas, mumps, or sore throat."]},{"herb":"BanLanGen","dosage":"12g","actions":["Drains Heat, relieves Fire toxicity and cools the Blood."]},{"herb":"BaiXianPi","dosage":"12g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"ChaiHu","dosage":"9g","actions":["Disperses Wind-Heat, resolves Phlegm and congestion and harmonizes the Exterior and Interior."]},{"herb":"TaoRen","dosage":"9g","actions":["Breaks up Blood Stasis, invigorates Blood circulation and drains abscesses.","With Hong Hua, invigorates the Blood for all types of Blood Stagnation."]},{"herb":"HongHua","dosage":"9g","actions":["Invigorates the Blood, dispels Blood Stasis, opens the channels, reduces swelling from sores and abscesses and alleviates pain."]},{"herb":"ChiShao","dosage":"9g","actions":["Clears Heat and cools the Blood Invigorates the Blood, dispels Blood Stasis and relieves pain"]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling.","With Chi Shao, cools the Blood and disperses Stasis, for Ying Stage Heat with skin rashes."]},{"herb":"ZiCao","dosage":"9g","actions":["Clears Heat, cools the Blood, invigorates Blood circulation, relieves Fire toxins and clears Damp-Heat from the skin.","With Da Qing Ye, for dense purpuric rash associated with severe Fire toxin."]},{"herb":"XiaKuCao","dosage":"15g","actions":["Clears Hot Phlegm and dissipates nodules.","With Chai Hu, for neck nodules due to Liver Qi Stagnation.","With Pu Gong Ying, for deep-rooted sores."]}],"actions":["Clears Heat","Resolves Toxins","Activates the Blood","Breaks up Stasis"],"syndromes":["Toxic Heat with Blood Stagnation"],"manifestations":{"symptoms":["Large warts",""]},"conditions":[{"condition":"Warts","name":"Warts"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}