{"formula":"ZhiYangXiYao","names":{"pinyin":"zhi yang xi yao","hanzi":"止痒洗药","english":"lotion for relieving itching (topical)","commonEnglish":"Lotion for Relieving Itching","aka":[""]},"herbs":[{"herb":"SheChuangZi","dosage":"15g","actions":["Dries Dampness, kills parasites and stops itching topically."]},{"herb":"DiFuZi","dosage":"15g","actions":["Clears Damp-Heat, promotes urination, expels Dampness and stops itching.","With Ku Shen, for skin irritation and itchiness due to Damp-Heat.","With She Chuang Zi, topically, as a wash for itch.","With Bai Xian Pi, Ku Shen and She Chuang Zi, topically for itching."]},{"herb":"KuShen","dosage":"15g","actions":["Clears Heat, dries Dampness, disperses Wind, kills parasites and stops itching."]},{"herb":"HuangBai","dosage":"15g","actions":["Drains Damp-Heat, drains Fire and relieves Fire toxicity.","With Ku Shen and Chan Tui, for eczema."]},{"herb":"HeShi","dosage":"15g","actions":["Kills parasites and alleviates pain."]},{"herb":"LuFengFang","dosage":"10g","actions":["Relieves toxicity, dries Dampness, expels Wind and alleviates pain and itching.","With Chan Tui, as a tincture for scabies or Wind-Rash with itching."]},{"herb":"DaHuang","dosage":"10g","actions":["Clears Heat, transforms Dampness, invigorates the Blood, dispels Blood Stasis and reduces Fire toxicity.","With Mang Xiao, for abscesses, swellings and toxic sores."]},{"herb":"XingRen","dosage":"10g","actions":["Relieves pathogenic factors from the muscles and skin, drives out Wind, and because of its toxicity, is used to treat sores and kill parasites."]},{"herb":"MingFan","dosage":"10g","actions":["Relieves toxicity, dries Dampness, kills parasites, alleviates itching, restrains and inhibits sores, generates flesh and transforms putrefication.","With She Chuang Zi, for intense itching of eczema, damp scrotum and other pruritic disorders."]},{"herb":"BaiXianPi","dosage":"10g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, clears Damp-Heat and stops itching.","With Ku Shen, for Damp-Heat sores that itch.","With Ku Shen and she Chuang Zi, for itching due to Wind-Damp-Cold or parasites such as scabies.","With Ku Shen and Di Fu Zi, for itching with vaginal discharge."]},{"herb":"DaFengZi","dosage":"10g","actions":["Expels Wind, dries Dampness, attacks toxicity and kills parasites."]},{"herb":"MangXiao","dosage":"10g","actions":["Clears Heat, drains Fire and reduces swelling."]},{"herb":"ChanTui","dosage":"10g","actions":["Disperses Wind, clears Heat, vents rashes and relieves itching."]},{"herb":"MuDanPi","dosage":"10g","actions":["Clears Heat, cools and harmonizes the Blood, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling."]}],"actions":["Expels Wind","Kills parasites","Clears Heat","Eliminates Dampness","Relieves itching"],"syndromes":["Damp-Heat (Topical)"],"manifestations":{"symptoms":["Pinpoint papules","Papulovesicles","Vesicles, some of which coalesce","Slight infiltration and severe, painful itching is likely","Maybe necrosis","Water blisters","The skin is rough and itchy","Local skin flushing","Skin erosion","Bleeding or exudation follows rupture of skin after scratching","Erythema","Burning","Itching","Pain"],"tongue":"Red","tongueCoat":"Thin and yellow or white or Sticky and yellow","pulse":"Soggy and rapid or Floating"},"conditions":[{"condition":"ContactDermatitis","name":"Contact dermatitis"},{"name":"Cutaneous pruritis"},{"condition":"Psoriasis","name":"Psoriasis"},{"condition":"Urticaria","name":"Urticaria"},{"name":"Hand-foot tinea"},{"condition":"Neurodermatitis","name":"Neurodermatitis"},{"condition":"Eczema","name":"Eczema"},{"condition":"Erythema","name":"Erythema"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":["Decoct the herbs and rinse the affected area(s) while it is still hot for thirty minutes at a time, once or twice daily."],"modifications":[]}