{"formula":"ZhiZiJinHuaTang","names":{"pinyin":"zhi zi jin hua tang","hanzi":"梔子进化湯","english":"advanced gardenia fruit decoction","commonEnglish":"Advanced Gardenia Fruit Decoction","aka":[""]},"herbs":[{"herb":"ZhiZi","dosage":"15g","actions":["Clears Heat, reduces Fire, eliminates irritability, drains Damp-Heat, cools the Blood and relieves toxicity.","With Da Huang, for constipation."]},{"herb":"HuangLian","dosage":"7g","actions":["Clears Heat, drains Dampness, drains Fire, resolves Fire toxicity and stops bleeding.","With Huang Qin, drains pathogenic Heat from the Upper and Middle Jiaos for high fever, redness, swelling and pain of the head and face, dry mouth, parched throat, ulcerations of the mouth and tongue, epistaxis, rashes and irritability in warm-febrile disease.","With Huang Qin and Zhi Zi, for high fever, irritability, dry mouth and throat and dark urine due to Fire toxin in the three burners.","With Huang Qin and Da Huang, for hematemesis and rectal bleeding due to Blood Heat."]},{"herb":"HuangBai","dosage":"7g","actions":["Drains Fire, relieves Fire toxicity, drains Damp-Heat especially from the Lower Jiao and drains Deficiency Fire.","With Zhi Zi, eliminates pathogenic Dampness from the Liver and Gallbladder for Yang type jaundice with noticeable fever, markedly yellow/orange skin and eyes, thirst and a red tongue with a yellow coat."]},{"herb":"HuangQin","dosage":"7g","actions":["Clears Heat, dries Dampness, drains Fire, detoxifies, cools the Blood and stops bleeding.","With Huang Lian, for explosive diarrhea and dysentery with burning pain in the anus or fitted, filthy stools and abdominal pain.","With Zhi Zi, for Damp-Heat and jaundice."]},{"herb":"DaHuang","dosage":"6g","actions":["Drains Heat, purges accumulations, clears Heat, reduces Fire toxicity, transforms Dampness, cools and invigorates the Blood and dispels Blood Stasis.","With Huang Lian, for distention, palpitations, mental distress with facial congestion and epilepsy due to Excess Heat.","With Huang Lian and Huang Qin, for hematemesis or epistaxis due to Blood Heat and whole body Damp-Heat."]}],"actions":["Clears Heat","Resolves toxicity","Resolves Dampness","Cools the Blood","Purges accumulations"],"syndromes":["Toxic Heat"],"manifestations":{"symptoms":["Rapidly developing jaundice that quickly deepens in color to orange or gold both in the body and conjunctiva","High fever","Irritability","Agitation","Restlessness","Thirst","Dry mouth","Dry throat","Foul breath","Chest oppression with a feeling of suffocation and Heat","Frequent vomiting","Abdominal distention and pain that is worse with pressure","Flank pain","Insomnia","Dark urine","Palpitations","Tinnitus","Purpura","Red face","Rashes","Deep-rooted boils","Red eyes","Itchy skin","Dry lips","Dysentery with fever","Scanty urine or","Anuria","Dark urine","Constipation or","Diarrhea","Drowsiness","Ascites","Severe: Epistaxis Maculae Melaena Carbuncles Hematemesis Hemoptysis Hematuria Cloudy mind Delirium Obsession Furuncles Incoherent speech Bleeding gums Muscle spasms Convulsions Loss of consciousness"],"tongue":"Dark red","tongueCoat":"Dark yellow","pulse":"Wiry and rapid or Rapid and forceful or Thready and rapid"},"conditions":[{"condition":"Jaundice","name":"Jaundice"},{"condition":"Purpura","name":"Purpura"},{"condition":"AcuteHepatitis","name":"Acute infectious hepatitis"},{"condition":"Ascites","name":"Ascites"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}