{"formula":"ZhongZiFang","names":{"pinyin":"zhong zi fang","hanzi":"种子方","english":"seed formula","commonEnglish":"Seed Formula","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood, regulates the menses and disperses Cold.","With Bai Shao, regulates and harmonizes Qi and Blood.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood, promotes the movement of Qi and alleviates pain."]},{"herb":"WuZhuYu","dosage":"1.5-10g","actions":["Warms the Middle Jiao, disperses Cold, promotes the movement of Qi, relieves Stagnation in the Liver channel and alleviates pain."]},{"herb":"ShuDiHuang","dosage":"9-30g","actions":["Nourishes Jing and Blood, fills the Marrow and nourishes Liver and Kidney Yin.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"XiangFu","dosage":"6-14g","actions":["Spreads and regulates Liver Qi, regulates menstruation and alleviates pain.","With Dang Gui, tonifies the Blood and moves Qi, for premenstrual symptoms, menstrual pain and irregular menstruation.","With Dang Gui and Chuan Xiong, for irregular menstruation and dysmenorrhea due to Qi and Blood Stasis.","With Chuan Xiong, for Qi Stagnation combined with Blood Stasis."]},{"herb":"BaiShao","dosage":"5-30g","actions":["Nourishes the Blood, regulates menstruation,softens the Liver and relieves pain.","With Dang Gui and Shu Di Huang, for dizziness, blurred vision and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"DanShen","dosage":"3-15g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat and soothes irritability."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen."]},{"herb":"ChenPi","dosage":"3-9g","actions":["Regulates Qi, adjusts the Middle and relieves the diaphragm."]},{"herb":"YanHuSuo","dosage":"3-12g","actions":["Invigorates the Blood, circulates Qi and stops pain.","With Xiang Fu and Dang Gui, for dysmenorrhea from Qi Stagnation and Blood Stasis.","With Chuan Xiong, for body aches and headaches due to Blood Stagnation.","With Xiang Fu, treats a wide range of applications from Liver Qi Stagnation to deep Blood Stasis and a wide variety of pain anywhere in the body including chest pain, distending pain in the breast, Cold pain in the epigastrium, pain due to bulging disorders in the lower body and dysmenorrhea from Qi and Blood Stagnation.","With Dang Gui, Chuan Xiong, Bai Shao and Xiang Fu, for amenorrhea or menstrual pain due to Qi and Blood Stagnation."]}],"actions":["Dredges the Liver","Regulates Qi","Invigorates the Blood","Regulates the menses"],"syndromes":["Liver Qi Stagnation"],"manifestations":{"symptoms":["Infertility","Inability to conceive for many years","Decreased and dark-colored menses that contain clots or","Scanty, pale-colored menses","Irregular menstruation","Breast and hypochondriac pain","Abdominal pain with periods","Maybe premenstrual breast distention","Premenstrual breast tension","Painful periods","Irritability before periods","Anxiety before periods","Depression","Abdominal distention","Eructation","Sighing","Water retention","Headache","A history of cramping"],"tongue":"Normal color or slightly red on the sides; if Stagnation of Qi arises from Blood Deficiency, the sides might be Pale","tongueCoat":"Normal","pulse":"Taut or Wiry; if Qi Stagnation arises from Blood Deficiency, it may be Choppy"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}