{"formula":"ZhongYuWan","names":{"pinyin":"zhong yu wan","commonEnglish":"","aka":[""]},"herbs":[{"herb":"YiMuCao","dosage":"9-60g","actions":["Invigorates the Blood, dispels Stasis, regulates menstruation and reduces masses.","With Dang Gui, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness and scanty menstruation.","With Dang Gui and Chuan Xiong, for dysmenorrhea or lower abdominal pain due to postpartum Blood Stasis.","With Chi Shao, Dang Gui and Mu Xiang, for Blood Stasis with infertility, irregular menstruation, lower abdominal pain and fullness and scanty menstruation."]},{"herb":"ChuanXiong","dosage":"3-10g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses and amenorrhea."]},{"herb":"ChiShao","dosage":"4.5-15g","actions":["Invigorates the Blood, dispels Blood Stasis, relieves pain, clears Heat and cools the Blood.","With Chuan Xiong and Dang Gui, for Blood-Stasis induced gynecological disorders such as immobile abdominal masses and amenorrhea with abdominal pain."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies, invigorates and harmonizes the Blood and regulates the menses.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis."]},{"herb":"MuXiang","dosage":"1.5-10g","actions":["Promotes the movement of Qi and alleviates pain."]}],"actions":["Invigorates the Blood","Promotes Qi circulation","Dispels Stasis","Regulates menstruation"],"syndromes":["Blood Stagnation"],"manifestations":{"symptoms":["Infertility","Irregular and painful periods or","Delayed menstruation with decreased menses or","Dysmenorrhea","The menses may become dark purple in color and contain many clots","May be abdominal pain with guarding","Pain in the lower abdomen","Irritability","Manic behavior","Frequent abdominal pain","Mental restlessness"],"tongue":"Purple or Pale with purple dots","tongueCoat":"Normal","pulse":"Wiry or Choppy or Thin and wiry or Taut and thready"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}