{"formula":"ZhongSiWan","names":{"pinyin":"zhong si wan","commonEnglish":"","aka":[""]},"herbs":[{"herb":"ZhiFuZi","dosage":"1.5-15g","actions":["Warms Ming Men Fire and assists Heart, Kidney and Spleen Yang.","With Rou Gui, powerfully tonifies Kidney Yang, for Kidney Yang Deficiency with lower back pain and weakness in the legs and knees.","With Gan Jiang, warms the Spleen and Kidneys, benefits Yang and disperses Cold.","With Ren Shen, for severe Deficiency of Source Qi and Collapse of Yang with cold extremities, sweating, weak breathing, dizziness and an extremely pale complexion."]},{"herb":"FuLing","dosage":"9-18g","actions":["Promotes urination, leaches out Dampness and strengthens the Spleen.","With Zhi Fu Zi, for lower body edema and dysuria."]},{"herb":"BaiWei","dosage":"3-12g","actions":["Promotes urination."]},{"herb":"ZhiBanXia.htm","dosage":"3-15g","actions":["Dries Dampness and transforms Phlegm.","With Xi Xin and Gan Jiang, for vomiting due to Cold with copious, frothy sputum with Cold signs and thin mucus in the Lungs.","With Fu Ling, for Phlegm, thin mucus and turbid Dampness.","With Ren Shen, for vomiting due to Stomach Deficiency.","With Hou Po, for Phlegm-Dampness with Qi Stagnation to open Phlegm and Qi Obstruction with a sensation of fullness in the chest with coughing and wheezing, nausea, vomiting and a sensation of distention in the hypochondrium."]},{"herb":"DuZhong","dosage":"8-16g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang."]},{"herb":"RouGui","dosage":"1.5-5g","actions":["Warms the Kidneys, Spleen and Heart and strengthens Yang and Ming Men Fire, alleviates pain and assists in the generation of Qi and Blood.","With Zhi Fu Zi, for Deficiency of Ming Men Fire with impotence or infertility.","With Zhi Fu Zi and Gan Jiang, for a cold, painful abdomen, anorexia and diarrhea due to Kidney and Spleen Yang Deficiency."]},{"herb":"HouPo","dosage":"3-10g","actions":["Promotes the movement of Qi in the Middle Jiao, resolves Stagnation, descends Qi, dries Dampness and transforms Phlegm.","With Zhi Ban Xia and Fu Ling, for Phlegm Obstructing the Qi, leading to coughing, vomiting or a sense of something stuck in the throat.","With Gan Jiang, for acute diarrhea from Cold attacking the Middle."]},{"herb":"QinJiao","dosage":"3-12g","actions":["Expels Wind-Dampness, opens the channels, soothes the sinews and collaterals and clears Deficiency Heat."]},{"herb":"FangFeng","dosage":"3-10g","actions":["Expels Wind-Dampness and alleviates pain.","With Qin Jiao, for Wind-Damp Bi with spasms of the tendons or numbness of the limbs."]},{"herb":"GanJiang","dosage":"3-10g","actions":["Warms the Middle, expels Cold, dispels Wind-Dampness seeping into the Lower Jiao, rescues Devastated Yang, expels Interior Cold, warms the Lungs and transforms thin mucus.","With Zhi Fu Zi, warms the Spleen and Kidneys, benefits Yang, and disperses Cold.","With Zhi Ban Xia, for vomiting of saliva or dry heaves due to Cold-induced congested fluids.","With Zhi Ban Xia and Ren Shen, for vomiting due to Deficiency Cold.","With Hou Po, for epigastric distention and pain due to Cold-induced congested fluids."]},{"herb":"NiuXi","dosage":"6-16g","actions":["Invigorates the Blood and expels Blood Stasis.","With Du Zhong, for low back and extremity pain and weakness due to Bi pain or Kidney Deficiency."]},{"herb":"ShaShen","dosage":"9-30g","actions":["Tonifies Liver and Kidney Yin."]},{"herb":"XiXin","dosage":"0.5-5g","actions":["Disperses Wind-Cold and Internal Cold and alleviates pain.","With Zhi Fu Zi, for Cold damage both Internal and External with aversion to Cold, headache and generalized body aches with aching joints.","With Zhi Fu Zi and Rou Gui, for abdominal pain, coldness of the lower extremities, a pale tongue and no thirst."]},{"herb":"RenShen","dosage":"1-9g","actions":["Powerfully tonifies Yuan Qi Tonifies Spleen and Stomach Qi."]}],"actions":["Warms and Reinforces the Spleen and Kidneys","Transforms Phlegm","Expels Wind-Cold-Damp"],"syndromes":["Spleen and Kidney Yang Deficiency"],"manifestations":{"symptoms":["Continuous cramping pain in the abdomen","Pain is not severe","Pain is relieved by pressure","Edema of the feet","Urinary difficulty","Slight edema (primarily of the lower limbs)","Symptoms generally occur during pregnancy","Pale face","Fatigue","Heaviness of head","Lassitude","Lower abdominal pain","Dizziness","Tinnitus","Lumbago","Edema","Abdominal pain with edema during pregnancy due to Blood Deficiency and abnormal water circulation","Oliguria","Palpitations","Cold feet","Extreme coldness of the hands and feet","Vertigo","Weakness and numbness of lower back and legs during pregnancy or postpartum","Mal position of the fetus","Dysmenorrhea","Irregular menstruation","Right upper quadrant pain","Hepatomegaly","Anemia","Lack of energy","Sore back","Thirst with no desire to drink"],"tongue":"Pale or pink maybe petechiae on margin","tongueCoat":"Thin or Greasy white","pulse":"Deep and weak or Soft, floating, small and slow or Wiry and small or Wiry and rough"},"conditions":[{"condition":"Infertility","name":"Infertility"},{"condition":"EdemaDuringPregnancy","name":"Edema with abdominal pain during pregnancy"},{"condition":"AbdominalPainDuringPregnancy","name":"Abdominal pain with edema during pregnancy"},{"condition":"Pregnancy","name":"Weakness and numbness of lower back and legs during pregnancy or postpartum "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}