{"formula":"ZhongCangPingYuanTang","names":{"pinyin":"zhong cong ping yuan tang","hanzi":"重蒼冯源汤","english":"heavy dosage xanthium deep","commonEnglish":"Heavy Dosage Xanthium Deep-Source Decoction","aka":[""]},"herbs":[{"herb":"CangErZi","dosage":"30g","actions":["Disperses Wind and Dampness and opens the nasal passages.","With Xin Yi Hua, for chronic sinusitis.","With Xin Yi Hua and Bai Zhi, for headaches and nasal obstruction.","With Xin Yi Hua, Shi Gao and Bai Zhi, for acute Wind-Heat patterns."]},{"herb":"LianQiao","dosage":"20g","actions":["Clears Heat, especially in the Upper Jiao, and relieves toxicity."]},{"herb":"XuanShen","dosage":"20g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity.","With Jie Geng and Gan Cao, for sore throat with Dryness and pain."]},{"herb":"SangBaiPi","dosage":"20g","actions":["Drains Heat from the Lungs, stops coughing and calms wheezing."]},{"herb":"JieGeng","dosage":"18g","actions":["Opens the Lungs, spreads Lung Qi, expels Phlegm and directs the effects of other herbs to the upper body.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus for Excess disorders in the Upper Jiao with no disorder in the Lower Jiao."]},{"herb":"ShiGao","dosage":"15g","actions":["Clears Heat in the Qi Stage, drains Fire, relieves irritability, quenches thirst and clears Excess Heat from the Lungs."]},{"herb":"MuDanPi","dosage":"15g","actions":["Clears Heat and cools and harmonizes the Blood."]},{"herb":"HuoXiang","dosage":"15g","actions":["Aromatically transforms Dampness and transforms turbidity."]},{"herb":"BaiZhi","dosage":"12g","actions":["Expels Wind, eliminates Dampness, unblocks the nasal passages, dispels Cold, reduces swelling, eliminates toxins, expels pus and alleviates pain.","With Xin Yi Hua and Cang Er Zi, for headaches due to nasal congestion with thick putrid discharge."]},{"herb":"XinYi(Hua)","dosage":"12g","actions":["Expels Wind-Cold and unblocks the nasal passages.","With Cang Er Zi, strongly unblocks nasal obstruction and sinus headache due to Wind-Cold or Wind-Heat for sinusitis and rhinitis with loss of sense of smell."]},{"herb":"JingJie","dosage":"9g","actions":["Releases the Exterior and expels Wind.","With Jie Geng and Gan Cao, for acute coughing associated with External disorders."]},{"herb":"GanCao","dosage":"9g","actions":["Moistens the Lungs, resolves Phlegm, stops coughing, clears Heat, relieves Fire toxicity, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]},{"herb":"MaHuang","dosage":"6g","actions":["Induces sweating, releases the Exterior, disseminates and facilitates Lung Qi, calms wheezing, stops coughing and warms and disperses Cold pathogens.","With Shi Gao, for coughing from Heat Obstructing the Lungs with wheezing, flaring of the nostrils and fever.",""]}],"actions":["Disperses Wind","Eliminates Dampness","Clears Heat","Unblocks the nasal passages"],"syndromes":["Acute sinusitis due to Wind-Damp-Heat"],"manifestations":{"symptoms":["Acute sinusitis",""]},"conditions":[{"condition":"Sinusitis","name":"Acute sinusitis"},{"name":""}],"contra":{"contraindications":["Use for only a short period of time."],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"fever and chills due to Wind-Heat","modifications":[{"herb":"HuangQin","modification":"+ 9g Rx. Scutellariae"},{"herb":"JinYinHua","modification":"+ 9g Flos Lonicerae"}]},{"purpose":"irascibility and a bitter taste in the mouth due to Liver Fire","modifications":[{"herb":"LongDanCao","modification":"+ 9g Rx. Gentianae"},{"herb":"ZhiZi","modification":"+ 9g Fr. Gardeniae"}]},{"purpose":"mouth sores, dry stools and thirst due to Stomach Fire","modifications":[{"herb":"DaHuang","modification":"+ 3-6g Rx. et Rz. Rhei"},{"herb":"MangXiao","modification":"+ 3-6g Natrii Sulfas"}]}]}