{"formula":"ZhuangYangChiWeiWan","names":{"pinyin":"zhuang yang chi wei wan","hanzi":"壮阳持威囊","english":"strengthen kidney yang and preserve power pill","commonEnglish":"Strengthen Kidney Yang and Preserve Power Pill","aka":[""]},"herbs":[{"herb":"DangShen","dosage":"12g","actions":["Tonifies the Middle Jiao and augments Qi.","With Dang Gui and Shu Di Huang, for Qi and Blood Deficiency with dizziness, weakness and lassitude."]},{"herb":"BaiZhu","dosage":"12g","actions":["Tonifies the Spleen, augments Qi, dries Dampness and promotes water metabolism."]},{"herb":"GouQiZi","dosage":"12g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin, benefits Jing and brightens the eyes.","With Shu Di Huang, for Liver and Kidney Deficiency.","With Shu Di Huang, Tu Si Zi and Du Zhong, for dizziness, weakness, impotence and spermatorrhea due to Kidney and Liver Yin and Blood Deficiency."]},{"herb":"DongChongXiaCao","dosage":"12g","actions":["Tonifies the Kidneys, strengthens Yang and augments Jing.","With Tu Si Zi, Rou Cong Rong and Yin Yang Huo, for spermatorrhea, premature ejaculation and low back and lower extremity pain from Kidney Deficiency.","With Du Zhong and Xu Duan, for bone and joint disorders."]},{"herb":"ShuDiHuang","dosage":"12g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations and insomnia.","With Gui Ban, for dizziness, insomnia, tinnitus, forgetfulness, afternoon fevers and night sweats due Yin Deficiency with Yang Rising."]},{"herb":"YangQiShi","dosage":"12g","actions":["Warms the Kidneys and the Lower Jiao, warms the Ming Men and fortifies the Yang."]},{"herb":"JiuCaiZi","dosage":"12g","actions":["Supplements the Liver, warms the Kidneys, fortifies Yang and astringes Jing."]},{"herb":"BieJia","dosage":"30g","actions":["Nourishes Yin and anchors Yang.","With Gui Ban, for Liver and Kidney Yin Deficiency with Heat Rising."]},{"herb":"GuiBan","dosage":"30g","actions":["Nourishes Yin, anchors Yang, benefits the Kidneys and strengthens the bones."]},{"herb":"DuZhong","dosage":"9g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones and tonifies Kidney Yang."]},{"herb":"SuoYang","dosage":"9g","actions":["Tonifies the Kidneys, benefits Jing and marrow, strengthens Yang, nourishes Liver Yin and Blood and strengthens sinews and bones.","With Rou Cong Rong, for impotence or infertility due to insufficiency of the Liver and Kidneys along with exhausted Jing and Blood.","With Shu Di Huang and Gui Ban, for soreness and weakness of the back and knees."]},{"herb":"YinYangHuo","dosage":"9g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido.","With Shu Di Huang, Gui Ban and Zi He Che, for impotence with cold lower back and legs due to Kidney Yang Deficiency."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and alleviates pain.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"XuDuan","dosage":"9g","actions":["Tonifies the Liver and Kidneys and strengthens the sinews and bones.","With Du Zhong, tonifies the Liver and Kidneys, strengthens the lower back and secures the Chong and Ren channels to treat aching in the lower back and knees and weakness of the legs which makes walking difficult."]},{"herb":"RouCongRong","dosage":"9g","actions":["Tonifies the Kidneys, strengthens the Yang","and benefits Jing and marrow.","With Yin Yang Huo, for decreased sexual desire."]},{"herb":"BuGuZhi","dosage":"9g","actions":["Tonifies the Kidneys, strengthens Yang, stabilizes Jing and astringes urine."]},{"herb":"ZiHeChe","dosage":"9g","actions":["Tonifies the Liver and Kidneys, strengthens Jing, tonifies Qi, nourishes the Blood, tonifies Lung Qi and augments Kidney Jing.","With Shu Di Huang, for chronic weakness and debility."]},{"herb":"TuSiZi","dosage":"15g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow, tonifies the Kidneys and Liver and improves vision.","With Bu Gu Zhi and Du Zhong, for premature ejaculation, spermatorrhea and low back pain from Kidney Deficiency.","With Du Zhong, enriches and tonifies the Kidneys and Liver, astringes Jing, nourishes Kidney Yin, brightens the eyes and encourages the movement of Primal Yang to treat premature ejaculation, spermatorrhea and lower back pain from Kidney Deficiency."]},{"herb":"GanCao","dosage":"9g","actions":["Tonifies the Spleen, augments Qi, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels.","With Dang Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency."]}],"actions":["Warms and Reinforces Kidney Yang"],"syndromes":["Kidney Yang Deficiency"],"manifestations":{"symptoms":["Impotence","Low libido","An inability to get or sustain an erection","Lack of erection upon waking","Infertility","Low sperm motility","Low sperm count","Watery ejaculate","Lumbago: low back feels cold, weak and aching","Feeling chilled","Aversion to Cold","Intolerance of cold","Cold limbs","General debility","Pale face","Blurred vision","Poor memory","Urinary frequency with abundant, clear urine or","Oliguria with edema or","Urinary incontinence","Maybe nocturia","Edema of the lower limbs with scanty urination","Lassitude","Listlessness","Fatigue","Withdrawn, subdued behavior","Knees feel cold and aching","Cold feet","Dizziness","Tinnitus","Deafness","Impotence","Spermatorrhea","Premature ejaculation","Maybe anorexia","Maybe loose stools","Lower abdominal distention","Constipation or","Loose stools","Maybe chronic diarrhea or \"cock crow\" diarrhea"],"tongue":"Pale and swollen","tongueCoat":"Thin and white"},"conditions":[{"condition":"Impotence","name":"Impotence"},{"condition":"UrinaryIncontinence","name":"Urinary incontinence"},{"condition":"Spermatorrhea","name":"Spermatorrhea"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}