{"formula":"ZhuRuWenDanTang","names":{"pinyin":"zhu ru wen dan tang","hanzi":"竹茹温胆汤","english":"bamboo decoction to warm the gallbladder","commonEnglish":"Bamboo Decoction to Warm the Gallbladder","aka":["Bamboo and Ginseng Combination"]},"herbs":[{"herb":"ChaiHu","dosage":"6g","actions":["Resolves Shao Yang disorders, reduces fever, disperses Wind-Heat and resolves Phlegm and congestion.","With Gan Cao, for Wind-Heat fever."]},{"herb":"ZhuRu","dosage":"6g","actions":["Clears Heat and Phlegm from the Gallbladder and Stomach, cools Blood and descends rebellious Qi.","With Zhi Ban Xia and Zhi Shi, for insomnia, palpitations and irritability due to Phlegm Heat leading to disharmony between the Gallbladder and Stomach with a stifling sensation in the chest and restlessness","With Zhi Shi, for Phlegm-Heat obstructing the flow of Qi with focal distention in the chest and epigastrium, hiccup, dry retching, nausea and acid regurgitation and palpitations, irritability, insomnia and emotional problems due to Gallbladder constraint with Phlegm Disturbing the Heart.","With Zhi Ban Xia, Chen Pi, Zhi Shi and Fu Ling, for Gallbladder Fire with Phlegm.","With Huang Lian, for nausea, vomiting, hiccup or dry retching due to Stomach Fire and vomiting of mucus or acid regurgitation due to Phlegm-Heat Obstructing the Stomach."]},{"herb":"JieGeng","dosage":"6g","actions":["Opens the Lungs, spreads Lung Qi and expels Phlegm.","With Gan Cao, disseminates Lung Qi, expels Phlegm, resolves toxicity and expels pus for productive cough with hoarseness, pain and swelling of the throat due to Wind-Heat.","With Zhi Ban Xia, for cough due to Wind-Cold Invasion or long-standing Phlegm-Dampness."]},{"herb":"ZhiShi","dosage":"6g","actions":["Reduces accumulation, descends Qi, transforms Phlegm and reduces distention.","With Chen Pi, strengthens the Middle Jiao."]},{"herb":"HuangLian","dosage":"1.5g","actions":["Clears Heat, drains Dampness, drains Fire and resolves Fire toxicity.","With Zhu Ru and Zhi Ban Xia, for Gallbladder Fire and Phlegm-Heat Disturbing the Heart with palpitations, insomnia,irritability and a stifling sensation in the chest."]},{"herb":"RenShen","dosage":"15g","actions":["Tonifies Qi in Deficiency patients with Exterior conditions."]},{"herb":"ChenPi","dosage":"2.4g","actions":["Regulates Qi, tonifies the Spleen, transforms Phlegm and descends Qi.","With Ban Xia, for excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Sheng Jiang, for manifestations of Stomach Qi Disharmony and Cold-Dampness Obstructing the Middle with nausea and hiccup.","With Zhu Ru and Huang Lian, for Phlegm-Heat induced vomiting.","With Zhi Ban Xia, for a stifling sensation in the chest and cough with excessive white, viscous sputum due to Phlegm-Damp Obstruction.","With Zhi Ban Xia, Zhu Ru and Sheng Jiang, for nausea and vomiting due to rebellious Stomach Qi.","With Zhi Ban Xia and Fu Ling, for Cough due to accumulation of Dampness and Phlegm."]},{"herb":"ZhiBanXia.htm","dosage":"2.4g","actions":["Transforms Phlegm, descends rebellious","Qi, harmonizes ST and stops vomiting.","With Chen Pi, for Spleen and Stomach Qi Disharmony with epigastric and abdominal distention or pain.","With Fu Ling, expels Phlegm and stops nausea and vomiting, hiccups, coughs with clear, profuse Phlegm and loose and watery stools, treats Phlegm, thin mucus and turbid Dampness and prevents turbid Phlegm and Dampness from disturbing the Heart with dizziness, palpitations and insomnia.","With Huang Lian, for epigastric distention and indigestion due to a simultaneous invasion of Hot and Cold pathogenic influences into the Stomach.","With Huang Lian and Zhu Ru, for vomiting from Stomach Heat.","With Ren Shen, for vomiting due to Stomach Deficiency."]},{"herb":"FuLing","dosage":"2.4g","actions":["Resolves Dampness, strengthens the Spleen, harmonizes the Middle Jiao and transforms Phlegm.","With Gan Cao, strengthens the Spleen, drains Dampness, harmonizes the Middle Jiao and calms the Shen.","With Chen Pi, for nausea and vomiting due to congested Fluids.","With Zhi Ban Xia and Chen Pi, for nausea, vomiting, chest fullness and distention, and anorexia due to congested fluids.","With Zhi Ban Xia, Chen Pi and Sheng Jiang, for congested fluids in the Stomach causing nausea and vomiting."]},{"herb":"XiangFu","dosage":"2.4g","actions":["Spreads and regulates Liver Qi.","With Chai Hu, for Qi Stagnation and menstrual irregularity."]},{"herb":"DaZao","dosage":"0.9g","actions":["Tonifies the Spleen and Stomach, augments Qi, protects the Stomach and moderates and harmonizes the harsh properties of other herbs.","With Sheng Jiang, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen."]},{"herb":"ShengJiang","dosage":"0.9g","actions":["Regulates the relationship between the Gallbladder and the Stomach and assists in stopping vomiting.","With Da Zao, protects the Stomach Qi.","With Zhi Ban Xia, for vomiting due to Cold, Thin Mucus.","With Zhu Ru, for vomiting due to Heat in patients with Stomach Qi Deficiency.","With Chen Pi, for Cold-Dampness Obstructing the Middle with nausea and hiccup."]},{"herb":"GanCao","dosage":"0.9g","actions":["Resolves Phlegm, clears Heat, tonifies the Spleen and harmonizes and moderates the harsh properties of the other herbs."]}],"actions":["Clears Heat","Dissolves Phlegm"],"syndromes":["Phlegm-Fire Disturbs the Heart and Gallbladder"],"manifestations":{"symptoms":["Irritability","Palpitations","Bitter taste in mouth","Insomnia","Much dreaming","Easily startled","Frightens easily","Mild, persistent fever","Copious Phlegm in the chest","Fidgeting","Severe cases: Incoherent speech Crying and laughing without reason Manic agitation with irrational behavior May physically attack or abuse others"],"tongue":"Red tip","tongueCoat":"Yellow and greasy","pulse":"Slippery, Excess, rapid and maybe wiry"},"conditions":[{"condition":"Fever","name":"Mild, persistent fever"},{"condition":"Insomnia","name":"Insomnia"},{"condition":"Palpitations","name":"Neurotic palpitations"},{"name":"Alcohol poisoning"},{"condition":"Neurasthenia","name":"Neurasthenia "}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"insomnia","modifications":[{"herb":"YeJiaoTeng","modification":"+ Caulis Polygoni Multiflori"},{"herb":"YuanZhi","modification":"+ Rx. Polygalae"}]}]}