{"formula":"ZhuTiTang","names":{"pinyin":"zhu ti tang","hanzi":"猪蹄汤","english":"pig trotters decoction","commonEnglish":"Pig's Trotters Decoction","aka":[""]},"herbs":[{"herb":"RenShen","dosage":"3-9g","actions":["Tonifies Qi and strengthens the Spleen and Stomach.","With Shu Di Huang, for severe Qi and Blood Deficiency due to loss of blood and Qi and Yin Deficiency.","With Bai Zhu, tonifies the transformation and transportation functions of the Spleen.","With Bai Zhu, Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency with Dampness, anorexia, diarrhea, vomiting, abdominal distention and fatigue.","With Shu Di Huang, Bai Zhu, Fu Ling and Bai Shao, for Qi and Blood Deficiency."]},{"herb":"DangShen","dosage":"6-27g","actions":["(Substitutes for Ren Shen.)"]},{"herb":"BaiZhu","dosage":"3-12g","actions":["Tonifies the Spleen, augments Qi and dries Dampness.","With Shu Di Huang and Bai Shao, for restless fetus due to Blood Deficiency, often with palpitations.","With Fu Ling and Zhi Gan Cao, for Spleen and Stomach Qi Deficiency.","With Fu Ling and Sheng Jiang, for edema with Kidney Yang Deficiency.","With Shu Di Huang, Dang Gui and Bai Shao, for unstable pregnancy with Blood Deficiency."]},{"herb":"FuLing","dosage":"3-15g","actions":["Dries Dampness and strengthens the Spleen.","With Ren Shen and Bai Zhu, for weak and deficient Spleen with fatigue, anorexia and loose stools."]},{"herb":"GanCao","dosage":"1.5-6g","actions":["Augments Qi, ,warms and strengthens the Middle Jiao and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, for anorexia, fatigue and loose stools due to Spleen Deficiency."]},{"herb":"ShuDiHuang","dosage":"3-18g","actions":["Strengthens the Liver and Kidneys, and nourishes the Yin of the Blood.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction.","With Bai Shao, Dang Gui and Chuan Xiong, for anemia.","With Ren Shen, Bai Zhu, Fu Ling, Dang Gui and Bai Shao, for anemia with fatigue and weakness."]},{"herb":"BaiShao","dosage":"3-15g","actions":["Tonifies Blood and preserves Yin.","With Shu Di Huang, strongly tonifies Liver Blood.","With Shu Di Huang and Dang Gui, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"DangGui","dosage":"3-15g","actions":["Tonifies and invigorates the Blood, moistens the Intestines and regulates the relationship between the Liver and Kidneys.","With Bai Shao, regulates and harmonizes Qi and Blood and treats Blood Deficiency Heat.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood.","With Bai Shao and Fu Ling, for diarrhea during pregnancy with mild abdominal pain.","With Chuan Xiong, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis.","With Ren Shen, Bai Zhu, Shu Di Huang and Bai Shao, for general menstrual disorders with fatigue and weakness due to Qi and Blood Deficiency."]},{"herb":"ChuanXiong","dosage":"3-9g","actions":["Invigorates the Blood, activates Qi, releases constraint and alleviates pain.","With Dang Gui, harmonizes, nourishes and invigorates the Blood and disperses Blood Stasis for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea.","With Dang Gui, Shu Di Huang and Bai Shao, for headache from Blood Deficiency."]},{"herb":"ShengJiang","dosage":"1-3g","actions":["Regulates the Spleen and Stomach.","With Da Zao, alleviates epigastric pain, nausea, and vomiting by strengthening the Spleen, harmonizes the Ying and Wei, Nourishes the Blood, prevents injury from harsh Blood movers and assists the movement of Qi."]},{"herb":"DaZao","dosage":"1.5-5g","actions":["Tonifies the Spleen and Stomach, augments Qi, nourishes the Blood, calms the Spirit and moderates and harmonizes the harsh properties of other herbs.","With Ren Shen, Bai Shao and Fu Ling, for weakness and lassitude due to Spleen and Stomach Deficiency.","with Sheng Jiang, enhances the effects of other Qi and Blood tonifying herbs by facilitating their digestion and absorption."]},{"herb":"HuangQi","dosage":"9-30g","actions":["Tonifies Qi and Blood and generates Body Fluids.","With Ren Shen or Dang Shen, for Qi Deficiency with general debility, anorexia, fatigue, tired extremities and spontaneous sweat.","With Bai Zhu, for Spleen Qi Deficiency with weakness, lassitude and loose stools.","With Dang Gui, for Qi and Blood Deficiency."]}],"actions":["Nourishes Qi and Blood"],"syndromes":["Qi and Blood Deficiency"],"manifestations":{"symptoms":["Insufficient or absent lactation after childbirth","Watery milk","The breasts are overly soft and never get engorged","No feeling of distension of the breasts","Sallow complexion","Dry skin","Poor appetite,","Tiredness","May have large amounts of lochia discharge postpartum"],"tongue":"Pale","tongueCoat":"White","pulse":"Thready and weak"},"conditions":[{"condition":"InsufficientLactation","name":"Insufficient lactation "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}