{"formula":"ZiGongAiTangSanHao","names":{"pinyin":"zi gong ai tang san hao","hanzi":"子宫癌汤三号","english":"uterine cancer #3","commonEnglish":"Uterine Cancer #3","aka":[""]},"herbs":[{"herb":"DaHuang","dosage":"2g","actions":["Invigorates the Blood, dispels Blood Stasis, drains Heat, purges accumulations, cools the Blood, reduces Fire toxicity and inhibits the growth of cancer cells.","With Gan Cao, for vomiting immediately after eating.","With Mang Xiao, for abscesses, swellings and toxic sores."]},{"herb":"MangXiao","dosage":"3g","actions":["Purges accumulations, guides out Stagnation, softens hardness, moistens Dryness, clears Heat, drains Fire and reduces swelling."]},{"herb":"MuDanPi","dosage":"4g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood, dispels Blood Stasis, drains pus and reduces swelling."]},{"herb":"TaoRen","dosage":"4g","actions":["Breaks up Blood Stasis, invigorates Blood circulation, moistens the Intestines, unblocks the bowels, drains abscesses, breaks up mobile and fixed abdominal masses, unblocks vessels and stops pain.","With Da Huang, for severe abdominal infections.","With Da Huang, Mu Dan Pi and Mang Xiao, for intestinal abscess with pain and swelling."]},{"herb":"DongGuaZi(Ren)","dosage":"4g","actions":["Clears Heat, drains Dampness, expels Phlegm, and pus and inhibits the growth of cancer cells.","With Da Huang and Mu Dan Pi, for intestinal abscess.","With Yi Yi Ren, for scanty urine and edema due Damp Obstruction."]},{"herb":"CangZhu","dosage":"4g","actions":["Strongly dries Dampness, tonifies the Spleen and Clears Dampness from the Lower Jiao."]},{"herb":"YiYiRen","dosage":"5g","actions":["Strengthens the Spleen, resolves Dampness, clears Heat, expels pus and inhibits the growth of cancer cells."]},{"herb":"GanCao","dosage":"4.5g","actions":["Clears Heat, relieves Fire toxicity, inhibits the growth of cancer cells, moderates and harmonizes the harsh properties of other herbs and guides the herbs to all twelve channels."]}],"actions":["Clears Heat","Relieves Fire toxicity","Clears Dampness from the Lower Jiao","Expels Phlegm","Purges accumulations","Invigorates the Blood","Dispels Blood Stasis,","Inhibits the growth of cancer cells"],"syndromes":["Primary stage uterine cancer due to Damp-Heat in the Lower Jiao"],"manifestations":{"symptoms":["Lower Jiao pain","Constipation or","Diarrhea","Heaviness","Headache","Dull Spirit","Abdominal distention","Mental fuzziness","Anorexia","Nausea","Vomiting","Weight loss","Melaena","Dry heaves","Fullness and tightness with very slight or no pain","Borborygmus","Diarrhea","Edema","Anemia","Hepatomegaly","The tumor is firm and irregular"],"tongue":"Normal or with a red tip","tongueCoat":"Thin, yellow and greasy","pulse":"Wiry and rapid or Wiry, tight and rapid or Soft or maybe Slippery and rapid"},"conditions":[{"condition":"UterineCancer","name":"Uterine cancer "},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}