{"formula":"ZiLuXianZongTangJiaWei","names":{"pinyin":"zi lu xian zong tang jia wei","hanzi":"紫鹿仙总汤加味","english":"placenta and deer antler immortals gathering decoction with added flavors","commonEnglish":"Placenta and Deer Antler Immortals Gathering Decoction with Added Flavors","aka":[""]},"herbs":[{"herb":"ZiHeChe","dosage":"1-3g","actions":["Tonifies the Liver and Kidneys, strengthens Jing, tonifies Qi and nourishes the Blood.","With Shu Di Huang, for chronic weakness and debility.","With Shu Di Huang, Dang Gui and Bai Shao, for Blood Deficiency."]},{"herb":"LuRong","dosage":"9g","actions":["Nourish and tonifies Qi and Blood and stops bleeding."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold and regulates the menses.","With Bai Shao, Shu Di Huang and Chuan Xiong, for menstrual irregularity, amenorrhea, and dysmenorrhea due to Blood Deficiency or Blood Stasis.","With Shu Di Huang, for Heat symptoms due to Yin Deficiency and Devastated Blood."]},{"herb":"ChuanXiong","dosage":"6-9g","actions":["Invigorates the Blood and promotes the movement of Qi.","With Dang Gui, for Blood Deficiency causing menstrual problems including dysmenorrhea, scanty menses, and amenorrhea."]},{"herb":"ShuDiHuang","dosage":"12-15g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Dang Gui, for Blood Deficiency marked by dizziness, palpitations, insomnia and menstrual dysfunction."]},{"herb":"BaiShao","dosage":"9g","actions":["Nourishes the Blood, regulates menstruation, calms Liver Yang, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood.","With Dang Gui and Shu Di HUang, for dizziness, blurred vision, and dysmenorrhea due to Blood Deficiency or Stasis."]},{"herb":"FuPenZi","dosage":"9-15g","actions":["Tonifies and stabilizes the Kidneys, astringes Jing and urine and tonifies Yang.","With Tu Si Zi, Gou Qi Zi and Wu Wei Zi, for impotence and spermatorrhea due to Kidney Deficiency.","With Gou Qi Zi, Tu Si Zi and Che Qian Zi, for lower back pain and impotence due to Kidney Deficiency."]},{"herb":"TuSiZi","dosage":"9-12g","actions":["Strengthens Yang, nourishes Yin, astringes Jing and urine, benefits the marrow and tonifies the Kidneys and Liver.","With Che Qian Zi and Shu Di Huang, for blurred vision and spots before the eyes due to Kidney and Liver Deficiency."]},{"herb":"GouQiZi","dosage":"9-15g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency."]},{"herb":"WuWeiZi","dosage":"9g","actions":["Tonifies the Kidneys and astringes Jing."]},{"herb":"CheQianZi","dosage":"6-9g","actions":["Promotes urination and clears Damp-Heat.","With Shu Di Huang and Tu Si Zi, for Liver and Kidney Deficiency causing cataracts with diminished vision.","With Shu Di Huang, Gou Qi Zi and Tu Si Zi, for Liver and Kidney Deficiency causing cataracts with diminished vision and dizziness"]},{"herb":"XianMao","dosage":"9-15g","actions":["Tonifies the Kidneys and strengthens Yang.","With Yin Yang Huo, for Menopausal hypertension."]},{"herb":"YinYangHuo","dosage":"9-15g","actions":["Tonifies the Kidneys, strengthens Yang and increases the libido."]},{"herb":"ChuanNiuXi","dosage":"9-15g","actions":["Invigorates the Blood, dispels Blood Stasis, unblocks the menses and tonifies the Kidneys and Liver."]}],"actions":["Nourishes the Kidneys","Nourishes Blood","Tonifies Jing"],"syndromes":["Kidney Yin and Jing Deficiency"],"manifestations":{"symptoms":["A young woman has reached 18 years of age and her menses have not come or","At the beginning of the tide it is comparatively slow or tardy, or","The menses has come but eventually becomes later and scantier and evolves into amenorrhea","A dark, gloomy facial complexion","Dizziness","Tinnitus","Soreness and weakness of the low back and knees","Possibly a dry mouth and throat","Tidal fever","Night sweats","Both cheeks tidally red","Five sole Heat","Dry skin","Dry, astringent eyelids","Constipation","Scanty, reddish urination","Heart palpitations"],"tongue":"Red or Pale","tongueCoat":"Scanty","pulse":"Deep and wiry or Deep and thready or Possibly floating at the inch and/or cubit positions if Yin fails to control Yang or Rapid if there is Heat"},"conditions":[{"condition":"Amenorrhea","name":"Amenorrhea"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}