{"formula":"ZiYinChuShiTangJiaJian","names":{"pinyin":"zi yin chu shi tang jia jian","hanzi":"滋阴除湿汤加減","english":"modified yin","commonEnglish":"Modified Yin-Enriching Dampness-Eliminating Decoction","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"30g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Xuan Shen, for Kidney Yin Deficiency with Fire Blazing."]},{"herb":"XuanShen","dosage":"10g","actions":["Clears Heat, cools the Blood, nourishes Yin, drains Fire and relieves toxicity."]},{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis."]},{"herb":"DanShen","dosage":"10g","actions":["Invigorates the Blood, dispels Blood Stasis, clears Heat, soothes irritability, cools the Blood and reduces abscesses."]},{"herb":"SheChuangZi","dosage":"10g","actions":["Dries Dampness, kills parasites, dispels Wind and stops itching topically"]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness."]},{"herb":"ZeXie","dosage":"12g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire."]},{"herb":"BaiXianPi","dosage":"12g","actions":["Clears Heat, resolves Fire-toxicity, expels Wind, dries Dampness, clears Damp-Heat and stops itching."]},{"herb":"BaiBianDou","dosage":"15g","actions":["Clears Summerheat, resolves Dampness and strengthens the Spleen."]},{"herb":"ShanYao","dosage":"15g","actions":["Tonifies the Spleen, nourishes Stomach Yin, tonifies Lung Qi, nourishes Lung Yin, tonifies Kidney Yin and astringes Jing."]},{"herb":"YiYiRen","dosage":"15g","actions":["Strengthens the Spleen, resolves Dampness, expels Wind-Dampness, relieves pain, clears Heat expels pus and clears Damp-Heat.","With Fu Ling, for Spleen Deficiency with Excess Dampness and edema."]},{"herb":"YiMuCao","dosage":"9g","actions":["Invigorates the Blood, dispels Stasis, Promotes urination, reduces swelling, clears Heat and resolves toxicity."]},{"herb":"XuChangQing","dosage":"9g","actions":["Removes Wind and Dampness, invigorates the Blood, stops pain, resolves toxins and stops itching."]}],"actions":["Nourishes Yin","Dries Dampness","Nourishes the Blood","Alleviates itching"],"syndromes":["Blood Dryness due to Yin Deficiency with Dampness"],"manifestations":{"symptoms":["Long-lasting and recurrent itchy patches with small vesicles","The lesions are dull red or dirty gray","The skin is rough, infiltrated or lichenified with scratch marks","Red eruptions around the edge of patches","Erosion and oozing","Crusting or scaling, or small amounts of exudation","Easily flares-up","Skin lesions spread out all over the body","Mental exhaustion","Dry throat","Thirst","Five sole Heat","Dark and scanty urine","Difficulty in falling asleep because of the intense itching"],"tongue":"Red and dry","tongueCoat":"Little or none","pulse":"Thready and rapid or Thready and slippery or Wiry and thready"},"conditions":[{"condition":"Eczema","name":"Eczema"},{"condition":"AtopicDermatitis","name":"Atopic dermatitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"atopic dermatitis with thickened and lichenfied lesions","modifications":[{"herb":"ZaoJiaoCi","modification":"+ Spina Gleditsiae"},{"herb":"WangBuLiuXing","modification":"+ Sm. Vaccariae"},{"herb":"ZeLan","modification":"+ Hb. Lycopi"}]},{"purpose":"atopic dermatitis with severe itching","modifications":[{"herb":"DaiZheShi","modification":"+ Haematitum"},{"herb":"LongGu","modification":"+ Calcined Fossilia Ossis Mastodi"}]}]}