{"formula":"ZiYinChuShiTang","names":{"pinyin":"zi yin chu shi tang","hanzi":"紫阴除湿汤","english":"yin","commonEnglish":"Yin-Enriching, Dampness-Eliminating Decoction","aka":[""]},"herbs":[{"herb":"ShengDiHuang","dosage":"15g","actions":["Clears Heat, cools the Blood, nourishes Yin and generates fluids.","With Bai Shao, for Blood Deficiency Heat."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, softens the Liver and relieves pain.","With Gan Cao, regulates the relationship between the Liver and Spleen.","With Dang Gui, nourishes Yin and Blood.","With Huang Qi, cools Heat and nourishes the Blood."]},{"herb":"DangGui","dosage":"9g","actions":["Tonifies, invigorates and harmonizes the Blood, disperses Cold, reduces swelling, expels pus, generates flesh and stops pain due to Blood Stasis.","With Bai Shao, regulates and harmonizes Qi and Blood."]},{"herb":"YuZhu","dosage":"12g","actions":["Nourishes Yin, moistens Dryness, moistens the Lungs, nourishes the Stomach and generate fluids."]},{"herb":"MuDanPi","dosage":"9g","actions":["Clears Heat, cools and harmonizes the Blood, clears Deficiency Fire, invigorates the Blood and dispels Blood Stasis.","With Sheng Di Huang, for residual Warm pathogen which has injured the Yin."]},{"herb":"FuLing","dosage":"12g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and harmonizes the Middle Jiao.","With Ze Xie, facilitates the removal of water and leaches out Dampness to treat stagnant water and Dampness."]},{"herb":"ZheBeiMu","dosage":"12g","actions":["Clears Heat, transforms Phlegm and dissipates nodules."]},{"herb":"ZeXie","dosage":"12g","actions":["Promotes urination, leaches out Dampness and drains Kidney Fire.","With Mu Dan Pi, for steaming bone disorder, dizziness, and vertigo."]},{"herb":"DiGuPi","dosage":"15g","actions":["Cools the Blood and drains Yin Deficiency Fire.","With Huang Qin, for Blood Deficiency, Steaming Bone Disorder, or other recurrent afternoon fevers.","With Mu Dan Pi, for Steaming bone disorder with and without sweating."]},{"herb":"KuShen","dosage":"9g","actions":["Clears Heat, dries Dampness, disperses Wind and stops itching."]},{"herb":"HuangQin","dosage":"12g","actions":["Clears Heat, dries Dampness, drains Fire and detoxifies."]},{"herb":"GanCao","dosage":"6g","actions":["Tonifies the Spleen, augments Qi, clears Heat and relieves Fire toxicity and moderates and harmonizes the harsh properties of other herbs."]}],"actions":["Nourishes Yin","Dries Dampness","Nourishes the Blood","Alleviates itching"],"syndromes":["Yin Deficiency with Dampness","Blood Dryness due to Yin Deficiency with Dampness"],"manifestations":{"symptoms":["Long-lasting and recurrent itchy patches with small vesicles","The lesions are dull red or dirty gray","The skin is rough, infiltrated or lichenified with scratch marks","Red eruptions around the edge of patches","Erosion and oozing","Crusting or scaling, or small amounts of exudation","Easily flares-up","Skin lesions spread out all over the body","Mental exhaustion","Dry throat","Thirst","Five sole Heat","Dark and scanty urine","Difficulty in falling asleep because of the intense itching"],"tongue":"Red and dry","tongueCoat":"Little or none","pulse":"Thready and rapid or Thready and slippery or Wiry and thready"},"conditions":[{"condition":"Eczema","name":"Eczema"},{"condition":"AtopicDermatitis","name":"Atopic dermatitis"}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"atopic dermatitis with thickened and lichenfied lesions","modifications":[{"herb":"ZaoJiaoCi","modification":"+ Spina Gleditsiae"},{"herb":"WangBuLiuXing","modification":"+ Sm. Vaccariae"},{"herb":"ZeLan","modification":"+ Hb. Lycopi"}]},{"purpose":"atopic dermatitis with severe itching","modifications":[{"herb":"DaiZheShi","modification":"+ Haematitum"},{"herb":"LongGu","modification":"+ Calcined Fossilia Ossis Mastodi"}]}]}