{"formula":"ZiYinQingGanTang","names":{"pinyin":"zi yin qing gan tang","hanzi":"滋阴清肝汤","english":"decoction for nourishing yin and clearing liver heat","commonEnglish":"Decoction for Nourishing Yin and Clearing Liver Heat","aka":[""]},"herbs":[{"herb":"DangGui","dosage":"10g","actions":["Tonifies, invigorates and harmonizes the Blood, reduces swelling, expels pus, generates flesh and alleviates pain."]},{"herb":"ShaShen","dosage":"15g","actions":["Nourishes Yin, moistens the Lungs, dispels Phlegm, nourishes the Stomach, generates fluids and clears Heat."]},{"herb":"MaiMenDong","dosage":"15g","actions":["Moistens the Lungs, nourishes Yin, nourishes Stomach Yin, moistens the Intestines and generates Fluids.","With Sheng Di Huang, for hematemesis or epistaxis due to Yin Deficiency with Excess Heat."]},{"herb":"BaiShao","dosage":"12g","actions":["Nourishes the Blood, astringes Yin, adjusts the Ying and Wei, softens the Liver and relieves pain.","With Dang Gui, nourishes Yin and Blood."]},{"herb":"ShengDiHuang","dosage":"12g","actions":["Clears Heat, cools the Blood, nourishes Yin, and generates fluids.","With Bai Shao, for Blood Deficiency Heat.","With Mai Men Dong and Nan Sha Shen, for a dry mouth, thirst, dry lips and a red tongue due to Stomach Yin Deficiency."]},{"herb":"TianHuaFen","dosage":"10g","actions":["Drains Heat and generates Fluids Clears and drains Lung Heat, transforms Phlegm and moistens Lung Dryness Relieves toxicity, expels pus and reduces swelling and inhibits the growth of cancer cells.","With Nan Sha Shen, Mai Men Dong and Sheng Di Huang, for injured Yin from Stomach Heat with excessive thirst, irritability, Dryness in the mouth, cravings after eating, and emaciation which is often in diabetes."]},{"herb":"ZhiZi","dosage":"10g","actions":["Clears Heat, reduces Fire, cools the Blood, relieves toxicity, reduces swelling, invigorates the Blood and inhibits the growth of cancer cells."]},{"herb":"FuLing","dosage":"10g","actions":["Promotes urination, leaches out Dampness, strengthens the Spleen and inhibits the growth of cancer cells."]},{"herb":"BanZhiLian","dosage":"15g","actions":["Clears Heat, resolves Fire toxins, invigorates the Blood, reduces swellings and treats various types of cancer."]}],"actions":["Clears Heat","Resolves toxicity","Nourishes Yin","Strengthens the Spleen"],"syndromes":["Liver Yin Deficiency with Liver Heat"],"manifestations":{"symptoms":["Dizziness","Impaired vision","Night blindness","Tinnitus","Irascibility","Throbbing headache with distended feeling","Flushed face","Blurred vision","Red, dry eyes with feeling of grit in eye","Dry mouth and throat with bitter taste in mouth","Palpitations","Headache","Nervousness","Insomnia with much dreaming","Dry throat","Thirst","Five Sole Heat (palms, soles and center of chest)","Night sweats","Light or late menses or","Amenorrhea","Severe, splitting headaches with dizziness","Sudden tinnitus or","Sudden deafness","Flushed face","Red, swollen, painful eyes","Irascibility with violent angry outbursts","Dry mouth","Bitter taste in mouth","Thirst","Vomiting sour or bitter liquid","Insomnia","Restlessness","Constipation or dry stools","Maybe rib pain"],"tongue":"Red and dry","tongueCoat":"Little or None","pulse":"Thready and wiry or Wiry and rapid"},"conditions":[{"condition":"LiverCancer","name":"Liver cancer"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[]}