{"formula":"ZiYinDaBuYin","names":{"pinyin":"zi yin da bu wan","hanzi":"紫阴大補饮","english":"enrich yin great supplementation pills","commonEnglish":"Enrich Yin Great Supplementation Pills","aka":[""]},"herbs":[{"herb":"ShuDiHuang","dosage":"60g","actions":["Nourishes Liver and Kidney Yin, nourishes Jing and Blood and fills the Marrow.","With Shan Yao and Shan Zhu Yu, for dizziness, weak and sore low back, impotence, night sweats and spermatorrhea due to Kidney and Liver Yin Deficiency.","With Wu Wei Zi, Shan Zhu Yu and Shan Yao, for coughing, shortness of breath and accelerated respiration."]},{"herb":"NiuXi","dosage":"45g","actions":["Invigorates the Blood, expels Blood Stasis, nourishes Liver and Kidney Yin, strengthens the sinews and bones and benefits the joints.","With Du Zhong, for low back and extremity pain and weakness due to Bi pain or Kidney Deficiency."]},{"herb":"ShanYao","dosage":"45g","actions":["Tonifies Kidney Yin and astringes Jing.","With Shu Di Huang and Shan Zhu Yu, for Kidney Deficiency."]},{"herb":"ShanZhuYu","dosage":"30g","actions":["Stabilizes the Kidneys, astringes Jing and Body Fluids, tonifies Liver and Kidney Yin and strengthens Kidney Yang.","With Wu Wei Zi, for Yin and Yang Deficiency of the Liver and Kidneys.","With Shu Di Huang, Shan Yao and Gou Qi Zi, for True Yin Deficiency.","With Shu Di Huang, nourishes Kidney Yin and secures Jing, while restraining urination and sweating."]},{"herb":"DuZhong","dosage":"30g","actions":["Tonifies the Kidneys and Liver, strengthens the sinews and bones, aids the smooth flow of Qi and Blood and tonifies Kidney Yang.","With Gou Qi Zi, for for low back pain."]},{"herb":"FuLing","dosage":"30g","actions":["Promotes urination and leaches out Dampness."]},{"herb":"BaJiTian","dosage":"30g","actions":["Tonifies the Kidneys, strengthens Yang, disperses Wind-Cold-Damp and strengthens the sinews and bones.","With Rou Cong Rong, tonifies Yang without injuring Yin."]},{"herb":"WuWeiZi","dosage":"30g","actions":["Astringes the leakage of Lung Qi, stops coughing, tonifies the Kidneys, astringes Jing, quiets the Spirit and calms and contains Heart Qi."]},{"herb":"XiaoHuiXiang","dosage":"30g","actions":["Warms the Liver and Kidneys, expels Cold and alleviates pain."]},{"herb":"RouCongRong","dosage":"30g","actions":["Tonifies the Kidneys, strengthens Yang and","benefits Jing and marrow.","With Du Zhong and Ba Ji Tian, for deficient Kidney induced pain and weakness in the lower back with a feeling of weakness in the sinews and bones."]},{"herb":"YuanZhi","dosage":"30g","actions":["Calms the Spirit, sedates the Heart, clears the channel joining the Heart and Kidney, expels Phlegm, opens the Orifices and dissipates swellings."]},{"herb":"ShiChangPu","dosage":"20g","actions":["Opens the Orifices, vaporizes Phlegm, removes filth, calms the Spirit, disperses Wind, promotes Blood flow, reduces swelling and alleviates Wind-Damp Bi.","With Yuan Zhi and Fu Ling, for forgetfulness, tinnitus and impaired hearing."]},{"herb":"GouQiZi","dosage":"20g","actions":["Nourishes and tonifies Liver and Kidney Blood and Yin and benefits Jing.","With Shu Di Huang, for Liver and Kidney Deficiency."]}],"actions":["Tonifies the Kidneys","Strengthens the brain","Increases the marrow","Strengthens Jing"],"syndromes":["Kidney Qi Deficiency"],"manifestations":{"symptoms":["A history of traumatic injury to the head","Listlessness","Slow, difficult thinking","Decreased visual acuity","Markedly decreased memory","Dizziness","Vertigo","Tinnitus","Low back and lower leg soreness and weakness"],"tongue":"Pale","tongueCoat":"Thin","pulse":"Thready and weak"},"conditions":[{"condition":"Concussion","name":"Post-concussion syndrome"},{"name":""}],"contra":{"contraindications":[""],"interactions":[""]},"notes":[""],"modifications":[{"purpose":"bone-steaming or tidal fever, aching Heat in the feet or knees, a red tongue and a rapid pulse","modifications":[{"herb":"SuanZaoRen","modification":"+ 12g Sm. Zizyphi Spinosae"},{"herb":"DiGuPi","modification":"+ 9g Cx. Lycii"},{"herb":"ZhiMu","modification":"+ 9g Rz. Anemarrhenae"},{"herb":"HuangBai","modification":"+ 9g Cx. Phellodendri"}]},{"purpose":"palpitations, irritability, agitation, and restlessness","modifications":[{"herb":"LongGu","modification":"+ 12g Fossilia Ossis Mastodi"},{"herb":"MuLi","modification":"+ 12g Concha Ostreae"}]},{"purpose":"a piercing headache due to Blood Stagnation and Deficiency","modifications":[{"herb":"HongHua","modification":"+ 9g Flos Carthami"},{"herb":"TaoRen","modification":"+ 9g Sm. Persicae"},{"herb":"JiangCan","modification":"+ 9g Bombyx Batryticatus"},{"herb":"QuanXie","modification":"+ 9g Scorpio"}]}]}